{
  "id": 10301,
  "subject": "Order #SSN4540",
  "description_text": "Hello, I bought your pedals with the haptic reactors. The pedals work, but\r\nthe haptic motors freeze after a few seconds gameplay. I've tried\r\nAutomobilista 2, Raceroom, Dirt rally 2\r\nThe different effects work fine for a short while, then it all turns into a\r\nstatic, constant \"buzz\". The ONLY way to make it stop is to restart the\r\ncomputer and start your software Simsonn manager 2.1.2 again. (CPU1: 2.0.5,\r\nCPU2: 2.0.4)\r\nI've tried to just restart the software, unplug the power etc etc, but\r\nnothing other than the method above works. It seems like the fault is in\r\nyour software because as the motors freeze, so does Simsonn manager. If I\r\npress the pedals I get no visual feedback in the software that they are\r\nbeing pressed, although they still work in the game.\r\nI'm not using your software for haptics, I'm using Simhub. When the pedals\r\nfreeze, there's a red \"light\" under their icon in Simhub. It doesn't help\r\nto press the disconnect/reconnect button in Simhub.\r\nI bought special nylon m4 screws to attach the motors to the pedals and I\r\nhave the red, non-metal washer between the motor and the pedal fastening\r\nadaptor so the motors should all be isolated.\r\nWhat's wrong you think?\r\n\r\nRegards\r\nAndreas\r\n\r\n",
  "status": 3,
  "priority": 4,
  "created_at": "2026-01-08T11:59:50Z",
  "updated_at": "2026-01-17T05:17:12Z",
  "requester_id": 158008981303,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158017313007,
      "body_text": "Hi Andreas Bertilsson,  Please uninstall the SIMSONN Manager currently installed on your PC, then download and install the latest SIMSONN Manager v2.1.3 from our official website. After installation, please update the device firmware to: CPU1: 2.0.6, CPU2: 2.0.4. Once the update is complete, unplug and replug the device, then test again. Additionally, we recommend using a wire to connect the PC chassis/case and the controller box screw/metal housing to a common ground. This often helps reduce interference and can resolve signal dropouts/disconnections. Finally, please plug the device directly into a rear USB 3.0 (blue) port on your PC, and avoid using any USB hubs, to ensure stable power and data connection.        Additionally, you can use a wire to connect the PC chassis, the control box metal screws, and the pedal metal screws together to share a common ground. This can also effectively resolve disconnection/interference issues.      If this occurs, it indicates that your PC’s grounding may be unreliable, possibly because a three-prong plug was not used in a grounded wall outlet. You can refer to the post below and connect the three metal screws on the PC case, control box, and pedals, which should resolve the disconnection issue.  https://github.com/SHWotever/SimHub/wiki/USB-Issues-Troubleshooting https://support.gomezsimindustries.com/portal/en/kb/articles/understanding-emi-and-grounding",
      "user_id": 158000445778,
      "created_at": "2026-01-17T05:17:12Z",
      "updated_at": "2026-01-17T05:17:12Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}