{
  "id": 10338,
  "subject": "SIMSONN Plus X – Firmware recovery required (axes not exposed to Windows)",
  "description_text": "Hello SIMSONN Support Team,\r\n\r\nI am writing regarding a SIMSONN Plus X pedal set received yesterday.\r\n\r\nOn the first connection, the device worked perfectly:\r\n\r\nAxes were visible and moving in Windows joy.cpl\r\n\r\nPedals were correctly detected and usable in simulators\r\n\r\nOn the following day, without any hardware changes:\r\n\r\nSIMSONN Manager crashes at startup with error\r\nunknown software exception (0x00000049)\r\n\r\nSIMSONN Manager can still detect pedal inputs\r\n\r\nHowever, Windows no longer exposes any game controller axes\r\n\r\nIn joy.cpl, no axis movement is shown\r\n\r\nAs a result, simulators cannot detect or map the pedals\r\n\r\nThis behavior strongly indicates that the device has entered a Vendor /\r\nDebug mode or that the firmware state is corrupted, preventing it from\r\noperating as a standard HID Game Controller.\r\n\r\nPlease note:\r\n\r\nWindows correctly detects the USB device\r\n\r\nDrivers and USB ports have already been verified\r\n\r\nThe issue occurs even with only the SIMSONN Plus X connected\r\n\r\nReinstalling drivers does not resolve the issue\r\n\r\nI kindly request:\r\n\r\nThe official recovery procedure\r\n\r\nThe correct GAME MODE / HID joystick compliant firmware\r\n\r\nThe official flashing or recovery tool, if required\r\n\r\nPlease do not suggest driver reinstallation, as the issue is clearly\r\nrelated to the firmware mode/state.\r\n\r\nThank you in advance for your support.\r\nI am available to provide logs, serial number, or any additional\r\ninformation if needed.\r\n\r\nKind regards,\r\nFederico\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2026-01-08T20:12:09Z",
  "updated_at": "2026-01-09T01:08:28Z",
  "requester_id": 158008988256,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158016451923,
      "body_text": "Hi Federico Landolfi,    Please uninstall your current SIMSONN Manager 2.1.2, and then install version 2.1.3 using the link we provided.  Next, perform a manual firmware update in the software: Settings → Update → Manual Firmware Update → pedals-firmware → pedals-plusx.sfu  After the update, please test again:    Disconnect and reconnect the USB, then check if all three motors are working properly.    If they all work normally, the issue has been resolved.      If, after swapping the motor connections, a motor still does not work, it indicates that the motor is damaged. We will replace the faulty VAM motor free of charge.    Additionally, please make sure to connect the device directly to the USB 3.0 blue port on the back of your computer, and do not use a USB hub to ensure a stable connection.     https://www.simsonn.com/pages/download",
      "user_id": 158000445778,
      "created_at": "2026-01-09T01:08:27Z",
      "updated_at": "2026-01-09T01:08:27Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}