{
  "id": 10778,
  "subject": "Fwd: A heartfelt message from me to you",
  "description_text": "---------- Thư đã chuyển tiếp ---------\r\nTừ: Long Nguyen <longnguyenjp.mei@gmail.com>\r\nNgày: Th 4, 24 thg 12, 2025 lúc 16:53\r\nTiêu đề: A heartfelt message from me to you\r\nĐến: <service@simsonn.com>, <support@simsonn.com>\r\n\r\n\r\nDear Simsonn Team,\r\n\r\nI normally wouldn't write an email like this, but I feel I have no other\r\nchoice but to speak honestly from my heart.\r\n\r\nOver the past weeks, I've been quietly waiting and trying to be patient.\r\nWhen I realized my main email address (longnguyenhm.ktv@gmail.com) might\r\nhave been blocked, it truly hurt me. Not because of the money alone, but\r\nbecause it makes me feel ignored and powerless.\r\n\r\nI know this commission amount is very small compared to your company’s\r\nscale. For you, it may be almost nothing. But for me, it is different. I am\r\nnot a large agency or a big partner — I am just one individual trying to\r\nmake a living through my work.\r\n\r\nI put genuine effort into promoting your brand, believing in a fair and\r\nrespectful partnership. This commission means paying my basic expenses and\r\nsupporting my family. Waiting without clarity has caused me a lot of stress\r\nand sleepless nights, especially as the year comes to an end.\r\n\r\nI am not asking for charity. I am only asking for what I have already\r\nearned through honest work. I truly hope you can understand how important\r\nthis payment is to me, even if it seems insignificant from your side.\r\n\r\nIf there has been any misunderstanding or mistake on my part, I sincerely\r\napologize. I just hope you can see me not as a number, but as a real person\r\nwho has tried his best.\r\n\r\nThank you for reading this message. I still believe in goodwill and hope\r\nfor your kindness and support.\r\n\r\nSincerely,\r\nDavid Long\r\n\r\n",
  "status": 5,
  "priority": 1,
  "created_at": "2026-01-13T10:38:14Z",
  "updated_at": "2026-01-14T10:58:22Z",
  "requester_id": 158008409276,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158017092751,
      "body_text": "此工单已关闭并合并到工单 10779 中",
      "user_id": 158000445778,
      "created_at": "2026-01-14T10:58:22Z",
      "updated_at": "2026-01-14T10:58:22Z",
      "incoming": false,
      "private": true,
      "source": 2
    }
  ]
}