{
  "id": 10797,
  "subject": "Re: Reminder: Order #SSN3974, how did it go?",
  "description_text": "One of my haptic vam pro motors quit working. The one I had on the throttle. I downloaded your software and it has been set to the correct motor type. Sent from my iPhone On Dec 29, 2025, at 5:18 PM, SIMSONN <no-reply@loox.io> wrote: ﻿ Hello Steven, We would be grateful if you shared how things look and feel. Your review helps us and the community that supports us, and it only takes a few seconds. ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ Hello Steven, We would be grateful if you shared how things look and feel. Your review helps us and the community that supports us, and it only takes a few seconds. Simsonn VAM Pro Linear Motor - the Pedals Haptic Reactor for Vibration Feedback Power Supply Dislike it Love it! Simsonn VAM Pro Linear Motor - the Pedals Haptic Reactor for Vibration Feedback Plus X Pedal Control Box Dislike it Love it! Simsonn VAM Pro Linear Motor - the Pedals Haptic Reactor for Vibration Feedback VAM (Purchase Power Supply Separately) Dislike it Love it! Difference Dislike it Love it! Unsubscribe \r\n\r\n",
  "status": 2,
  "priority": 4,
  "created_at": "2026-01-13T15:08:26Z",
  "updated_at": "2026-01-17T05:12:40Z",
  "requester_id": 158007392789,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158017155165,
      "body_text": "Hi Steven “sgrav” Gravlee,    I checked your order and it shows you purchased a VAM, not a VAM Pro. Could you please confirm a few details?    What type of telemetry/effect are you using (e.g., ABS, wheel slip, road impacts, RPM/engine vibration, etc.)?    Is the motor installed on the throttle pedal?    How long did you use it before it failed/stopped working?",
      "user_id": 158000445778,
      "created_at": "2026-01-15T02:00:36Z",
      "updated_at": "2026-01-15T02:00:36Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158017197793,
      "body_text": "1. The only effect I was using was wheel slip for accelerator pedal. With a high threshold as to not trigger unless necessary. 2. Yes the motor is installed on the throttle pedal. 3. Lasted around 10 hours of game time. ",
      "user_id": 158007392789,
      "created_at": "2026-01-15T15:04:57Z",
      "updated_at": "2026-01-15T15:04:57Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158017312972,
      "body_text": "Hi Steven “sgrav” Gravlee,  We will send you a replacement VAM vibration motor. ",
      "user_id": 158000445778,
      "created_at": "2026-01-17T05:12:40Z",
      "updated_at": "2026-01-17T05:12:40Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}