{
  "id": 10886,
  "subject": "Yêu cầu thanh toán khoản hoa hồng đã đến hạn",
  "description_text": "[image: image.png]Kính gửi Quý Đối tác,\r\n\r\nTrước hết, chúng tôi xin chân thành cảm ơn Quý Đối tác đã hợp tác và đồng\r\nhành cùng chúng tôi trong suốt thời gian vừa qua.\r\n\r\nCăn cứ theo thỏa thuận hợp tác đã ký kết giữa hai bên, chúng tôi xin trân\r\ntrọng thông báo rằng *khoản hoa hồng của chúng tôi đã đến thời hạn thanh\r\ntoán*. Tuy nhiên, đến thời điểm hiện tại, chúng tôi vẫn *chưa nhận được\r\nkhoản thanh toán tương ứng*.\r\n\r\nTheo hệ thống đối soát, *tổng số tiền hoa hồng đang chờ thanh toán là:\r\n68,26 USD*. Chúng tôi kính đề nghị Quý Đối tác vui lòng kiểm tra và *tiến\r\nhành thanh toán trong thời gian sớm nhất* theo thông tin thanh toán đã được\r\nđăng ký trước đó.\r\n\r\nViệc thanh toán đúng hạn không chỉ giúp đảm bảo quyền lợi cho cả hai bên mà\r\ncòn góp phần duy trì mối quan hệ hợp tác lâu dài, minh bạch và hiệu quả.\r\n\r\nTrong trường hợp Quý Đối tác cần thêm thông tin, chứng từ hoặc có bất kỳ\r\nvướng mắc nào liên quan đến khoản thanh toán, xin vui lòng phản hồi lại\r\nemail này để chúng tôi có thể phối hợp xử lý kịp thời.\r\n\r\nChúng tôi rất mong nhận được *phản hồi sớm nhất từ Quý Đối tác* và trân\r\ntrọng cảm ơn sự hợp tác của Quý Đối tác.\r\nTrân trọng kính chào,\r\n\r\n",
  "status": 2,
  "priority": 1,
  "created_at": "2026-01-14T10:23:26Z",
  "updated_at": "2026-01-17T10:44:24Z",
  "requester_id": 158006175016,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158017092843,
      "body_text": "Hi LO THI LÊ,  We normally pay the commission for November in January. A batch of commissions was processed a couple of days ago, and payments over USD 100 were prioritized and sent out first. ",
      "user_id": 158000445778,
      "created_at": "2026-01-14T11:00:53Z",
      "updated_at": "2026-01-14T11:00:53Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158017094169,
      "body_text": "cảm on bạn đã phản hồi cho chúng tôi biết,tôi muốn hỏi một vài câu hỏi thêm\r\nvề một một đơn đã được xử lý cách đây vài ngày nhưng, chúng tôi chưa nhận\r\nđược ,và đơn hàng đó cụ thể là bao nhiêu,chúng tôi rất mong nhận được sự\r\nphản hồi tích cực từ các ban, chúng tôi luôn luôn muốn hợp tác cùng các bạn\r\n,cùng nhau phát triển sản phẩm đến với khách hàng toàn cầu ,doanh thu sẽ\r\ntăng lên gấp nhiều hơn nữa,\r\n\r\nVào Thứ 4, 14 thg 1, 2026 vào lúc 18:01 service@simsonn.com <\r\nservice@simsonn.com> đã viết:\r\n\r\n> Hi LO THI LÊ,\r\n>\r\n> We normally pay the commission for November in January. A batch of\r\n> commissions was processed a couple of days ago, and payments over USD 100\r\n> were prioritized and sent out first.\r\n>\r\n>\r\n> ",
      "user_id": 158006175016,
      "created_at": "2026-01-14T11:18:05Z",
      "updated_at": "2026-01-14T11:18:05Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ],
  "available_langs": []
}