{
  "id": 10908,
  "subject": "Returning Plus X Pedals - Order #SSN5642",
  "description_text": "Hello!\r\n\r\nI got my brother these pedals for Christmas for his sim rig. He has an Xbox and I have a PC and he wanted these pedals because he used mine.. Well I did not check if they were compatible with Xbox and something told me to check when I got them out of the box.. I can provide pictures if you’d like but they were unused / unmounted and only taken out of the box. Am I able to return them? I can send everything back in the original packaging.\r\n\r\nThank you!\r\nNate\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2026-01-14T16:51:29Z",
  "updated_at": "2026-01-20T09:03:18Z",
  "requester_id": 158009011103,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158017166131,
      "body_text": "Hi Nathan Matthews,    We're sorry to hear about this unfortunate situation, but we generally cannot accept returns for products without defects. Since iron products are prone to scratches and other signs of use, we are typically unable to resell them. If your product is in perfect condition, you may return the package to our US warehouse. We will process your refund after receiving and inspecting the item. However, please ensure the packaging is intact and the product shows no signs of use—otherwise, your return request will not be approved!  MaZon CA Chino 13402 YORBA AVENUE, Unit 102, Chino, CA  91710 USA +1 480-387-3114",
      "user_id": 158001343601,
      "created_at": "2026-01-15T07:04:05Z",
      "updated_at": "2026-01-15T07:04:05Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158017438661,
      "body_text": "It is in perfect condition, package only opened. I will send them back. Thank you for the help! ",
      "user_id": 158009011103,
      "created_at": "2026-01-19T18:47:43Z",
      "updated_at": "2026-01-19T18:47:43Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158017476310,
      "body_text": "Hi Nathan Matthews,  You're welcome. Thank you for purchasing our product. Should you have any questions in the future, please feel free to contact us. We will address them promptly.Wish you a pleasant day.",
      "user_id": 158001343601,
      "created_at": "2026-01-20T09:03:17Z",
      "updated_at": "2026-01-20T09:03:17Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ],
  "available_langs": []
}