{
  "id": 10913,
  "subject": "My pedals order.",
  "description_text": "Hey I'm just wondering what the shipping times are for the USA.   I placed\r\nmy order last week and I haven't received any updates to get an idea of\r\nwhen to expect this order to arrive.  Thanks in advance\r\n\r\n",
  "status": 2,
  "priority": 1,
  "created_at": "2026-01-14T17:59:02Z",
  "updated_at": "2026-01-18T03:56:22Z",
  "requester_id": 158009071785,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158017322008,
      "body_text": "Hi Christopher Smith,     Your order has been shipped in two separate packages:  1. The Pro X pedals are currently sold out at our US warehouse. We have urgently arranged air freight and expect shipment on the 22nd, with an estimated delivery date around the 25th.  2. The power supply was delayed for two weeks due to a product upgrade. The upgrade is now complete, and we shipped it on the 14th.  You can track your shipping information via the following link:  https://t.17track.net/en#nums=SF6047238969245  We sincerely apologize for any inconvenience caused. Should you have any questions, we will prioritize addressing them for you.",
      "user_id": 158001343601,
      "created_at": "2026-01-17T09:28:35Z",
      "updated_at": "2026-01-17T09:28:35Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158017339585,
      "body_text": "So I'm confused here.   You said that the pro x pedals are sold out at your\r\nUS warehouse.  I ordered the plus pedals with haptics feedback.   So are\r\nyou upgrading my order to the pro x due to the shipping delay?   If so I'm\r\nokay with that.  However your website said nothing about product not being\r\nin stock.  Secondly I don't completely understand the power supply upgrade\r\nsituation fully or why the power supply would be shipped separately from\r\nthe rest of the order.  Can you please further clarify this information for\r\nme please? Thank you for your response.\r\n\r\nOn Sat, Jan 17, 2026, 3:28 AM service@simsonn.com ",
      "user_id": 158009071785,
      "created_at": "2026-01-17T19:08:13Z",
      "updated_at": "2026-01-17T19:08:13Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ],
  "available_langs": []
}