{
  "id": 10969,
  "subject": "Re: Delivery Status",
  "description_text": "Dear Simsonn Support Team,\r\n\r\nthank you for your response. I would like to address your statements, as they are not correct under applicable EU and German consumer law.\r\n\r\nYou stated that the logistics company is no longer liable after the product is marked as delivered and that you have fulfilled your responsibilities. This is not accurate. My contractual relationship exists with Simsonn, not with the logistics provider. Whether or not the shipping company considers the parcel delivered is therefore not decisive.\r\n\r\nUnder EU and German consumer law, the risk of loss remains with the seller until the goods are actually handed over to the consumer or to a person explicitly authorized by the consumer. I did not authorize any drop off, safe place delivery, or delivery without personal handover. I never received the goods.\r\n\r\nAs no personal handover took place, the contract has not been fulfilled on your side. The loss or theft of the package prior to delivery is part of the seller’s shipping risk and cannot be shifted to the consumer.\r\n\r\nI have fully fulfilled my contractual obligations by paying the purchase price in full. Since the goods were never delivered to me, I hereby request either:\r\n\r\n• a full refund of the purchase price, or  \r\n• a replacement shipment at no additional cost  \r\n\r\nPlease confirm your chosen solution within 7 days of receipt of this message, no later than January 22nd 2026.\r\n\r\nIf this matter is not resolved within the stated deadline, I will have to initiate a chargeback through my credit card provider due to non delivery of goods.\r\n\r\nI would prefer to resolve this matter amicably and look forward to your prompt confirmation.\r\n\r\nKind regards,  \r\nLeonardo Maierhofer\r\n\r\n> On 15. Jan 2026, at 10:42, service@simsonn.com wrote:\r\n> \r\n> The logistics company will no longer be liable after the product is delivered, and we also have fulfilled our responsibilities. We cannot control the theft of the package. While we are willing to take on additional responsibility, we hope you will also share part of the responsibility. Thank you for your understanding.\r\n\r\n",
  "status": 2,
  "priority": 4,
  "created_at": "2026-01-15T09:49:52Z",
  "updated_at": "2026-01-17T08:56:42Z",
  "requester_id": 158008937738,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": []
}