{
  "id": 10991,
  "subject": "Feedback and information request regarding “SQ Pro Racing” component",
  "description_text": "Subject: Feedback and information request regarding “SQ Pro Racing” component\r\n\r\nHello,\r\nmy name is Federico Bologni and I am the owner of the simulation center ETABETARACE ASD. We have been using your products for about six months and we are very satisfied with the “Simson Plus X” pedal sets — we currently have six of them. We also purchased an “HB Pro Racing” handbrake, which has performed very well.\r\n\r\nRecently, we bought an “SQ Pro Racing” sequential shifter, which unfortunately broke after just a few days of use. We decided to open it — fully aware that this would void the warranty — in order to understand the cause of the issue, and we found that the internal tension spring had snapped.\r\n\r\nI am attaching some photos of the damaged part so you can check whether this was an isolated incident or a potential weak point of the product.\r\n\r\nI am writing because we have great trust in your brand, especially considering the excellent price‑to‑quality ratio, and we would be glad to contribute to your growth by providing useful feedback based on our daily experience in the sim racing sector.\r\n\r\nThank you for your attention.\r\nKind regards,\r\n\r\n\r\n\r\n\r\nFederico Bologni\r\n\r\nTel.: +39 0438 21871\r\n\r\n\r\nAdministrator/Amministratore\r\n\r\nMob. +39 3341128923\r\n\r\n <https://www.instagram.com/etabetaraceasd/> https://www.instagram.com/etabetaraceasd/\r\n\r\n\r\n \r\n\r\n \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\netabetaraceasd.it <http://www.etabetaraceasd.it> \r\n\r\netabetarace.it <http://www.etabetarace.it/> \r\n\r\nrealrally.it <http://www.realrally.it> \r\n\r\n\r\n <https://www.facebook.com/etabetaraceasd/> \r\n\r\n <https://www.facebook.com/etabetarace/> \r\n\r\n <https://www.facebook.com/realrally2017/> \r\n\r\n \r\n\r\n\r\n \r\n\r\n \r\n\r\nPrivacy Information - This message, for the D. Lgs n. 196/2003 (Privacy Code), may contain confidential and/or privileged information. If you are not the addressee or authorized to receive this for the addressee, you must not use, copy, disclose or take any action based on this message or any information herein.If you have received this message in error, please advise the sender immediately by reply e-mail and delete this message. Thank you for your cooperation.\r\n\r\nPrivacy Policy - D.L.gs. 196/2003. Le informazioni contenute in questo messaggio di posta elettronica sono di carattere privato e confidenziale ed esclusivamente rivolte al destinatario sopra indicato. Nel caso aveste ricevuto questo messaggio di posta elettronica per errore, vi comunichiamo che ai sensi di Legge è vietato l'uso, la diffusione, distribuzione o riproduzione da parte di ogni altra persona. Siete pregati di segnalarlo immediatamente, rispondendo al mittente e distruggere quanto ricevuto (compresi i file allegati) senza farne copia o leggerne il contenuto. Il messaggio ed i suoi allegati sono protetti e scansionati con protezione antivirus di Nod32 Antivirus System\r\n\r\n \r\n\r\n\r\n\r\n\r\n\r\n \r\n\r\n\r\n",
  "status": 4,
  "priority": 1,
  "created_at": "2026-01-15T14:12:38Z",
  "updated_at": "2026-01-19T08:52:15Z",
  "requester_id": 158009124090,
  "responder_id": 158007774664,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158017235276,
      "body_text": "Hi Info,       We can send you a new spring set for replacement. The previous batch had an incorrect bending angle, which made the spring more likely to fail. We have already improved the design and produced an updated batch of springs. We have also removed the older handbrake version from sale and are currently optimizing the internal structure further. Please provide your order number and the recipient name, phone number, and shipping address, so we can arrange the replacement shipment as soon as possible. ",
      "user_id": 158000445778,
      "created_at": "2026-01-16T01:50:35Z",
      "updated_at": "2026-01-16T01:50:35Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158017267732,
      "body_text": "Hi,\r\n\r\nID ordine: 3062703997165337\r\n\r\nFederico Bologni +39 043821871\r\n\r\nvia immacolata di Lourdes, 135/b\r\n\r\nConegliano,Treviso,Veneto, Italy, 31015\r\n\r\n \r\n\r\nThank you\r\n\r\nFederico\r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\nDa: service@simsonn.com ",
      "user_id": 158009124090,
      "created_at": "2026-01-16T14:21:38Z",
      "updated_at": "2026-01-16T14:21:38Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158017395718,
      "body_text": "Hi Info,      Your product has been shipped. The logistics number is:YT2601900707545547. You can track it at this website:​https://t.17track.net/zh-cn#nums=YT2601900707545547",
      "user_id": 158007774664,
      "created_at": "2026-01-19T08:52:09Z",
      "updated_at": "2026-01-19T08:52:09Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ],
  "available_langs": []
}