{
  "id": 11020,
  "subject": "Fwd: Order #SSN5609 confirmed",
  "description_text": "Hello! My husband and I received this order, but it is missing both the haptics, power supply, and the mounts for the haptics. Could you please assist? Thank you! Michaela Gordon Owner | Senior Bookkeeper, Main Street Virtual (603) 836-9183 (207) 520-9988 www.mainstreetvirtual.com michaela@mainstreetvirtual.com Begin forwarded message: From: SIMSONN <service@simsonn.com> Date: January 1, 2026 at 9:19:35 AM EST To: michaela@mainstreetvirtual.com Subject: Order #SSN5609 confirmed Thank you for your purchase! We're getting your order ready to be shipped. We will notify you when it has been sent. SIMSONN Order #SSN5609 Thank you for your purchase! We're getting your order ready to be shipped. We will notify you when it has been sent. View your order or Visit our store Order summary Newest Simsonn Plus X Simracing Load Cell Pedal with Haptics Reactor × 1 Plus X-P2-H2 / Silver $381.50 1 × Newest Simsonn Plus X Simracing Load Cell Pedal with Haptics Reactor Plus X-P2-H2 / Silver Subtotal $381.50 Order discount -$30.00 CRSM30 (-$30.00) Shipping $11.90 Taxes $0.00 Total $363.40 USD You saved $30.00 Customer information Shipping address Glenn Gordon 25 Deering Center Road Weare NH 03281 United States Billing address Michaela Gordon 18 Hackleboro Road Canterbury NH 03224 United States Payment ending with 3217 Shipping method Loacl Shipping(No Tax) If you have any questions, reply to this email or contact us at service@simsonn.com",
  "status": 3,
  "priority": 1,
  "created_at": "2026-01-15T22:41:56Z",
  "updated_at": "2026-01-17T07:43:19Z",
  "requester_id": 158009132644,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158017318726,
      "body_text": "Hi Michaela Gordon, Your order was shipped in two separate packages. The power supply was delayed for two weeks due to product upgrades. We have now completed the upgrades and shipped it on the 14th. We sincerely apologize for any inconvenience caused. Should you have any questions, we will prioritize addressing them for you. You can track your shipping information via the following link: https://t.17track.net/en#nums=SF6047224806036",
      "user_id": 158001343601,
      "created_at": "2026-01-17T07:43:19Z",
      "updated_at": "2026-01-17T07:43:19Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ],
  "available_langs": []
}