{
  "id": 11050,
  "subject": "Re: Re: Missing Components in Order",
  "description_text": "Dear Simsonn Service Team,\nI am extremely disappointed with the handling of my order. Despite multiple follow-ups and assurances, the issue remains unresolved.\nYou have sent the light bar, but the foot plate, clearly circled in the original photo I provided, is still missing. This is unacceptable and has caused significant inconvenience, especially as this item was intended as a gift.\nPlease take the following actions immediately:\n\n*   Confirm that the foot plate will be shipped without further delay.\n*   Provide a firm delivery date and tracking details for this missing component.\n*   Ensure this matter is escalated to the appropriate team for urgent resolution.\n\nI expect a prompt response and resolution. Failure to address this will leave me no choice but to consider further action.\nThank you for your immediate attention.\nShaun Singleton\n\n\n\n________________________________\nFrom: service @simsonn.com <service @simsonn.com>\nSent: Wednesday, December 31, 2025 7:12 PM\nTo: thesingleton4 @hotmail.com <thesingleton4 @hotmail.com>\nSubject: Re: Re: Missing Components in Order\n\nHi shaun singleton,\n\nI apologize for not getting back to you sooner. Here is your replacement link.\nhttps://t.17track.net/en#nums=SF6047211904840\nOn Mon, 29 Dec at 8:53 PM , shaun singleton <thesingleton4 @hotmail.com> wrote:\nCan you let me know what is going on with my missing parts\n\nOn 24 Dec 2025, at 8:19 pm, shaun singleton <thesingleton4 @hotmail.com> wrote:\n\n﻿\nYes those components are missing\n\nOn 24 Dec 2025, at 8:18 pm, service @simsonn.com wrote:\n\n﻿\nHi shaun singleton,\n\nPlease confirm that only this part is missing, and we will arrange for a replacement as soon as possible.\nMerry Christmas!\n[https://attachment.freshdesk.com/inline/attachment?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpZCI6MTU4MDA1MzYwNTAwLCJkb21haW4iOiJzaW1zb25uLmZyZXNoc2Rlc2suY29tIiwiYWNjb3VudF9pZCI6NDIwNjAzNn0.mZHUth4sTRu3rwQsUze_TovKsoolJ2pA0zMt_dBlY4I]\n\nOn Tue, 23 Dec at 7:23 AM , shaun singleton <thesingleton4 @hotmail.com> wrote:\nThis is very frustrating you see not to be listening to me the components missing are the base plate and the led strip that sits in front of the pedals.\nI am in able to send a picture as the box has now been wrapped and ready to be given as a gift.\nThe fact I will have to explain that we are unable to construct the unit until we get the other parts.\nIf you could reference the picture I sent with the circled parts that are missing.\n\nOn 23 Dec 2025, at 5:47 pm, service @simsonn.com wrote:\n\n﻿\nHi shaun singleton,\n\nYou mean the replacement pedal is missing again? We will notify the warehouse to handle this matter seriously. We apologize for the inconvenience caused. We will send you a replacement. Please provide a photo showing the package you received.\n\n8849:4206036",
  "status": 3,
  "priority": 1,
  "created_at": "2026-01-16T07:46:50Z",
  "updated_at": "2026-01-17T07:27:25Z",
  "requester_id": 158007715094,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158017318392,
      "body_text": "We apologize for the oversight. Please confirm that the Carbon Fiber Heel Plate was indeed omitted from your shipment and verify that all installation accessories are included.",
      "user_id": 158001343601,
      "created_at": "2026-01-17T07:16:39Z",
      "updated_at": "2026-01-17T07:16:39Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158017318495,
      "body_text": "Thank you for your response. I confirm that the Carbon Fiber Heel Plate was indeed omitted from my shipment. All other installation accessories appear to be included. As mentioned previously, this order was placed in November as a Christmas gift, and due to the missing component, it has been unusable for an extended period. This additional oversight means further delay, which is very disappointing. I kindly request that you prioritize shipping the missing part immediately and consider any form of expedited delivery or compensation for the inconvenience caused. Please confirm the next steps and provide an estimated delivery timeframe. Thank you for your prompt attention to this matter.",
      "user_id": 158007715094,
      "created_at": "2026-01-17T07:25:14Z",
      "updated_at": "2026-01-17T07:25:14Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158017318519,
      "body_text": "Hi shaun singleton,    Alright, we'll resend the Carbon Fiber Heel Plate for you after work on Monday. It's expected to arrive around the 27th.",
      "user_id": 158001343601,
      "created_at": "2026-01-17T07:27:25Z",
      "updated_at": "2026-01-17T07:27:25Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ],
  "available_langs": []
}