{
  "id": 11078,
  "subject": "Problème haptic pédale",
  "description_text": "Bonjour,\r\n\r\nJ'ai reçu comme cadeau pour noël votre kit d'haptic pédale avec un VAM PRO\r\net un VAM. j'ai passé du temps à les configurer pour LMU et j'en suis très\r\ncontent. mais j'ai un problème avec le VAM lors de ma dernière session j'ai\r\nsenti qu' il s'essoufflait et aujourd'hui plus rien pas moyen de le faire\r\nfonctionné, pourtant j'ai fait attention à ne pas mettre les vibrations\r\ntrop forte et j'ai pas activer les modes qui le font fonctionner tout le\r\ntemps par peur de trop l'usé.\r\nPar contre aucun problème avec le VAM Pro il fonctionne correctement.\r\n\r\nAuriez-vous une solution à apporter pour réglé le problème ça fait même pas\r\nun mois que je l'utilise.\r\n\r\nMerci beaucoup et bonne journée à vous\r\n\r\n",
  "status": 2,
  "priority": 4,
  "created_at": "2026-01-16T12:46:06Z",
  "updated_at": "2026-01-17T12:29:09Z",
  "requester_id": 158009299061,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158017311744,
      "body_text": "Hi Guylian Grégoire,    The VAM must be used in VAM mode. Please do not use VAM Pro mode, and we also do not recommend long, continuous vibration telemetry effects such as RPM/engine vibration or speed-based effects, as they may cause overheating or damage.  Please provide your order number and the recipient’s name, phone number, and shipping address, and we will arrange a replacement VAM for you.",
      "user_id": 158000445778,
      "created_at": "2026-01-17T03:57:05Z",
      "updated_at": "2026-01-17T03:57:05Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158017326610,
      "body_text": "Hello,\r\n\r\nI used the VAM mode correctly, but the \"rpm\" indicator was vibrating very\r\nslightly; I'm going to disable it completely.\r\n\r\nI've attached the order receipt.\r\n\r\nThank you, have a good day.\r\n\r\nLe sam. 17 janv. 2026 à 04:57, service@simsonn.com ",
      "user_id": 158009299061,
      "created_at": "2026-01-17T11:52:04Z",
      "updated_at": "2026-01-17T11:52:04Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ],
  "available_langs": []
}