{
  "id": 11084,
  "subject": "Simsonn Plus X pedal not working after a month",
  "description_text": "Dear Simsonn Support,\r\n\r\nI would like to ask for your help with my Simsonn Plus X.\r\nI have made my order at the end of November, and received it in the first\r\nweek of January.\r\nToday I tried to calibrate my pedal a little bit more as I was using the\r\ndefault settings. I tried to lower the kg force on the brake pedal from the\r\ndefault 60kg to 55kg. Also, I have pressed the Calibrate button and\r\nrecalibrated all 3 of the pedals. After that none of my games has seen the\r\npedals or saw any input from it only the software. I tried to unplug the\r\npedals from the usb hub and back but it didn't work. I tried to plug it\r\ninto the motherboard via an open usb port at the back, but it didn't work\r\nalso at this point the software could not spot the pedals anymore. I tried\r\nto unplug the control box and plug it in back, also I tried to restart my\r\ncomputer (2 times already), but no luck at all. Is there a firmware update\r\nor something I need to do? How do I update the pedal firmware? Is the pedal\r\nbroken or just a control box has some issues maybe? Earlier I have noticed\r\nthe VAM Pro motors were not working, but after I moved the cable for the\r\npower supply a little bit it worked just fine. Do you have any advice what\r\nshould I try?\r\n\r\nI will be looking forward to your answer!\r\n\r\nBest regards,\r\nPéter Gál\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2026-01-16T13:43:48Z",
  "updated_at": "2026-01-19T07:47:13Z",
  "requester_id": 158008087407,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158017311687,
      "body_text": "Hi Péter Gál,    Please follow the steps below to restore the firmware and recalibrate the pedals:    Uninstall the current SIMSONN Manager from your PC;    Download and install the latest SIMSONN Manager v2.1.3 from our official website;    Press and hold the upgrade button on the PlusX control box, then unplug and replug the USB cable (keep holding the button);    Once SIMSONN Manager shows that it has entered SIMSONN Flasher mode, go to: Settings → Update → Manual Firmware Update → pedals → firmware → pedals-plusx.sfu, and complete the firmware update;    After the update, recalibrate the pedals;    Please connect the pedals directly to a rear USB 3.0 (blue) port on your PC and do not use a USB hub, to ensure stable power and data connection.",
      "user_id": 158000445778,
      "created_at": "2026-01-17T03:51:52Z",
      "updated_at": "2026-01-17T03:51:52Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158017337353,
      "body_text": "Hi,\r\n\r\nThanks for your response. I have done the firmware update as you suggested.\r\nNow the pedals are working fine, but in the software after the\r\nrecalibration it shows I am pressing it on 100% for the throttle. But in\r\ngame it is different and says I have pressing it on 96%, so now I need to\r\nadd a maximum threshold for the throttle in game, so it can sense I have\r\npressed the pedal to 100%. Sometimes it seems also it is flickering and\r\nstarts jumping back and forth between 100% and 96%.\r\nDo you have any suggestions? What can I do with this besides calibrating it\r\nin game?\r\n\r\nBest regards,\r\nPéter Gál\r\n\r\nservice@simsonn.com ",
      "user_id": 158008087407,
      "created_at": "2026-01-17T17:08:09Z",
      "updated_at": "2026-01-17T17:08:09Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158017380404,
      "body_text": "Hi Péter Gál,     This issue is usually related to the deadzone settings in SIMSONN Manager. In addition, the game itself may also have its own deadzone settings, so please check both.  If you’re experiencing jitter/fluctuation, we recommend using a wire to connect the control box to the metal screw/metal frame of the pedals to create a common ground. This typically reduces interference and resolves the jitter.  A small amount of minor fluctuation is normal and should not affect normal use.",
      "user_id": 158000445778,
      "created_at": "2026-01-19T06:11:06Z",
      "updated_at": "2026-01-19T06:11:06Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158017382678,
      "body_text": "Hi,\r\n\r\nThanks for your explanation. I will give it a try.\r\n\r\nBest regards,\r\nPéter Gál\r\n\r\nservice@simsonn.com ",
      "user_id": 158008087407,
      "created_at": "2026-01-19T06:40:32Z",
      "updated_at": "2026-01-19T06:40:32Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ],
  "available_langs": []
}