{
  "id": 11101,
  "subject": "Your parcel will soon be dispatched.",
  "description_text": "Good news! Your parcel will soon be dispatched. Track Your Parcel Hi Gubitz GmbH (LeiXuan A211), We’re happy to let you know that the shipment EVR73865305, containing 1 item, is due to be dispatched on 19/01/2026. Contents Weight Dimensions Gaming pedals 10kg 38cm x 33cm x 25cm The shipment is due to be delivered to the following address: Gubitz GmbH (LeiXuan A211)\r\nSimsonn\r\nHüttenkamp 12\r\n24536\r\nEinfeld\r\nNeumünster\r\nSchleswig-Holstein\r\nGermany Customs duties may be payable Customs duties and taxes may be applied to all parcels traveling outside of Great Britain. This parcel has been sent 'Delivered Duty Unpaid (DDU)'. This means any customs duty owed must be paid by you as the recipient. The courier or their customs representative will contact you for payment, and this will need to be paid before the parcel is released. View our guidance on customs duty here. How to track your parcel All you need to do is click the link below and enter your parcel reference number. From there, you can keep tabs on where your delivery is up to in real time, from dispatch right up to delivery! Your parcel reference number is: EVR73865305 Track Your Parcel Once your parcel has been collected by the courier, you’ll see the tracking scan “Collected” after entering your reference number into the tracker. If the parcel has been deposited at a drop-off point, you’ll only see this tracking update once the courier has picked it up from the selected location. If you have any queries about the shipment, you can contact the sender directly. Why have I received this email? The sender of this shipment has given permission for this email to be sent. If you wish to no longer receive shipment notification emails from Evri, please advise the sender of this shipment. Please click here to view our Privacy Policy. Kindest Regards, Evri CONTACT US Please visit our Contact Centre for any queries you may have. Evri is a trading name of Evri Limited. Registered in England & Wales No 03900782 Registered office Capitol House, 1 Capitol Close, Morley, Leeds, LS 27 0WH \r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2026-01-16T21:41:15Z",
  "updated_at": "2026-01-17T06:53:44Z",
  "requester_id": 158007718943,
  "responder_id": null,
  "cc_emails": [],
  "conversations": []
}