{
  "id": 11123,
  "subject": "Fwd: Simsonn Pedals and your recommendation",
  "description_text": "Hi, can you contact this person ASAP\r\n\r\n---------- Forwarded message ---------\r\nFrom: BadDadGames <funkyemt@gmail.com>\r\nDate: Sat, 17 Jan 2026, 08:16\r\nSubject: Simsonn Pedals and your recommendation\r\nTo: <randomcallsign.mail@gmail.com>\r\n\r\n\r\n       Hi Random,\r\n\r\n        I know you get tons of emails probably, but I bought simson Pedals\r\non your advice, I have now dealt with a single part breaking under the\r\nthrottle, the pre-tension spring. I have asked for a part from Simsonn per\r\ntheir support. They told me it would ship soon on Dec 19th...it is now Jan\r\n17th and they told me today they will ship it out :\"when the holiday ends\"\r\naka after Chinese New year...which runs from Feb 15-27th. Essentially, I\r\nwanted you to know what's going on with a part you endorsed. I feel like\r\nit's important you know about this and maybe contact simson and ask them\r\nwhat the heck is going on. If you like, i have emails, subreddit posts\r\nabout Simsonn lying to it's customers about delivery times, part\r\navailability, stock on hand, etc. This is unacceptable and I want you to\r\nknow since you were the one that I bought htem off your recommendation.\r\nThey are actively screwing customers, go over to /r/simsonnracing on reddit\r\nI have tons of evidence of their lies to multiple customers, my own\r\ninteraction with simsonn support where they told me they'd ship my part on\r\nthe 23rd, the 29th, the 4th, and now Jan 17th they tell me it still hasn't\r\nshipped and likely won't due to \"holidays\", which means I will have been\r\nwithout pedals since Dec 19th, until after the chinese new year, which ends\r\nFeb 27th....this isn't a company you want to endorse I don't think. I'm\r\ndown $350+$150 for the reactors(one of which never worked) and have been\r\nwithout pedals for 28 days now and I have no recourse.\r\n\r\nIan\r\n\r\n",
  "status": 3,
  "priority": 4,
  "created_at": "2026-01-17T08:58:16Z",
  "updated_at": "2026-01-17T11:16:16Z",
  "requester_id": 158004189684,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158017325042,
      "body_text": "Hi Random CallSign,    We sincerely apologize for the inconvenience caused. Due to an overwhelming volume of orders recently, our email system experienced a backlog. Our staff has already responded to him.",
      "user_id": 158001343601,
      "created_at": "2026-01-17T11:16:16Z",
      "updated_at": "2026-01-17T11:16:16Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ],
  "available_langs": []
}