{
  "id": 11157,
  "subject": "Simsonn USB box issues",
  "description_text": " I recently upgraded my control box from the one that came with the pro\r\npedals that I bought about 6-9 months ago. I do believe it is an older\r\nversion of your pedals. I recently bought the VAM haptic motors and\r\npurchased the new control box that has the outlets to power the motors, the\r\nPlus x control box . When I initially plugged it in, it gave me an option\r\nto upgrade the software, which I did then. With the new version of the\r\nsoftware upgraded I tested all 3 pedals which seemed to calibrate fine and\r\nwas picking up a signal just fine. The motors were working with testing as\r\nwell. I then went into Iracing and it was unable to pick up the pedal\r\ninputs. I decided to restart my computer after this to see if that would\r\nfix the issue. I did not restart my device as anything was updating. After\r\ndoing so, the pedals are no longer being recognized at all by the software.\r\nI have done several things to try and rectify this issue. I uninstalled and\r\nreinstalled all simmson software from my device, but i still have the same\r\nissue with the software not recognizing the pedals or not even letting me\r\nclick anywhere in the software page for the pedals. I'm also not able to do\r\na manual update to change drivers or anything. In addition to this the\r\npedals work just fine with the old box even in the new software. I'm sure\r\nthere is a way to rectify this but I am having no luck at all. I would\r\nreally like to continue to use your products as they provide great value\r\nand have been fine in use up until this point. Any help or potential\r\nreplacement box would be greatly appreciated. Attached are picture of my\r\nsimsonn products for reference.\r\n\r\n",
  "status": 2,
  "priority": 3,
  "created_at": "2026-01-17T18:11:14Z",
  "updated_at": "2026-01-19T04:12:40Z",
  "requester_id": 158009348473,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [],
  "available_langs": []
}