{
  "id": 11166,
  "subject": "SIMSONN PRO Sim Racing Pedals with Pressure Sensor and 200KG Load Cell - Hydraulic Brake Pedal, Black",
  "description_text": "Hi,\r\nI purchased these pedals around a year ago, and they have been fantastic.. however over the last day or two i've noticed the brake has stopped working correctly.\r\nI have used your calibration software, and the throttle is calibrating fine, but the brake seems strange. \r\nI press as i normally would, and it goes to 70%, then drops to 50% no matter how much harder i press?\r\nI am on several facebook and reddit groups, and you have a good support reputation. \r\nCan you please advise, as i love the pedals in general, and i just want them back working.\r\nkindest regards,Simon.\r\n",
  "status": 2,
  "priority": 1,
  "created_at": "2026-01-17T21:31:46Z",
  "updated_at": "2026-01-20T21:13:07Z",
  "requester_id": 158009349903,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158017378658,
      "body_text": "Hi Simon Richards,     If your device is running v1.7.1, please download and install SIMSONN Manager 2.1.3 first. The software may show a message like “version too old.” In that case, please manually update the firmware via: Settings → Update → Manual firmware update → pedals → firmware → pedals-plus.sfu.  After the firmware update, please recalibrate the pedals and test again to confirm whether the readings return to normal.     https://www.simsonn.com/pages/download",
      "user_id": 158000445778,
      "created_at": "2026-01-19T05:51:42Z",
      "updated_at": "2026-01-19T05:51:42Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158017401138,
      "body_text": " Hi,\r\nThanks for your quick repsonse.\r\nI have installed the Simsonn manager, and updated the firmware.\r\nI then calibrate the pedals, the calibration seems works fine, and saves back to the device.\r\nThe throttle then works perfectly as normal.\r\nHowever, I press the brake pedal, and while maintaining the same pressure on the pedal, the software registers a loss of braking force. as if I am releasing pressure. It drops to about 75-80% of what is was on first press.\r\nThis is repeatable, press brake to a fixed pressure, and the software registers the braking force, but then without releasing any pressure with my foot, the software shows the brake force going down.\r\nI can take a video of the software as it is happening if you like?\r\nThanks for all your help so far.Simon.\r\n    ",
      "user_id": 158009349903,
      "created_at": "2026-01-19T10:10:28Z",
      "updated_at": "2026-01-19T10:10:28Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158017404596,
      "body_text": "Hi Simon Richards,     It may be damping slip or the damping unit needs replacement. Please test without the damper installed: apply pressure directly to the sensor and check whether the reading still drops.    If the reading is stable/normal without the damper, the damper assembly is likely the cause, and you should replace the damper set.    If the reading still drops without the damper, the sensor is likely faulty and may need to be replaced.",
      "user_id": 158000445778,
      "created_at": "2026-01-19T10:45:28Z",
      "updated_at": "2026-01-19T10:45:28Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158017485561,
      "body_text": " Hi,\r\nJust making sure you got the below email as I have no had a reply, and would love to get my pedals working correctly again soon. I also have a league race coming up at the end of the month, and would prefer not to have to revert to my old pedals.\r\nIf you can please let me know how I can get a replacement load cell, it would be much appreciated.\r\nIf it helps I purchased the pedals in January last year, so they are just over a year old.\r\nKind regards,Simon.\r\n   ----- Forwarded Message ----- ",
      "user_id": 158009349903,
      "created_at": "2026-01-20T12:33:43Z",
      "updated_at": "2026-01-20T12:33:43Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ],
  "available_langs": []
}