{
  "id": 11170,
  "subject": "Sponsorship Opportunity",
  "description_text": "Hello,\r\n\r\nI hope this email finds you well.\r\n\r\nI am a mechanical engineering student at the University of British Columbia\r\nOkanagan campus and a member of UBCO Motorsports, our university's Formula\r\nSAE team. We are a team of highly motivated and diverse students who build\r\nboth electric and internal combustion prototype race cars to compete\r\nannually against other university teams at the international FSAE\r\ncompetitions.\r\n\r\nWe are hoping to start a discussion with you regarding potential\r\nsponsorship opportunities that Simsonn may be open to and what would be\r\nasked of us to help facilitate that partnership. Our audience goes beyond\r\nthe 13,000+ students, faculty, and staff at UBCO as we engage with the\r\nKelowna community at public events and outreach initiatives. Our social\r\nmedia has over 2,000 followers with about 4,500 impressions across our\r\nplatforms each week as well.\r\n\r\nReceiving sponsorships and building these relationships is critical for\r\novercoming the challenges our team takes on each year designing and\r\nbuilding our race cars. Would you be able to send any relevant information\r\nor an application form if that is possible? Would you be willing to set up\r\na meeting with me either over the phone or over zoom? We recently hit the\r\nconstruction phase of our simulator, and are now testing the hardware we\r\ncurrently have, which notably lacks load cell pedals such as Simsonn's Plus\r\nX and Pro X models. Attached is a video of our recent simulator shakedown!\r\n\r\nI have attached a PDF showcasing more about who we are as well as our\r\nsponsorship package. These will give you a better idea of what we do as a\r\nteam and our partnership opportunities. Let us know if you would be\r\ninterested in helping our team and supporting the great engineers and\r\nleaders of tomorrow!\r\n\r\nThank you,\r\n\r\n\r\nArthur Ribas Pinel\r\n\r\nUBCO MOTORSPORTS\r\n\r\n",
  "status": 2,
  "priority": 1,
  "created_at": "2026-01-18T00:05:58Z",
  "updated_at": "2026-01-19T03:39:57Z",
  "requester_id": 158005149780,
  "responder_id": 158001343601,
  "cc_emails": [
    "ubcomotorsports@gmail.com"
  ],
  "conversations": [],
  "available_langs": []
}