{
  "id": 1120,
  "subject": "Re: Order SSN1331 defective",
  "description_text": "I still have. It had a reply from this. The problem is ongoing. On May 28, 2025, at 1:21 PM, igetmyemailhere@icloud.com wrote: ﻿ It does not plug in, it is soldered in. You see on the device on the bottom the empty area under it? That is where it is supposed to be soldered to. This is a warranty defect. This pedal needs to be repaired or replaced. On May 25, 2025, at 9:18 PM, General and sales enquiries <service@simsonn.com> wrote: Hello! We are very sorry for the inconvenience. We suggest that you try to install the plug-in to the other side of the device, which may help improve the problem you are currently experiencing. If the problem is still not solved after trying it, or if you have any questions during the operation, please feel free to let us know. Thank you for your tolerance and cooperation. <Catch.jpg> service@simsonn.com From: igetmyemailhere Date: 2025-05-25 03:25 To: General and sales enquiries Subject: Re: Order SSN1331 defective The USB just connects/disconnects over and over and over. I’ve attached a picture. <C00F9811-0CB9-4D(05-26-10-15-57).jpeg><4922F26C-E155-46(05-26-10-15-57).jpeg> On May 13, 2025, at 8:52 PM, General and sales enquiries <service@simsonn.com> wrote: Hi, We are very sorry for the inconvenience caused. Could you please provide some pictures or a video for us? Then we can check what the problem is service@simsonn.com From: igetmyemailhere Date: 2025-05-14 01:26 To: service Subject: Order SSN1331 defective I ordered some pedals from you about 2-3 weeks ago, and they are defective. How do I return them?",
  "status": 3,
  "priority": 1,
  "created_at": "2025-07-02T17:04:15Z",
  "updated_at": "2025-07-07T04:26:25Z",
  "requester_id": 158001875748,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158004453141,
      "body_text": "Hi Scott Catterton,  I wasn’t able to see the image you sent. Could you please resend it so I can better identify the issue? Don’t worry — I’ll do my best to help you resolve any problems. ",
      "user_id": 158000445778,
      "created_at": "2025-07-07T04:26:25Z",
      "updated_at": "2025-07-07T04:26:25Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}