{
  "id": 11402,
  "subject": "Sponsorship",
  "description_text": "Dear Simsonn Marketing & Partnerships Team,\r\nMy name is Gavin Roberts AKA GETGAVD, and I run one of the most engaged BeamNG.drive-focused channels on YouTube and Twitch with 44.5k Twitch 6.5k Youtube subscribers.\r\nI specialize in realistic driving, crash physics testing, police chases, multiplayer chaos, and automation testing .\r\nWhy I’m reaching outI’m a massive sim racer in real life and i would like to use Simsonn while using my sim rig , and I believe a partnership would be a win-win: your products would get authentic, long-term exposure in front of hundreds of thousands of sim-racing and BeamNG enthusiasts who are actively in the market for high-end Equipment.\r\n- Top collaborating creators: Camodo Gaming (2.3M+ subs) & Neilogical (900K+ subs) — we regularly record together and cross-promote- Demographics: 85% male, 16–34 years old, primarily USA, UK, Germany, Australia — exactly the sim-racing hardware buying audience\r\n Example Collaborations with Camodo Gaming & Neilogical & Ashmaker000 - The WORST Idea Ever: Figure-8 Limo Racing with Pinball Mode! (BeamNG Drive) – 50K+ views (Camodo Gaming)- Figure 8 Racing In BeamNG, But We have GIANT Spike Balls! 20K+ views (Neilogical)- Links available upon request\r\n What I Can Offer Simsonn 1. Dedicated review / first-impressions video of any new or existing Simsonn product 2. Permanent “My Gear” section in video description with affiliate/discount code and direct links3. Product placement in every BeamNG video going forward (logo on overlay + verbal mention)4. Custom discount code for my audience (e.g. “[GETGAVD]10” for 10% off) — proven to drive sales with past sponsors5. Sponsored livestream series (“Simsonn Racing Friday Chaos” or similar)6. Social media posts (Twitter/X, Instagram, TikTok, Discord) announcing the partnership\r\n#### My Current Sim Setup (so you know I’m serious)-CSR racing comboso everything I say on camera is 100% genuine.\r\n#### Let’s Make It HappenI’m looking for either:- Free or heavily discounted review gear in exchange for long-term promotion, or- An official affiliate/partnership deal with commission + bonus gear\r\nI’m flexible and easy to work with — many brands already trust me because of the clean, family-friendly content and proven conversion rates.\r\nIf this sounds interesting, just reply to this email or shoot me a message on Discord (https://discord.gg/83G9XYkC) and we can hop on a quick call to discuss details.\r\nThank you for your time, and keep making the best VR hardware on the planet!\r\nBest regards,  Gavin Roberts  [GETGAVD]  YouTube: https://www.youtube.com/@GETGAVDLatest Camodo collab: https://www.youtube.com/watch?v=PQrXu7NHNZE&t=1093s  Latest Neilogical collab: https://www.youtube.com/watch?v=aWC_qfcHVhI&t=3s\r\nLooking forward to representing Simsonn in the BeamNG community!\r\n\r\nwww.twitch.tv/gavthestig\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
  "status": 2,
  "priority": 1,
  "created_at": "2026-01-20T19:51:30Z",
  "updated_at": "2026-01-20T19:51:30Z",
  "requester_id": 158009543734,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [],
  "available_langs": []
}