{
  "id": 119,
  "subject": "Re: Brake Pedal Issue",
  "description_text": "Thank you for the response.  Very disappointing but I understand.  Please\r\nsend me the information on how and where to return the item. Thank you.\r\n\r\nChris\r\n\r\nOn Tue, Jun 3, 2025 at 6:21 AM support <support@simsonn.com> wrote:\r\n\r\n>\r\n> Hello, without a video, we’re unable to determine whether the issue lies\r\n> with the pedal sensor or the main controller.\r\n>\r\n> We’re not repeatedly asking for a video without reason — it’s simply to\r\n> help us accurately identify the source of the problem.\r\n>\r\n> We’re happy to send you a replacement part, but without confirmation, we\r\n> can’t be sure which specific part needs to be replaced. Thank you for your\r\n> understanding.\r\n> ​\r\n> ---- 回复的原邮件 ----\r\n> 发件人 General and sales enquiries<service@simsonn.com> <service@simsonn.com>\r\n> 发送日期 2025年06月03日 19:09\r\n> 收件人 技术支持<support@simsonn.com> <support@simsonn.com>\r\n> 主题 转发：回复：Brake Pedal Issue\r\n>\r\n>\r\n>\r\n> ----------转发的邮件信息----------\r\n> 发件人：General and sales enquiries<service@simsonn.com>\r\n> 日期：2025年6月1日 周日 16:22\r\n> 收件人：Chris Schillings<cwschillings@gmail.com>\r\n> 主题：回复：Brake Pedal Issue\r\n>\r\n>\r\n> Hello, I'm sorry for not processing your email in time. We are on the\r\n> Dragon Boat Festival holiday. I have marked your email and our support\r\n> staff will solve your problem for you as soon as possible after the\r\n> holiday. I am very sorry for the delay. Sincere apologies!\r\n>\r\n>\r\n>\r\n> On Fri, May 30, 2025 07:56 AM Chris Schillings<cwschillings@gmail.com>\r\n> wrote:\r\n> Hello,\r\n>\r\n> I haven't heard back from you.  Could you please send me the information I\r\n> need to return this item?  Or, a replacement brake pedal would be\r\n> acceptable.  Thank you.\r\n>\r\n> Chris Schillings\r\n>\r\n> On Mon, May 26, 2025 at 9:59 AM Chris Schillings <cwschillings@gmail.com>\r\n> wrote:\r\n>\r\n>> Hello,\r\n>>\r\n>> I have explained to you in 3 previous emails that I do not have a video\r\n>> of the issue.  I have removed the pedals from cockpit and they are very\r\n>> difficult to reinstall.  I have provided photos and a detailed description\r\n>> of the issue.  It has been 13 days since I emailed you and so far all I\r\n>> have received is repeated requests for photos and videos.  This entire\r\n>> process has been very frustrating and disappointing and I no longer am\r\n>> interested in your product.  Please provide me the information needed to\r\n>> return this defective product for a full refund or send me a new brake\r\n>> pedal.  Thank you.\r\n>>\r\n>> Chris Schillings\r\n>>\r\n>> On Sun, May 25, 2025 at 7:05 PM General and sales enquiries <\r\n>> service@simsonn.com> wrote:\r\n>>\r\n>>>\r\n>>> Hello! Thank you for providing the pictures in time! We have\r\n>>> synchronized the pictures to the engineers as soon as possible. If it is\r\n>>> convenient for you, can you add a video to show the specific problems you\r\n>>> encountered? Dynamic operation demonstrations can help engineers capture\r\n>>> details faster and speed up problem troubleshooting. If you have any\r\n>>> questions or need assistance, please feel free to contact us. Thank you for\r\n>>> your understanding and cooperation!\r\n>>> ------------------------------\r\n>>> service@simsonn.com\r\n>>>\r\n>>>\r\n>>> *From:* Chris Schillings <cwschillings@gmail.com>\r\n>>> *Date:* 2025-05-24 07:36\r\n>>> *To:* General and sales enquiries <service@simsonn.com>\r\n>>> *Subject:* Re: Re: Brake Pedal Issue\r\n>>> Here are more pics.\r\n>>>\r\n>>> On Thu, May 22, 2025 at 10:19 PM Chris Schillings <\r\n>>> cwschillings@gmail.com> wrote:\r\n>>>\r\n>>>> Hello,\r\n>>>>\r\n>>>> Here is the picture that I sent on 17th that shows the position of the\r\n>>>> pedal on the bracket.  Is there something else you need to see?\r\n>>>>\r\n>>>>\r\n>>>> On Thu, May 22, 2025 at 8:33 PM General and sales enquiries <\r\n>>>> service@simsonn.com> wrote:\r\n>>>>\r\n>>>>>\r\n>>>>> Hello! I would like to confirm with you where the pedal was originally\r\n>>>>> installed on the bracket? The current situation may be that the brake\r\n>>>>> sensor is blocked by the bracket, resulting in a reversal phenomenon.\r\n>>>>> Please provide relevant information and we will further assist you in\r\n>>>>> troubleshooting and solving the problem according to the situation.\r\n>>>>> ------------------------------\r\n>>>>> service@simsonn.com\r\n>>>>>\r\n>>>>>\r\n>>>>> *From:* Chris Schillings <cwschillings@gmail.com>\r\n>>>>> *Date:* 2025-05-23 03:49\r\n>>>>> *To:* General and sales enquiries <service@simsonn.com>\r\n>>>>> *Subject:* Re: Re: Brake Pedal Issue\r\n>>>>> Hello,\r\n>>>>>\r\n>>>>> I feel like you are not reading my emails.  The last two emails you\r\n>>>>> have sent me ask for items that I have either already provided or have\r\n>>>>> discussed with you previously.  If you would please refer to the email I\r\n>>>>> sent on 5/17, that may help you.  I do not have a \"video\" of the problem\r\n>>>>> and have since removed the pedals from my system.  Is a video necessary or\r\n>>>>> does my description provide enough information?  Maybe it would be possible\r\n>>>>> to connect me directly to an engineer rather than 3rd party communication\r\n>>>>> to clear up the miscommunications?  If a video is absolutely necessary,\r\n>>>>> this will require me to spend an hour or two removing my current pedals\r\n>>>>> from the system and re-installing your pedals.  Thank you.\r\n>>>>>\r\n>>>>> Chris Schillings\r\n>>>>> (707) 239-8568\r\n>>>>>\r\n>>>>> On Wed, May 21, 2025 at 7:05 PM General and sales enquiries <\r\n>>>>> service@simsonn.com> wrote:\r\n>>>>>\r\n>>>>>>\r\n>>>>>> Hi，regarding the software problem, our engineers need your help to\r\n>>>>>> provide the software failure video so that we can solve the problem for you\r\n>>>>>> as soon as possible. Thank you for your understanding and support!\r\n>>>>>> ------------------------------\r\n>>>>>> service@simsonn.com\r\n>>>>>>\r\n>>>>>>\r\n>>>>>> *From:* Chris Schillings <cwschillings@gmail.com>\r\n>>>>>> *Date:* 2025-05-22 04:46\r\n>>>>>> *To:* General and sales enquiries <service@simsonn.com>\r\n>>>>>> *Subject:* Re: Re: Brake Pedal Issue\r\n>>>>>> Hello,\r\n>>>>>>\r\n>>>>>> Haven't heard from you.  Did you receive my response?\r\n>>>>>>\r\n>>>>>> On Mon, May 19, 2025 at 10:59 AM Chris Schillings <\r\n>>>>>> cwschillings@gmail.com> wrote:\r\n>>>>>>\r\n>>>>>>> Hello,\r\n>>>>>>>\r\n>>>>>>> The order number is included in the original email.  I purchased the\r\n>>>>>>> Simsonn Pro Plus Upgrade order order #SSN1424.  Hope that helps.\r\n>>>>>>>\r\n>>>>>>> Chris Schillings\r\n>>>>>>> (707) 239-8568\r\n>>>>>>>\r\n>>>>>>> On Sun, May 18, 2025 at 11:03 PM General and sales enquiries <\r\n>>>>>>> service@simsonn.com> wrote:\r\n>>>>>>>\r\n>>>>>>>>\r\n>>>>>>>> Hello, we are very sorry for the inconvenience! Which upgrade kit\r\n>>>>>>>> did you buy? Please provide the order number. In addition, regarding the\r\n>>>>>>>> software problem, our engineers need your help to provide the software\r\n>>>>>>>> failure video so that we can solve the problem for you as soon as possible.\r\n>>>>>>>> Thank you for your understanding and support!\r\n>>>>>>>> ------------------------------\r\n>>>>>>>> service@simsonn.com\r\n>>>>>>>>\r\n>>>>>>>>\r\n>>>>>>>> *From:* Chris Schillings <cwschillings@gmail.com>\r\n>>>>>>>> *Date:* 2025-05-18 08:50\r\n>>>>>>>> *To:* General and sales enquiries <service@simsonn.com>\r\n>>>>>>>> *Subject:* Re: Brake Pedal Issue\r\n>>>>>>>> Thanks for the response. I apologize, but I do not have a video\r\n>>>>>>>> because I’ve already removed the pedal.  I Took a couple pictures of the\r\n>>>>>>>> pedal in case that might help.\r\n>>>>>>>>\r\n>>>>>>>> This is the best description I can give the problem. I installed\r\n>>>>>>>> the throttle and pedal on my machine with the default red elastomers\r\n>>>>>>>> attached.  I was able to calibrate both the pedal and break with the\r\n>>>>>>>> Simsonn software but as soon as I touched the break, it would invert itself\r\n>>>>>>>> to 100%. Then, if I pushed on the break very hard, it would start to go\r\n>>>>>>>> down from 100 to maybe as far as 75. Using the invert brake setting in\r\n>>>>>>>> Assetto Corsa did not resolve this issue.\r\n>>>>>>>>\r\n>>>>>>>> I found that if I cranked down the preload screw the 100% would\r\n>>>>>>>> start to diminish. So I swapped out the red elastomers with the blue and I\r\n>>>>>>>> put in a large spacer. This seemed to help as I was able to once again\r\n>>>>>>>> calibrate the pedal in the Simsonn software. It even appeared that the\r\n>>>>>>>> brake was working normally in the Simsonn software. However, with every\r\n>>>>>>>> game, the brake would not activate until it was 20 to 30% pushed and the\r\n>>>>>>>> in-game  braking would jump from 0 to 25%. No matter what I did, I couldn’t\r\n>>>>>>>> make the break work for that first 25%.\r\n>>>>>>>>\r\n>>>>>>>> Also, when I would go back to the software, the pedal calibration\r\n>>>>>>>> seem to undo itself. It would be back to 100%. But then I could push it and\r\n>>>>>>>> it would fall to 75 and if I continue to push it a few more times it would\r\n>>>>>>>> drop back to zero.\r\n>>>>>>>>\r\n>>>>>>>> I have made sure that the connector box is nowhere near any\r\n>>>>>>>> electrical outlets or other interference.\r\n>>>>>>>>\r\n>>>>>>>> I’ve had to switch back to my thrustmaster pedals In the meantime.\r\n>>>>>>>> This is incredibly frustrating and has cost me hours of troubleshooting and\r\n>>>>>>>> headaches. I apologize, but my patience is very thin with this pedal set.\r\n>>>>>>>>\r\n>>>>>>>> Unless you have some easy fix that will be worth me spending the\r\n>>>>>>>> effort and two hours of putting the pedals back on the machine, I would\r\n>>>>>>>> appreciate if you would send me a new brake pedal. I haven’t given up on\r\n>>>>>>>> the product yet. I’m just hoping that maybe there is a defect in this one\r\n>>>>>>>> and the one you sent me will work great. I will be happy to return this\r\n>>>>>>>> brake in exchange for a new one. Thank you.\r\n>>>>>>>>\r\n>>>>>>>> Chris Schillings\r\n>>>>>>>>\r\n>>>>>>>> On Tue, May 13, 2025 at 6:55 PM General and sales enquiries <\r\n>>>>>>>> service@simsonn.com> wrote:\r\n>>>>>>>>\r\n>>>>>>>>> Hi,\r\n>>>>>>>>>\r\n>>>>>>>>> We are very sorry for the inconvenience caused. Could you please\r\n>>>>>>>>> provide some pictures or a video for us? Then we can check what the problem\r\n>>>>>>>>> is\r\n>>>>>>>>>\r\n>>>>>>>>> ------------------------------\r\n>>>>>>>>> service@simsonn.com\r\n>>>>>>>>>\r\n>>>>>>>>>\r\n>>>>>>>>> *From:* Chris Schillings <cwschillings@gmail.com>\r\n>>>>>>>>> *Date:* 2025-05-14 01:04\r\n>>>>>>>>> *To:* service <service@simsonn.com>\r\n>>>>>>>>> *Subject:* Brake Pedal Issue\r\n>>>>>>>>> Good Morning,\r\n>>>>>>>>>\r\n>>>>>>>>> I recently ordered the Simsonn Pro Plus Pedal Upgrade set (order\r\n>>>>>>>>> #SSN1424).  For unknown reasons I cannot get the brake pedal to calibrate\r\n>>>>>>>>> properly.  The calibration works initially works normally, however when I\r\n>>>>>>>>> push on the brake after calibration it immediately flips to 100%\r\n>>>>>>>>> activated.  Nothing I do seems to change this issue.  The throttle works\r\n>>>>>>>>> flawlessly.  I have troubleshooted the issue by;\r\n>>>>>>>>>\r\n>>>>>>>>> 1. Rebooting\r\n>>>>>>>>> 2. Re-installing the app\r\n>>>>>>>>> 3. Adjusting the polymers and spring tension\r\n>>>>>>>>> 4. Swapping out elastomers\r\n>>>>>>>>> 5. Using other software (FreeJoy and DiView)\r\n>>>>>>>>> 6. Unplugging everything that may cause interference\r\n>>>>>>>>> 7. Moving the system away from power sources\r\n>>>>>>>>>\r\n>>>>>>>>> I have been able to get the pedal to calibrate by greatly\r\n>>>>>>>>> ratcheting down the tension on the elastomers.  However this greatly\r\n>>>>>>>>> reduces the travel of the brake.  And when I did this, the brake would\r\n>>>>>>>>> travel 20% before even recording pressure.\r\n>>>>>>>>>\r\n>>>>>>>>> I believe it may be time for a return unless you have any other\r\n>>>>>>>>> suggestions.\r\n>>>>>>>>>\r\n>>>>>>>>> Thank you,\r\n>>>>>>>>>\r\n>>>>>>>>> Chris Schillings\r\n>>>>>>>>> (707) 239-8568\r\n>>>>>>>>> cwschillings@gmail.com\r\n>>>>>>>>>\r\n>>>>>>>>>\r\n\r\n",
  "status": 3,
  "priority": 4,
  "created_at": "2025-06-03T23:51:05Z",
  "updated_at": "2025-06-05T06:32:41Z",
  "requester_id": 158000954767,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158002321380,
      "body_text": "ID 为 109 的工单已合并到此工单。",
      "user_id": 158000445778,
      "created_at": "2025-06-04T02:04:56Z",
      "updated_at": "2025-06-04T02:04:56Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158002321381,
      "body_text": "合并来自工单109  \n      主题: 转发：回复：Brake Pedal Issue  \n      描述:  \n   \n \n \n   \n \n             ----------转发的邮件信息---------- \n \n \n发件人：General and sales enquiries<service@simsonn.com>\n \n \n日期：2025年6月1日 周日 16:22\n \n \n收件人：Chris Schillings<cwschillings@gmail.com>\n \n \n主题：回复：Brake Pedal Issue\n \n \n   \n   \n \n Hello, I'm sorry for not processing your email in time. We are on the Dragon Boat Festival holiday. I have marked your email and our support staff will solve your problem for you as soon as possible after the holiday. I am very sorry for the delay. Sincere apologies! \n   \n   \n   \n   \n \n \n\n On Fri, May 30, 2025 07:56 AM Chris Schillings<cwschillings@gmail.com> wrote: \n \n \n Hello,   \n I haven't heard back from you.  Could you please send me the information I need to return this item?  Or, a replacement brake pedal would be acceptable.  Thank you.   \n   \n Chris Schillings \n \n   On Mon, May 26, 2025 at 9:59 AM Chris Schillings <cwschillings@gmail.com> wrote: \n  \n \n Hello,   \n I have explained to you in 3 previous emails that I do not have a video of the issue.  I have removed the pedals from cockpit and they are very difficult to reinstall.  I have provided photos and a detailed description of the issue.  It has been 13 days since I emailed you and so far all I have received is repeated requests for photos and videos.  This entire process has been very frustrating and disappointing and I no longer am interested in your product.  Please provide me the information needed to return this defective product for a full refund or send me a new brake pedal.  Thank you.  \n   \n Chris Schillings \n \n  \n On Sun, May 25, 2025 at 7:05 PM General and sales enquiries <service@simsonn.com> wrote: \n \n   \n \n \n \n Hello! Thank you for providing the pictures in time! We have synchronized the pictures to the engineers as soon as possible. If it is convenient for you, can you add a video to show the specific problems you encountered? Dynamic operation demonstrations can help engineers capture details faster and speed up problem troubleshooting. If you have any questions or need assistance, please feel free to contact us. Thank you for your understanding and cooperation! \n \n   service@simsonn.com   \n \n   \n  \n \nFrom: Chris Schillings\n \n \nDate: 2025-05-24 07:36 \n \nTo: General and sales enquiries\n \n \nSubject: Re: Re: Brake Pedal Issue \n  \n  \n  Here are more pics.   \n \n \n  \n On Thu, May 22, 2025 at 10:19 PM Chris Schillings <cwschillings@gmail.com> wrote: \n \n \n Hello,   \n Here is the picture that I sent on 17th that shows the position of the pedal on the bracket.  Is there something else you need to see? \n \n \n  \n On Thu, May 22, 2025 at 8:33 PM General and sales enquiries <service@simsonn.com> wrote: \n \n   \n \n \n \n Hello! I would like to confirm with you where the pedal was originally installed on the bracket? The current situation may be that the brake sensor is blocked by the bracket, resulting in a reversal phenomenon. Please provide relevant information and we will further assist you in troubleshooting and solving the problem according to the situation. \n \n   service@simsonn.com   \n \n   \n  \n \nFrom: Chris Schillings\n \n \nDate: 2025-05-23 03:49 \n \nTo: General and sales enquiries\n \n \nSubject: Re: Re: Brake Pedal Issue \n  \n  \n Hello,   \n I feel like you are not reading my emails.  The last two emails you have sent me ask for items that I have either already provided or have discussed with you previously.  If you would please refer to the email I sent on 5/17, that may help you.  I do not have a \"video\" of the problem and have since removed the pedals from my system.  Is a video necessary or does my description provide enough information?  Maybe it would be possible to connect me directly to an engineer rather than 3rd party communication to clear up the miscommunications?  If a video is absolutely necessary, this will require me to spend an hour or two removing my current pedals from the system and re-installing your pedals.  Thank you.  \n   \n Chris Schillings \n (707) 239-8568 \n \n  \n On Wed, May 21, 2025 at 7:05 PM General and sales enquiries <service@simsonn.com> wrote: \n \n   \n \n \n \n Hi，regarding the software problem, our engineers need your help to provide the software failure video so that we can solve the problem for you as soon as possible. Thank you for your understanding and support! \n \n   service@simsonn.com   \n \n   \n  \n \nFrom: Chris Schillings\n \n \nDate: 2025-05-22 04:46 \n \nTo: General and sales enquiries\n \n \nSubject: Re: Re: Brake Pedal Issue \n  \n  \n Hello,   \n Haven't heard from you.  Did you receive my response? \n \n  \n On Mon, May 19, 2025 at 10:59 AM Chris Schillings <cwschillings@gmail.com> wrote: \n \n \n Hello,   \n The order number is included in the original email.  I purchased the Simsonn Pro Plus Upgrade order order #SSN1424.  Hope that helps.   \n   \n Chris Schillings \n (707) 239-8568 \n \n  \n On Sun, May 18, 2025 at 11:03 PM General and sales enquiries <service@simsonn.com> wrote: \n \n   \n \n \n \n Hello, we are very sorry for the inconvenience! Which upgrade kit did you buy? Please provide the order number. In addition, regarding the software problem, our engineers need your help to provide the software failure video so that we can solve the problem for you as soon as possible. Thank you for your understanding and support! \n \n   service@simsonn.com   \n \n   \n  \n \nFrom: Chris Schillings\n \n \nDate: 2025-05-18 08:50 \n \nTo: General and sales enquiries\n \n \nSubject: Re: Brake Pedal Issue \n  \n  \n Thanks for the response. I apologize, but I do not have a video because I’ve already removed the pedal.  I Took a couple pictures of the pedal in case that might help. \n   \n This is the best description I can give the problem. I installed the throttle and pedal on my machine with the default red elastomers attached.  I was able to calibrate both the pedal and break with the Simsonn software but as soon as I touched the break, it would invert itself to 100%. Then, if I pushed on the break very hard, it would start to go down from 100 to maybe as far as 75. Using the invert brake setting in Assetto Corsa did not resolve this issue. \n   \n I found that if I cranked down the preload screw the 100% would start to diminish. So I swapped out the red elastomers with the blue and I put in a large spacer. This seemed to help as I was able to once again calibrate the pedal in the Simsonn software. It even appeared that the brake was working normally in the Simsonn software. However, with every game, the brake would not activate until it was 20 to 30% pushed and the in-game  braking would jump from 0 to 25%. No matter what I did, I couldn’t make the break work for that first 25%. \n \n   \n Also, when I would go back to the software, the pedal calibration seem to undo itself. It would be back to 100%. But then I could push it and it would fall to 75 and if I continue to push it a few more times it would drop back to zero. \n   \n I have made sure that the connector box is nowhere near any electrical outlets or other interference. \n   \n I’ve had to switch back to my thrustmaster pedals In the meantime.  This is incredibly frustrating and has cost me hours of troubleshooting and headaches. I apologize, but my patience is very thin with this pedal set.   \n   \n Unless you have some easy fix that will be worth me spending the effort and two hours of putting the pedals back on the machine, I would appreciate if you would send me a new brake pedal. I haven’t given up on the product yet. I’m just hoping that maybe there is a defect in this one and the one you sent me will work great. I will be happy to return this brake in exchange for a new one. Thank you.   \n   \n Chris Schillings  \n   \n  \n On Tue, May 13, 2025 at 6:55 PM General and sales enquiries <service@simsonn.com> wrote: \n \n \n \n \nHi,  We are very sorry for the inconvenience caused. Could you please provide some pictures or a video for us? Then we can check what the problem is \n   \n \n   service@simsonn.com   \n \n \n \n   \n  \n \nFrom: Chris Schillings\n \n \nDate: 2025-05-14 01:04 \n \nTo: service\n \n \nSubject: Brake Pedal Issue \n  \n  \n Good Morning,   \n I recently ordered the Simsonn Pro Plus Pedal Upgrade set (order #SSN1424).  For unknown reasons I cannot get the brake pedal to calibrate properly.  The calibration works initially works normally, however when I push on the brake after calibration it immediately flips to 100% activated.  Nothing I do seems to change this issue.  The throttle works flawlessly.  I have troubleshooted the issue by; \n   \n 1. Rebooting \n 2. Re-installing the app \n 3. Adjusting the polymers and spring tension \n 4. Swapping out elastomers \n 5. Using other software (FreeJoy and DiView) \n 6. Unplugging everything that may cause interference \n 7. Moving the system away from power sources \n   \n I have been able to get the pedal to calibrate by greatly ratcheting down the tension on the elastomers.  However this greatly reduces the travel of the brake.  And when I did this, the brake would travel 20% before even recording pressure.   \n   \n I believe it may be time for a return unless you have any other suggestions.   \n   \n Thank you, \n   \n Chris Schillings \n (707) 239-8568 \n cwschillings@gmail.com",
      "user_id": 158000445778,
      "created_at": "2025-06-04T02:04:57Z",
      "updated_at": "2025-06-04T02:04:57Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158002321390,
      "body_text": "你好，Chris Schillings，  Hello, this issue is likely caused by adjusting the pedal damping, which requires a recalibration of the zero point (initial position).  That explains why the output doesn't start until you've pressed the pedal around 20% to 30%.  Please install ToDesk, a remote assistance tool — I can help you reconfigure the offset and fix the issue within a few minutes. ",
      "user_id": 158000445778,
      "created_at": "2025-06-04T02:05:26Z",
      "updated_at": "2025-06-04T02:05:26Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158002431826,
      "body_text": "ID 为 5 的工单已合并到此工单。",
      "user_id": 158000445778,
      "created_at": "2025-06-05T06:14:11Z",
      "updated_at": "2025-06-05T06:14:11Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158002431827,
      "body_text": "合并来自工单5  \n      主题: Re: Re: Brake Pedal Issue  \n      描述:  When I request a replacement of a refund, you customer support just stops responding?  I will be  by posting this email chain in in my race league forums as well as I-racing forums to make sure everyone is aware that Simsonn does not honor its return policy or replace defective products.   \n   \n Chris Schillings \n \n  \n On Thu, May 29, 2025 at 4:56 PM Chris Schillings <cwschillings@gmail.com> wrote: \n \n \n Hello,   \n I haven't heard back from you.  Could you please send me the information I need to return this item?  Or, a replacement brake pedal would be acceptable.  Thank you.   \n \n \n   \n Chris Schillings \n \n  \n On Mon, May 26, 2025 at 9:59 AM Chris Schillings <cwschillings@gmail.com> wrote: \n \n \n Hello,   \n I have explained to you in 3 previous emails that I do not have a video of the issue.  I have removed the pedals from cockpit and they are very difficult to reinstall.  I have provided photos and a detailed description of the issue.  It has been 13 days since I emailed you and so far all I have received is repeated requests for photos and videos.  This entire process has been very frustrating and disappointing and I no longer am interested in your product.  Please provide me the information needed to return this defective product for a full refund or send me a new brake pedal.  Thank you.  \n   \n Chris Schillings \n \n  \n On Sun, May 25, 2025 at 7:05 PM General and sales enquiries <service@simsonn.com> wrote: \n \n   \n \n \n \n Hello! Thank you for providing the pictures in time! We have synchronized the pictures to the engineers as soon as possible. If it is convenient for you, can you add a video to show the specific problems you encountered? Dynamic operation demonstrations can help engineers capture details faster and speed up problem troubleshooting. If you have any questions or need assistance, please feel free to contact us. Thank you for your understanding and cooperation! \n \n   service@simsonn.com   \n \n   \n  \n \nFrom: Chris Schillings\n \n \nDate: 2025-05-24 07:36 \n \nTo: General and sales enquiries\n \n \nSubject: Re: Re: Brake Pedal Issue \n  \n  \n  Here are more pics.   \n \n \n  \n On Thu, May 22, 2025 at 10:19 PM Chris Schillings <cwschillings@gmail.com> wrote: \n \n \n Hello,   \n Here is the picture that I sent on 17th that shows the position of the pedal on the bracket.  Is there something else you need to see? \n \n \n  \n On Thu, May 22, 2025 at 8:33 PM General and sales enquiries <service@simsonn.com> wrote: \n \n   \n \n \n \n Hello! I would like to confirm with you where the pedal was originally installed on the bracket? The current situation may be that the brake sensor is blocked by the bracket, resulting in a reversal phenomenon. Please provide relevant information and we will further assist you in troubleshooting and solving the problem according to the situation. \n \n   service@simsonn.com   \n \n   \n  \n \nFrom: Chris Schillings\n \n \nDate: 2025-05-23 03:49 \n \nTo: General and sales enquiries\n \n \nSubject: Re: Re: Brake Pedal Issue \n  \n  \n Hello,   \n I feel like you are not reading my emails.  The last two emails you have sent me ask for items that I have either already provided or have discussed with you previously.  If you would please refer to the email I sent on 5/17, that may help you.  I do not have a \"video\" of the problem and have since removed the pedals from my system.  Is a video necessary or does my description provide enough information?  Maybe it would be possible to connect me directly to an engineer rather than 3rd party communication to clear up the miscommunications?  If a video is absolutely necessary, this will require me to spend an hour or two removing my current pedals from the system and re-installing your pedals.  Thank you.  \n   \n Chris Schillings \n (707) 239-8568 \n \n  \n On Wed, May 21, 2025 at 7:05 PM General and sales enquiries <service@simsonn.com> wrote: \n \n   \n \n \n \n Hi，regarding the software problem, our engineers need your help to provide the software failure video so that we can solve the problem for you as soon as possible. Thank you for your understanding and support! \n \n   service@simsonn.com   \n \n   \n  \n \nFrom: Chris Schillings\n \n \nDate: 2025-05-22 04:46 \n \nTo: General and sales enquiries\n \n \nSubject: Re: Re: Brake Pedal Issue \n  \n  \n Hello,   \n Haven't heard from you.  Did you receive my response? \n \n  \n On Mon, May 19, 2025 at 10:59 AM Chris Schillings <cwschillings@gmail.com> wrote: \n \n \n Hello,   \n The order number is included in the original email.  I purchased the Simsonn Pro Plus Upgrade order order #SSN1424.  Hope that helps.   \n   \n Chris Schillings \n (707) 239-8568 \n \n  \n On Sun, May 18, 2025 at 11:03 PM General and sales enquiries <service@simsonn.com> wrote: \n \n   \n \n \n \n Hello, we are very sorry for the inconvenience! Which upgrade kit did you buy? Please provide the order number. In addition, regarding the software problem, our engineers need your help to provide the software failure video so that we can solve the problem for you as soon as possible. Thank you for your understanding and support! \n \n   service@simsonn.com   \n \n   \n  \n \nFrom: Chris Schillings\n \n \nDate: 2025-05-18 08:50 \n \nTo: General and sales enquiries\n \n \nSubject: Re: Brake Pedal Issue \n  \n  \n Thanks for the response. I apologize, but I do not have a video because I’ve already removed the pedal.  I Took a couple pictures of the pedal in case that might help. \n   \n This is the best description I can give the problem. I installed the throttle and pedal on my machine with the default red elastomers attached.  I was able to calibrate both the pedal and break with the Simsonn software but as soon as I touched the break, it would invert itself to 100%. Then, if I pushed on the break very hard, it would start to go down from 100 to maybe as far as 75. Using the invert brake setting in Assetto Corsa did not resolve this issue. \n   \n I found that if I cranked down the preload screw the 100% would start to diminish. So I swapped out the red elastomers with the blue and I put in a large spacer. This seemed to help as I was able to once again calibrate the pedal in the Simsonn software. It even appeared that the brake was working normally in the Simsonn software. However, with every game, the brake would not activate until it was 20 to 30% pushed and the in-game  braking would jump from 0 to 25%. No matter what I did, I couldn’t make the break work for that first 25%. \n \n   \n Also, when I would go back to the software, the pedal calibration seem to undo itself. It would be back to 100%. But then I could push it and it would fall to 75 and if I continue to push it a few more times it would drop back to zero. \n   \n I have made sure that the connector box is nowhere near any electrical outlets or other interference. \n   \n I’ve had to switch back to my thrustmaster pedals In the meantime.  This is incredibly frustrating and has cost me hours of troubleshooting and headaches. I apologize, but my patience is very thin with this pedal set.   \n   \n Unless you have some easy fix that will be worth me spending the effort and two hours of putting the pedals back on the machine, I would appreciate if you would send me a new brake pedal. I haven’t given up on the product yet. I’m just hoping that maybe there is a defect in this one and the one you sent me will work great. I will be happy to return this brake in exchange for a new one. Thank you.   \n   \n Chris Schillings  \n   \n  \n On Tue, May 13, 2025 at 6:55 PM General and sales enquiries <service@simsonn.com> wrote: \n \n \n \n \nHi,  We are very sorry for the inconvenience caused. Could you please provide some pictures or a video for us? Then we can check what the problem is \n   \n \n   service@simsonn.com   \n \n \n \n   \n  \n \nFrom: Chris Schillings\n \n \nDate: 2025-05-14 01:04 \n \nTo: service\n \n \nSubject: Brake Pedal Issue \n  \n  \n Good Morning,   \n I recently ordered the Simsonn Pro Plus Pedal Upgrade set (order #SSN1424).  For unknown reasons I cannot get the brake pedal to calibrate properly.  The calibration works initially works normally, however when I push on the brake after calibration it immediately flips to 100% activated.  Nothing I do seems to change this issue.  The throttle works flawlessly.  I have troubleshooted the issue by; \n   \n 1. Rebooting \n 2. Re-installing the app \n 3. Adjusting the polymers and spring tension \n 4. Swapping out elastomers \n 5. Using other software (FreeJoy and DiView) \n 6. Unplugging everything that may cause interference \n 7. Moving the system away from power sources \n   \n I have been able to get the pedal to calibrate by greatly ratcheting down the tension on the elastomers.  However this greatly reduces the travel of the brake.  And when I did this, the brake would travel 20% before even recording pressure.   \n   \n I believe it may be time for a return unless you have any other suggestions.   \n   \n Thank you, \n   \n Chris Schillings \n (707) 239-8568 \n cwschillings@gmail.com",
      "user_id": 158000445778,
      "created_at": "2025-06-05T06:14:11Z",
      "updated_at": "2025-06-05T06:14:11Z",
      "incoming": false,
      "private": true,
      "source": 2
    }
  ]
}