{
  "id": 1220,
  "subject": "Re: Order #SSN1756, how did it go?",
  "description_text": "It still has not arrived. Christopher Coy 919.306.8895 On Jul 3, 2025, at 1:20 PM, SIMSONN <no-reply@loox.io> wrote: ﻿ Hello Christopher, We would be grateful if you shared how things look and feel. Your review helps us and the community that supports us, and it only takes a few seconds. ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ Hello Christopher, We would be grateful if you shared how things look and feel. Your review helps us and the community that supports us, and it only takes a few seconds. Simsonn VAM Pro Linear Motor - the Pedals Haptic Reactor for Vibration Feedback VAM Pro Set (2 pac/includes power supply) Dislike it Love it! Simsonn VAM Pro Linear Motor - the Pedals Haptic Reactor for Vibration Feedback Pro X Ultra Pedal Control Box Dislike it Love it! Unsubscribe \r\n",
  "status": 3,
  "priority": 4,
  "created_at": "2025-07-04T15:26:00Z",
  "updated_at": "2025-07-17T08:48:05Z",
  "requester_id": 158001893699,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158004445726,
      "body_text": "Hi Christopher Coy,    You can use this link to track it, it has now gone through customs and is expected to arrive for you around the 6th.  https://www.track718.us/zh-CN/detail?nums=JSEXZ1947067656YQ",
      "user_id": 158001343601,
      "created_at": "2025-07-04T15:44:32Z",
      "updated_at": "2025-07-04T15:44:32Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004496434,
      "body_text": "Hello,\r\ni received my order but you shipped a Plus X Pedal Control Box not the Pro\r\nX Ultra Control box which I ordered and paid for.\r\nI would like the Pro X Ultra Control Box i ordered Please.\r\n\r\nPlease Advise on what i need to do to get the item i ordered.\r\n\r\nI thank you in anticipation.\r\n\r\nChristopher Coy\r\n\r\n\r\n\r\n\r\nOn Fri, Jul 4, 2025 at 11:44 AM service@simsonn.com ",
      "user_id": 158001893699,
      "created_at": "2025-07-09T20:45:58Z",
      "updated_at": "2025-07-09T20:45:58Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158004501758,
      "body_text": "Hi Christopher Coy,    May I ask if you are using a Pro X pedal or a Pro Plus pedal, if it is a Pro Plus pedal you can use this Plus X control box and the effect will be the same. Because the Pro X Ultra's control box we are originally not sold separately, so there is no package solution with the haptics, so we are defaulting to send the Plus X control box unless we note the previous order number.",
      "user_id": 158001343601,
      "created_at": "2025-07-10T09:43:52Z",
      "updated_at": "2025-07-10T09:43:52Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004593699,
      "body_text": "I bought the haptic reactors to use on my Fanatec pedals Clubsport V3\r\npedals. I am trying to use your haptics on them for Traction Control on the\r\nthrottle and ABS on the brake for iRacing.\r\nAt first the haptics were connected in the Simsonn software. now it just\r\nsays disconnected and i cannot get the simson software version 2.08 to\r\nconnect to the haptics.\r\ni plan to use the SimHub Software when your haptics are added to Simhub but\r\nwill use them with your Simsonn Manager until then.\r\n\r\nPlease advise as i have the Pedal Control box i purchased connected to both\r\nthe pedals and pc. i had the calibration working for feedback settings\r\nyesterday and now they will not connect.\r\n\r\nthank you.\r\n\r\n[image: image.png]\r\n\r\n\r\n\r\nOn Thu, Jul 10, 2025 at 5:44 AM service@simsonn.com ",
      "user_id": 158001893699,
      "created_at": "2025-07-11T18:13:47Z",
      "updated_at": "2025-07-11T18:13:47Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158004943063,
      "body_text": "Hi Christopher Coy,  Please send us a photo of your control box so I can identify which version you are using. Also, SIMHUB version 9.9.3 officially supports our vibration feedback system. ",
      "user_id": 158000445778,
      "created_at": "2025-07-16T06:19:50Z",
      "updated_at": "2025-07-16T06:19:50Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004971569,
      "body_text": "Thank you, Picture attached let me know if I need to take it out and send you a picture of the back, I purchased the pro x Ultra, because I wanted all the feedback haptic options offered in the VAM Pro Linear motors. But the plus X control box was shipped. Christopher 919.306.8895 ",
      "user_id": 158001893699,
      "created_at": "2025-07-16T14:24:26Z",
      "updated_at": "2025-07-16T14:24:26Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005133644,
      "body_text": "Hi，Christopher Coy，   ​ If the version number is not displayed, please follow the steps below to manually update the PlusX firmware:    Press and hold the upgrade button on the PlusX control box;    Plug in the USB while holding the button—this will enter firmware recovery mode. Then release the button;    Open the SIMSONN Manager software and go to Settings → Update → Manual Firmware Update;    Select the plusx-nosig.sfu file I sent you to perform the upgrade.    Note: You can update SIMSONN Manager to version 2.0.9, but if the software prompts you to upgrade to firmware version 2.0.2, please do not proceed. That version is identical to the plusx.sfu file I already provided, so there's no need to upgrade again.",
      "user_id": 158000445778,
      "created_at": "2025-07-17T08:48:05Z",
      "updated_at": "2025-07-17T08:48:05Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}