{
  "id": 1564,
  "subject": "Order #SSN1843 - Missing screws, used product?",
  "description_text": "Hi there I recently purchased the haptics VAM Pro x3 from you and just had\r\nthe time to open and try to install it today. I found out that the booklet\r\nis damaged and has been colored or used. On Top of that, one of the haptic\r\nVAM pros has scratches and damage. I was also provided with 8 out of the 14\r\nscrews only, I can't even install them on my simsonn plus x due to the lack\r\nof screws.\r\n\r\nIs this a returned or 2nd hand product that you sent me? Very sad and\r\ndisappointed.\r\n\r\nPlease see the picture.\r\n\r\nKindest regards\r\nJackie\r\n\r\n[image: 3a23adcc-6adb-4699-bfc1-de79bb60b5ba.jpg]\r\n[image: d6bc9d95-4e1e-4b2b-8678-32b12b64c102.jpg]\r\n[image: fcce2d81-bb5a-4880-9253-6a8a6f960418.jpg]\r\n[image: 1c9980ce-4f2c-41ab-b09d-5fde739aa750.jpg][image:\r\ne40e39a8-75eb-4758-86dd-0496cdcf969e.jpg][image:\r\na6ac4408-d9d3-4d6e-a3c3-e53d9bf11b34.jpg][image:\r\n5f70ee82-8589-473d-b944-a6c920652b9c.jpg][image:\r\nf14c47f5-5b7c-4305-91ad-0095ecdafffd.jpg]\r\n\r\n<https://www.avast.com/sig-email?utm_medium=email&utm_source=link&utm_campaign=sig-email&utm_content=webmail>\r\nVirus-free.www.avast.com\r\n<https://www.avast.com/sig-email?utm_medium=email&utm_source=link&utm_campaign=sig-email&utm_content=webmail>\r\n<#DAB4FAD8-2DD7-40BB-A1B8-4E2AA1F9FDF2>\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-07-15T13:53:43Z",
  "updated_at": "2025-07-26T04:26:35Z",
  "requester_id": 158002140254,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158004918340,
      "body_text": "Hi Jackie A,      We're truly sorry for the inconvenience and poor experience.  First, we want to assure you that this is absolutely not a returned item being resold. Due to the high cost of international shipping, returned products have no practical value for recovery.  The motor you received may have minor imperfections on its casing. This is often caused by the anodizing process, where it is very difficult to avoid all surface scratches. Some slight marks may also occur during the mold assembly stage. Regarding the missing manual, we sincerely apologize—this was a packaging oversight and is not a common issue.  Could you please confirm whether you purchased the PlusX or the ProX Ultra pedal set? In the meantime, you can temporarily use replacement screws for installation, and we will arrange to send the correct ones if needed.  For game telemetry, you can use SIMHUB 9.9.3, and our SIMSONN Manager 2.0.9 supports over 10 major racing titles. If you encounter any issues, please feel free to contact us — we're here to help and will respond promptly.",
      "user_id": 158000445778,
      "created_at": "2025-07-16T02:45:37Z",
      "updated_at": "2025-07-16T02:45:37Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004944322,
      "body_text": "Hi there\r\n\r\nThank you so much for getting back to me in such a short time.\r\n\r\nI have been told by my friends that Simsonn is a great product so I\r\npurchased both Simsonn Plus X and Simsonn Gear Shifter from your guys main\r\nstore on Ali Express. I was impressed by the many positive reviews hence I\r\ndecided to support you guys even more by getting the VAM Pro X (over The\r\nSimmagic Haptics) from your website (Since it was out of stock on Ali). I\r\nwas also going to upload my positive review of those on youtube.  In the\r\nnear future I planned on slowly investing into the Simsonn Ecosystem such\r\nas The Sequential Shifter and Handbarke etc.\r\n\r\nHowever, as described from the previous email, a few things were missing. 2\r\nof the Vam Pros are attached by 2 / 4 Hex Socket Bolts (M4-10mm) only, as 4\r\nmore are missing and a total of 6 missing from the 14 screws that is\r\nsupposedly included in the package. I wasn't too fussy about it after you\r\nconfirmed it was not a 2nd hand product that you've sent.\r\n\r\nI have also tried looking for the missing Bolts but I just couldn't find\r\nthe specific M4-10mm Hex socket bolts from any shops that's near where I\r\nlive in Auckland, as this particular size is not commonly used in our\r\ncountry. It would be good if you can send the other 6 missing bolts to me\r\nat your convenience.\r\n\r\nIn the meantime, I have tested the Vam Pros in both Simhub Licensed and\r\nSImsonn Manager, all working as intended.\r\n\r\nThank you\r\n\r\nRegards\r\nJackie\r\n\r\n\r\n[image: image.png]\r\n[image: image.png]\r\n\r\n\r\n\r\nOn Wed, Jul 16, 2025 at 2:45 PM service@simsonn.com ",
      "user_id": 158002140254,
      "created_at": "2025-07-16T09:44:41Z",
      "updated_at": "2025-07-16T09:44:41Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005114989,
      "body_text": "速卖通",
      "user_id": 158001343601,
      "created_at": "2025-07-17T06:34:32Z",
      "updated_at": "2025-07-17T06:34:32Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158005133532,
      "body_text": "Hi Jackie A,  Thank you very much for your understanding and continued support of our products. Our sales team has sent you a replacement shipment with 14 screws. The package has already been dispatched, and the tracking number is as follows. Please keep an eye out for delivery.      Here is your tracking number YT2519800705338096, you track it via https://www.yuntrack.com/parcelTracking?id=​YT2519800705338096",
      "user_id": 158000445778,
      "created_at": "2025-07-17T08:34:04Z",
      "updated_at": "2025-07-17T08:34:04Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005545414,
      "body_text": "Hi guys\r\n\r\nReally appreciate the prompt response, just received the screws now. Great\r\ncustomer support.\r\n\r\nThank you!\r\n\r\n[image: 88dedb72-ee91-45bc-91cf-7b426184874b.jpg]\r\n\r\nOn Thu, Jul 17, 2025 at 8:34 PM service@simsonn.com ",
      "user_id": 158002140254,
      "created_at": "2025-07-25T22:38:20Z",
      "updated_at": "2025-07-25T22:38:20Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005551135,
      "body_text": "Hi Jackie A,  We’re glad to have resolved your issue! Please feel free to contact us anytime if you need further assistance. For the best telemetry experience, please use the latest SIMSONN Manager 2.1.0 and SIMHUB 9.9.3 versions. If you encounter any interference issues, connect the green wire from the control box to any metal screw on the pedal, ensuring the connection point is free of paint for proper conductivity. ",
      "user_id": 158000445778,
      "created_at": "2025-07-26T04:26:35Z",
      "updated_at": "2025-07-26T04:26:35Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}