{
  "id": 160,
  "subject": "Simline.eu sim-shop.pl sim-center.pl",
  "description_text": "Hi guys. I see that you are doing a really good job with the current\r\nproduct line. We would like to be your dealer for Poland and Europe. Can\r\nyou send us the terms of trade, where you ship from and the full catalog?\r\n\r\nAbout us:\r\nWe run the 2 largest simracing stores in Poland, we have a fully stocked\r\nlocal store in Poznan, Poland and the largest simracing center in Poland\r\nwhere customers can test equipment. We are responsible for the success of\r\nmany brands in Poland. We are currently official partners of MOZA, Simagic,\r\nSimucube, Heusinkveld, Simtrecs and many others.\r\n\r\nWhat do you think? Do you want to work with us?\r\n\r\nBest regard / Pozdrawiam\r\n[image: Photo]\r\n\r\nŁukasz Porożyński\r\n\r\nCEO\r\n\r\nSimLine\r\n\r\nPoland, Poznan\r\n\r\nGarbary 100/164\r\n\r\nlukasz@simline.eu\r\n\r\n+48517768318\r\n\r\nwww.simline.eu\r\n\r\n<https://www.tiktok.com/@simline.eu>   <https://www.facebook.com/simline.gt>\r\n  <https://www.youtube.com/@simlineeu>\r\n<https://www.instagram.com/simline.gt/>\r\n\r\n",
  "status": 3,
  "priority": 3,
  "created_at": "2025-06-04T13:11:15Z",
  "updated_at": "2025-06-14T04:11:32Z",
  "requester_id": 158001214558,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158002454849,
      "body_text": "Hi Lukasz Porozynski,  We’ve reviewed your website and found it to be very professional. May I ask how you currently cooperate with those brands? Is it through bulk purchasing? At the moment, we have only limited stock in Germany for some of our products. We believe there is great potential for cooperation with you and look forward to further discussion. ",
      "user_id": 158000445778,
      "created_at": "2025-06-05T08:19:37Z",
      "updated_at": "2025-06-05T08:19:37Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158002460987,
      "body_text": "Hello, yes of course, we always do bulk orders with every manufacturer we\r\noffer. We do not have dropshipping offers. MOZA, Simagic, SimNet we import\r\ndirectly from China and I think we will do the same with you. I would like\r\nto get a DEMO Pack from you, i.e. every product you offer for testing with\r\nus. Of course not for free, please make the best price you can with fast\r\nshipping to us. We will test your equipment and make a normal order but I\r\nwould also like to know the trade conditions :)\r\nAbout our sales. SimNet we sell about 200 sets per month, Simagic pedals\r\n100-200 sets, and MOZA about 100 (MOZA we sell mainly in bundles)\r\n\r\nYour products look very good so they will attract attention in our local\r\nstore. Every year we exhibit at the largest gaming fair in Poland, PGA,\r\nputting on a great show. Our stand usually has about 10 simulators, racing\r\nand off-road cars and the entire assortment. We usually have from 200 to\r\n400m2 at our disposal. Of course I can show you a photographic report from\r\nsuch fairs. Visitors wait in line for 2 hours to try out the equipment, so\r\nit is also a great opportunity for you to promote. In our simracing center\r\nwe also have simulators based on one manufacturer so that customers can\r\ntest. It is possible that we will want to do the same with your equipment.\r\n\r\nczw., 5 cze 2025 o 10:19 service@simsonn.com ",
      "user_id": 158001214558,
      "created_at": "2025-06-05T08:39:59Z",
      "updated_at": "2025-06-05T08:39:59Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}