{
  "id": 1747,
  "subject": "",
  "description_text": "Hi everyone, have there been any recent updates or solutions regarding the\r\nissues with my GearShifter device?\r\nIn case there are no new updates and the issue remains unresolved, I would\r\nappreciate it if you could inform me of your intended next steps.\r\n\r\n",
  "status": 3,
  "priority": 4,
  "created_at": "2025-07-21T17:37:03Z",
  "updated_at": "2025-10-11T03:58:55Z",
  "requester_id": 158001755269,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158003833616,
      "body_text": "Hi Dim,  We just downloaded Assetto Corsa EVO today, and I’ll have our engineer test the game tomorrow. Please send me a photo of the shifter and your order number. Once we finish the testing, we’ll figure out the best way to resolve the issue. ",
      "user_id": 158000445778,
      "created_at": "2025-06-25T02:45:22Z",
      "updated_at": "2025-06-25T02:45:22Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158003838222,
      "body_text": " Order ID: 8201309133660901 I bought it through an official seller on\r\nAliExpress\r\n\r\nThe same thing happens in the latest version of WRC 24. While the car is\r\nstanding, I can change gears as soon as I start moving, the gears don't\r\nchange, and nothing happens\r\n\r\nOn Tue, Jun 24, 2025 at 10:45 PM service@simsonn.com ",
      "user_id": 158001755269,
      "created_at": "2025-06-25T15:24:15Z",
      "updated_at": "2025-06-25T15:24:15Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158003845720,
      "body_text": "Hi Dim,  In WRC 24, is the default gear mode manual or automatic when the car is stationary? If it’s in automatic mode, it’s possible that the gear won’t shift due to insufficient speed. We recommend using the VKB tool to check the current gear input status for further clarification. ",
      "user_id": 158000445778,
      "created_at": "2025-06-26T09:47:38Z",
      "updated_at": "2025-06-26T09:47:38Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004223613,
      "body_text": "Even when playing Forza Horizon 5, the Simsonn shifter is not recognized as\r\na separate device. I can only assign gear shifting under the existing Moza\r\nR5 preset and save it. However, after I turn off the Moza R5 base and\r\nrelaunch the game, I have to reassign transmission gear shifting buttons\r\nbecause the configuration doesn’t stay saved for the shifter.\r\n\r\nCould you please advise how to make the shifter retain its configuration? I\r\nwould like to add that this is a continuation of a previous inquiry. While\r\nI didn’t specifically mention this issue before, I’ve noticed that the\r\nshifter is also not recognized properly in other games. This seems to be\r\npart of a broader compatibility problem.\r\n\r\nOn Tue, Jun 24, 2025 at 10:45 PM service@simsonn.com ",
      "user_id": 158001755269,
      "created_at": "2025-06-29T19:56:20Z",
      "updated_at": "2025-06-29T19:56:20Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158004378196,
      "body_text": "Guys, are there any results, or should we return your product?\r\n\r\n",
      "user_id": 158001755269,
      "created_at": "2025-07-02T17:29:40Z",
      "updated_at": "2025-07-02T17:29:40Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158004445250,
      "body_text": "你好，Dim，  请稍等片刻——我们的工程师目前正在评估此问题。 评估完成后，我们会尽快回复您。 ",
      "user_id": 158000445778,
      "created_at": "2025-07-04T13:57:57Z",
      "updated_at": "2025-07-04T13:57:57Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005283822,
      "body_text": "Hi everyone, have there been any recent updates or solutions regarding the\r\nissues with my GearShifter device?\r\nIn case there are no new updates and the issue remains unresolved, I would\r\nappreciate it if you could inform me of your intended next steps.\r\n\r\nOn Tue, Jun 24, 2025 at 10:45 PM service@simsonn.com ",
      "user_id": 158001755269,
      "created_at": "2025-07-21T17:47:12Z",
      "updated_at": "2025-07-21T17:47:12Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005290580,
      "body_text": "Hi Dim,  Could you please provide a video of the issue? Once we review it, we’ll get back to you with a solution as soon as possible. ",
      "user_id": 158000445778,
      "created_at": "2025-07-22T01:53:26Z",
      "updated_at": "2025-07-22T01:53:26Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005290804,
      "body_text": "\"I kindly suggest that you purchase Forza Horizon 5, Assetto Corsa EVO, and\r\nWRC 2024 yourselves, conduct the necessary testing, and create your\r\ndemonstration videos. I am not employed by your company, and it is not my\r\nresponsibility to troubleshoot your product for you.\" Are you telling me\r\nthat after four weeks, during which you repeatedly assured me that your\r\nengineers had purchased the game and were actively working on testing and\r\nresolving the issue, no actual progress has been made? If that is the case,\r\nI will have no choice but to return the device, as I no longer see any\r\nvalue in keeping it. I also feel it necessary to leave a detailed and\r\nhonest review expressing my disappointment with the product, the lack of\r\nmeaningful support, and the misleading promises made throughout this\r\nprocess.\"\r\n\r\nOn Mon, Jul 21, 2025 at 9:53 PM service@simsonn.com ",
      "user_id": 158001755269,
      "created_at": "2025-07-22T02:30:23Z",
      "updated_at": "2025-07-22T02:30:23Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005290836,
      "body_text": "ID 为 760 的工单已合并到此工单。",
      "user_id": 158000445778,
      "created_at": "2025-07-22T02:36:52Z",
      "updated_at": "2025-07-22T02:36:52Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158005290837,
      "body_text": "合并来自工单760  \n      主题: Simson H-Shifter USB – Issue with Assetto Corsa EVO Compatibility  \n      描述:  \n Dear Simson Support, \n I am writing regarding a serious issue with my Simson 6 PLUS R USB H-pattern shifter, which I recently purchased. \n The device works fine in general and is recognized correctly in Windows and most games, including Forza Horizon 5. However, I am experiencing a critical problem in Assetto Corsa EVO (Steam version). Here's a detailed breakdown: \n \n  The shifter is correctly detected in the game settings menu.  \n  I can assign all gears (1–6, R), and they respond correctly during input mapping.  \n  However, once I enter the track and begin driving, the shifter works for 10–30 seconds and then stops responding entirely.  \n  The issue repeats with or without a steering wheel (MOZA R5), and all assists are disabled (clutch assist, auto gearbox, throttle blip, etc.).  \n  In Windows, the shifter also stops responding in the Game Controllers control panel (joy.cpl) until I manually open \"Properties\" and click on \"Test\" — after that, it starts working again for a short time.  \n  The same issue happens whether I use the device directly or through vJoy and Joystick Gremlin.  \n  All USB power-saving options are disabled in Windows.  \n  I've tested multiple USB ports and cables, including the original one. No difference.  \n  The problem occurs in Assetto Corsa EVO. There are no issues in Forza Horizon 5 — the Simsonn shifter works perfectly and all gears shift smoothly without delay or disconnection.\n  \n \n This appears to be a problem with the internal firmware of the shifter, or possibly an HID controller compatibility issue with Assetto Corsa’s polling method. \n Could you please let me know: \n \n  Is a firmware update is available for the Simson 6 PLUS R USB?  \n  If Are there known issues with this model and Assetto Corsa EVO?  \n  If there is any official utility to flash or reset the HID firmware?  \n  Or if are there other suggestions to make the HID signal stable during gameplay?  \n \n Here is what Windows reports for the device: \n \nDevice name: [insert exact name from joy.cpl] Hardware ID: [insert what appears in Device Manager → Properties → Details → Hardware IDs] \n Thank you for your support — I really want to continue using this great device in Assetto Corsa EVO, but right now it’s unusable. \n Best regards, DMITRI RABINOVICH Location CANADA / Order ID: 8201309133660901",
      "user_id": 158000445778,
      "created_at": "2025-07-22T02:36:53Z",
      "updated_at": "2025-07-22T02:36:53Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158005486457,
      "body_text": "you don't want to answer me anything, you asked me to wait and not return\r\nthe device, a month has already passed and there have been no messages from\r\nyou\r\n\r\n",
      "user_id": 158001755269,
      "created_at": "2025-07-24T00:00:34Z",
      "updated_at": "2025-07-24T00:00:34Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005487413,
      "body_text": "Hi Dim,  Due to our company relocation on July 1st, our testing equipment has not yet been fully commissioned, so we haven’t been able to verify the issue you reported in time. We sincerely apologize for this. However, this issue has already been included in our testing plan. In theory, our shifter outputs consistent data, and other game controllers also capture this signal, so I believe this is more likely an issue with the game itself. Of course, we will work on making it function properly, especially if similar shifters have already achieved this. Please be patient for a bit longer. In the meantime, please take a photo of your current device so we can confirm whether it supports online updates. ",
      "user_id": 158000445778,
      "created_at": "2025-07-24T02:31:33Z",
      "updated_at": "2025-07-24T02:31:33Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005487498,
      "body_text": "On Wed, Jul 23, 2025 at 10:31 PM service@simsonn.com ",
      "user_id": 158001755269,
      "created_at": "2025-07-24T02:45:56Z",
      "updated_at": "2025-07-24T02:45:56Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005487596,
      "body_text": "Forza Horizon 5, Assetto Corsa EVO, and WRC 2024 -  there are currently\r\nproblems with these games.\r\nForza Horizon 5- and in this game, I can connect it to the Moza R5 and not\r\nas a separate device, but when I turn off the Moza, I need to reassign the\r\ngear shift speed again\r\n\r\nOn Wed, Jul 23, 2025 at 10:31 PM service@simsonn.com ",
      "user_id": 158001755269,
      "created_at": "2025-07-24T02:53:55Z",
      "updated_at": "2025-07-24T02:53:55Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005487753,
      "body_text": "Hi Dim,  Okay, I’ve received your issue description. We will run tests and get back to you afterward. ",
      "user_id": 158000445778,
      "created_at": "2025-07-24T03:08:42Z",
      "updated_at": "2025-07-24T03:08:42Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005487965,
      "body_text": "   -  Assetto Corsa EVO, and WRC 2024  ---     The shifter is correctly\r\n   detected in the game settings menu.\r\n   - I can assign all gears (1–6, R), and they respond correctly during\r\n   input mapping.\r\n   - However, once I enter the track and begin driving, the shifter works\r\n   for 10–30 seconds and then stops responding entirely.\r\n   - The issue repeats with or without a steering wheel (MOZA R5), and all\r\n   assists are disabled (clutch assist, auto gearbox, throttle blip, etc.).\r\n   - In Windows, the shifter also stops responding in the Game Controllers\r\n   control panel (joy.cpl) until I manually open \"Properties\" and click on\r\n   \"Test\" — after that, it starts working again for a short time.\r\n   - The same issue happens whether I use the device directly or through\r\n   vJoy and Joystick Gremlin.\r\n   - All USB power-saving options are disabled in Windows.\r\n   - I've tested multiple USB ports and cables, including the original one.\r\n   No difference.\r\n   - The problem occurs in Assetto Corsa EVO and WRC 2024 !!!\r\n\r\n\r\n",
      "user_id": 158001755269,
      "created_at": "2025-07-24T03:37:48Z",
      "updated_at": "2025-07-24T03:37:48Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006294146,
      "body_text": "Guys, what about the solution to the problem? Give me an answer as soon as\r\npossible. Thanks\r\n\r\n",
      "user_id": 158001755269,
      "created_at": "2025-08-05T17:37:04Z",
      "updated_at": "2025-08-05T17:37:04Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006303194,
      "body_text": "Hi Dim,  Our engineers will continue testing the issue you reported and release an update to fix it. ",
      "user_id": 158000445778,
      "created_at": "2025-08-06T01:19:16Z",
      "updated_at": "2025-08-06T01:19:16Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158007110643,
      "body_text": "Well, guys, have your engineers made any tests and changes? Is there an\r\nupdate so that your device works?\r\n\r\n",
      "user_id": 158001755269,
      "created_at": "2025-08-19T02:57:44Z",
      "updated_at": "2025-08-19T02:57:44Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158007225738,
      "body_text": "Hi Dim,  We are still working on the fix. Could you please let us know on which platform you placed the order? If you are in a hurry, we can arrange a refund for you first. ",
      "user_id": 158000445778,
      "created_at": "2025-08-20T15:33:31Z",
      "updated_at": "2025-08-20T15:33:31Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158007440763,
      "body_text": "I'm not interested in a return. I'm interested in making some corrections\r\nso that it works in the games I mentioned. You've been promising me for a\r\nvery long time.\r\n\r\nOn Wed, Aug 20, 2025 at 11:33 AM service@simsonn.com ",
      "user_id": 158001755269,
      "created_at": "2025-08-25T02:57:57Z",
      "updated_at": "2025-08-25T02:57:57Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158007548484,
      "body_text": "Hi Dim,  Alright, our engineers have informed us that it will take some more time to achieve full compatibility with these games. ",
      "user_id": 158000445778,
      "created_at": "2025-08-26T03:57:08Z",
      "updated_at": "2025-08-26T03:57:08Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}