{
  "id": 1767,
  "subject": "Добрый день. 1 - я поставил контроллер и моторчик на педаль, запустил симменеджер. Симменеджер попросил обновление, что я и сделал до последней версии. После обновления, я перевоткнул юсб с контроллером, педали и мотор заработали в симменеджере, но не в и",
  "description_text": "",
  "status": 3,
  "priority": 1,
  "created_at": "2025-07-22T05:48:02Z",
  "updated_at": "2025-07-26T10:03:36Z",
  "requester_id": 158002271487,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158005338682,
      "body_text": "Продавец сказал, что скорее всего у меня неправильная прошивка педалей",
      "user_id": 158002271487,
      "created_at": "2025-07-22T14:27:29Z",
      "updated_at": "2025-07-22T14:27:29Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158005355050,
      "body_text": "Hi anton shishonkov,    Вы приобрели педали PlusX и мотор VAM, верно? Пожалуйста, подтвердите, соответствует ли текущий интерфейс программы предоставленному вами скриншоту. Если у вас установлена прошивка версии 2.0.2 и программа версии 2.0.9 — это самая последняя версия.  На данный момент педали распознаются корректно, но питание VAM отображается как отключённое (красным цветом), правильно? В большинстве случаев достаточно просто заново подключить USB и питание, чтобы всё заработало.",
      "user_id": 158000445778,
      "created_at": "2025-07-23T02:27:16Z",
      "updated_at": "2025-07-23T02:27:16Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005384882,
      "body_text": "У меня перестали работать педали и моторчик. Игра их не видит, в ПО педали\r\nотображаются, в игре нет. Моторчик не реагирует ни на что. Высылаю 2\r\nзаписанных видео.\r\n\r\nhttps://drive.google.com/file/d/1_zCc25QI-Fb83i3hu7wBRsIfyZhuZrCp/view?usp=drivesdk\r\n\r\nhttps://drive.google.com/file/d/1_zTqEnBMGQdER-tnURXpssk4DjpM3EwF/view?usp=drivesdk\r\n\r\nЯ не знаю что делать, пробовал перепрошить, все равно педали отваливаются и\r\nмоторчик не реагирует совсем\r\n\r\nср, 23 июл. 2025 г., 05:27 support@simsonn.com ",
      "user_id": 158002271487,
      "created_at": "2025-07-23T07:28:35Z",
      "updated_at": "2025-07-23T07:28:35Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005385034,
      "body_text": "А ещё во время работы вашего ПО у меня трещит юсб микрофон\r\n\r\nср, 23 июл. 2025 г., 10:28 anton shishonkov <wuwa90@gmail.com>:\r\n\r\n> У меня перестали работать педали и моторчик. Игра их не видит, в ПО педали\r\n> отображаются, в игре нет. Моторчик не реагирует ни на что. Высылаю 2\r\n> записанных видео.\r\n>\r\n>\r\n> https://drive.google.com/file/d/1_zCc25QI-Fb83i3hu7wBRsIfyZhuZrCp/view?usp=drivesdk\r\n>\r\n>\r\n> https://drive.google.com/file/d/1_zTqEnBMGQdER-tnURXpssk4DjpM3EwF/view?usp=drivesdk\r\n>\r\n> Я не знаю что делать, пробовал перепрошить, все равно педали отваливаются\r\n> и моторчик не реагирует совсем\r\n>\r\n> ср, 23 июл. 2025 г., 05:27 support@simsonn.com ",
      "user_id": 158002271487,
      "created_at": "2025-07-23T07:29:21Z",
      "updated_at": "2025-07-23T07:29:21Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005392429,
      "body_text": "Забыл написать, я приобрел набор моторчиков VAM и этот контроллер ( https://www.ozon.ru/product/simson-blok-upravleniya-pedalyu-plus-x-obnovlenie-igrovoy-pedali-dlya-podklyucheniya-2205051080/ ). Педали у меня старой ревизии, вот такие - https://www.ozon.ru/product/simson-pius-x-p3-h3-datchik-nagruzki-na-pedal-podhodyashchiy-dlya-kompyuternyh-gonochnyh-igr-gaz-1750301217/?_bctx=CAQQ1NVe&at=WPtN1qB7lfyp1pxnUXolgY0c90A6Wyu2rY6vmsAAXqVn&hs=1   брал год назад на Али",
      "user_id": 158002271487,
      "created_at": "2025-07-23T08:04:19Z",
      "updated_at": "2025-07-23T08:04:19Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158005392774,
      "body_text": "Но контроллер там старый, с таким зеленым проводком, там нету подключения для моторчиков",
      "user_id": 158002271487,
      "created_at": "2025-07-23T08:05:36Z",
      "updated_at": "2025-07-23T08:05:36Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158005396816,
      "body_text": "Так, я вроде оживил педали посредством перепрошивки, и оживил моторчик посредством перевтыкания всего из контроллера и розетки. У меня складывается впечатление что всё таки что то с контроллером, почему всё так рандомно работает? А помогает только перевтыкания всего в розетку, как будто там в короткое замыкание что-то уходит и помогает сброс питания....то есть я вынул моторчик, я вынул юсб от компьютера и я вынул из розетки БП....и всё это одновременно, чтобы не было никакого запитывания",
      "user_id": 158002271487,
      "created_at": "2025-07-23T08:25:33Z",
      "updated_at": "2025-07-23T08:25:33Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158005426566,
      "body_text": "Hi anton shishonkov,     На самом деле это всего лишь особенность проверки сигнала программой.  Если подключать всё по порядку, в процессе ничего не будет отключаться.",
      "user_id": 158000445778,
      "created_at": "2025-07-23T10:53:23Z",
      "updated_at": "2025-07-23T10:53:23Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005427870,
      "body_text": "Хорошо, тогда во первых - скажите мне правильный порядок подключения всего,\r\nу вас ни инструкций и ничего другого нет,\r\n\r\nво вторых почему игра в моменте перестает видеть педали и требуется сделать\r\nповторную перепрошивку, чтобы их игра увидела. При этом после перепрошивки\r\nтакже отключаются моторчики и не подают признаков жизни, пока не обесточу\r\nполностью контроллер\r\n\r\nВ третьих почему при работе вашего ПО происходит треск микрофона,\r\nвыключаешь менеджер - все нормально.\r\n\r\nВ четвёртых - на педалях появилась задержка, так называемый input lag,\r\nкоторый абсолютно никак не выключается и это жутко неудобно\r\n\r\n\r\n\r\nср, 23 июл. 2025 г., 13:53 support@simsonn.com ",
      "user_id": 158002271487,
      "created_at": "2025-07-23T11:01:41Z",
      "updated_at": "2025-07-23T11:01:41Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005430096,
      "body_text": "Hi anton shishonkov,    Вы приобрели PlusX и двигатели VAM, верно?  Сейчас при тестировании двигатели VAM работают нормально?  Какой у вас руль (база)? Используете ли вы вибросиденье?  Есть ли у вашего компьютера трёхконтактная вилка (то есть надёжное заземление)?  Мы хотим убедиться, есть ли внешние помехи от базы и могут ли они быть сняты через заземление.",
      "user_id": 158000445778,
      "created_at": "2025-07-23T11:10:52Z",
      "updated_at": "2025-07-23T11:10:52Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005431492,
      "body_text": "Сегодня утром все работало нормально, за исключением инпут лага на педалях,\r\nна старом контроллере такого нет например, вчера тестировал.\r\n\r\nУ меня база моза р16. Никаких вибросидений нет. Кокпит из алюминиевого\r\nпрофиля и обычное кресло.\r\n\r\nВсе запитывается: компьютер отдельная розетка, все остальное - через другую\r\nрозетку с помощью разветвитель. (Там БП базы, БП моторчика, телевизор)\r\n\r\nЗаземление от разветвителя естественно присутствует\r\n\r\nср, 23 июл. 2025 г., 14:11 support@simsonn.com ",
      "user_id": 158002271487,
      "created_at": "2025-07-23T11:17:28Z",
      "updated_at": "2025-07-23T11:17:28Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005434796,
      "body_text": "Hi anton shishonkov,     После обновления появляющаяся ошибка «отключено» и необходимость одновременно отключать USB и питание 24V действительно могут вводить в заблуждение. Мы уведомим команду разработчиков для исправления и улучшения. Что касается внезапного отсутствия педалей, у меня недостаточно информации, но учитывая упомянутые вами посторонние шумы в микрофоне, я предполагаю, что причина может быть в помехах от вашей базы или в отсутствии надёжного заземления компьютера. У других клиентов были аналогичные случаи, и обычно после обеспечения корректного заземления проблема исчезала. Пожалуйста, убедитесь, что зелёный провод заземления контроллера подключён к любому винту педали, при этом следует учитывать, что краска может ухудшить контакт. Относительно упомянутой вами «задержки ввода» я не совсем понял, что именно имеется в виду. Если двигатель продолжает вибрировать и не останавливается, это может быть связано с помехами по USB или нестабильным питанием, что вызывает отключение устройства и мешает SIMSONN Manager своевременно передать команду остановки. Также убедитесь, что устройство подключено непосредственно к синему USB 3.0 порту на задней панели компьютера, не используйте USB-хабы. Кроме того, наши педали PlusX имеют сертификацию CE EMI и не излучают помехи наружу.     База Moza может создавать помехи для других устройств, аналогично Fanatec CLS DD. Если её сетевой разъём и разъём питания компьютера имеют только два контакта или настенная розетка не имеет надёжного заземления, такие помехи не могут быть отведены. Фактически, это вызвано небольшими утечками тока с базы. Напряжение невысокое, но через металлический кокпит оно может влиять на датчики давления педалей, моторы и USB-подключение компьютера. В наших тестовых условиях с правильным заземлением таких проблем не возникает. В противном случае мы не смогли бы продавать столь «нестабильный» продукт, так как это вызвало бы массу проблем с гарантией и поддержкой.        Обеспечьте правильное заземление: убедитесь, что компьютер подключён к розетке с тремя контактами и надёжным заземлением. Вилки с двумя контактами не обеспечивают заземления.    Заземление контрольного блока: используйте зелёный экранированный провод, чтобы соединить металлический корпус (например, медный штифт или винт) контрольного блока с любым металлическим винтом на педали. Убедитесь, что точка контакта не окрашена и проводит электричество.    Заземление базы (например, Fanatec / MOZA): рекомендуется соединить металлическую часть базы с корпусом ПК или внешним заземлением, чтобы устранить накопление статического электричества.    Избегайте зон с высоким уровнем помех: держите USB-кабели подальше от силовых кабелей высокого напряжения или адаптеров; по возможности прокладывайте кабели отдельно.    Используйте прямое USB-подключение: подключайте устройства напрямую к заднему порту USB 3.0 на ПК, не используя некачественные или не питаемые USB-концентраторы.    Используйте USB-кабели с ферритовыми кольцами: при необходимости замените кабели на качественные USB-кабели с ферритовыми фильтрами для снижения высокочастотных помех.    Обновите программное обеспечение и прошивку: убедитесь, что SIMSONN Manager и прошивка обновлены до последней версии, так как некоторые обновления включают улучшенную обработку ЭМИ.    Используйте USB-изолятор: если вышеуказанные методы не решают проблему, рекомендуется использовать USB-изолятор. Он физически разделяет линии питания и передачи данных USB, эффективно защищая контроллер от источников помех.     https://github.com/SHWotever/SimHub/wiki/USB-Issues-Troubleshooting   https://support.gomezsimindustries.com/portal/en/kb/articles/understanding-emi-and-grounding",
      "user_id": 158000445778,
      "created_at": "2025-07-23T11:31:56Z",
      "updated_at": "2025-07-23T11:31:56Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005440184,
      "body_text": "1- у меня нет никаких зелёных проводов на новом контроллере, на старом да,\r\nесть, но я не могу использовать его с моторами. Ну и также со старым\r\nконтроллером вообще проблем не было, я этот провод просто не использовал.\r\n\r\n2 input lag так называемый или задержка, появилась после смены контроллера,\r\nна старом контроллере все в порядке. Что я имею в виду, например: я резко\r\nнажимаю и отжимаю педаль газа, педаль резко приходит в исходное положение,\r\nно в игре на экране работы педали, она продолжает отжиматься с задержкой\r\nпримерно в 0.2 секунды, это очень неудобно и такого быть не\r\nдолжно....педаль стала банально нелинейной и работать с задержкой.\r\n\r\n3 - хорошо, но как мне заземлить данный контроллер, поможет ли мне юсб\r\nизолятор вместо провода?\r\n\r\n\r\n\r\nср, 23 июл. 2025 г., 14:32 support@simsonn.com ",
      "user_id": 158002271487,
      "created_at": "2025-07-23T11:56:07Z",
      "updated_at": "2025-07-23T11:56:07Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005441003,
      "body_text": "Hi anton shishonkov,  Этот зелёный заземляющий провод также необходимо подключить. Кроме того, при нажатии педали газа в игре она должна возвращаться так же плавно, как это отображается в программном обеспечении SIMSONN Manager, без задержек. Возможно, проблема всё ещё связана с электромагнитными помехами (EMI). Вы можете попробовать провести тест с отключённой базой. Я предоставлю инструмент VKB для проверки — с его помощью результат будет более наглядным. Также использование USB-изолятора даёт заметный эффект. ",
      "user_id": 158000445778,
      "created_at": "2025-07-23T12:02:51Z",
      "updated_at": "2025-07-23T12:02:51Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005485095,
      "body_text": "Вот в том то и дело, в программах всё нормально и в менеджере и в той, что вы мне выслали, а именно в игре задержка. Я не понимаю почему. На старом контроллере такого нету, там всё нормально.  У меня нету в комплекте никакого заземляющего провода на том контроллере, что я купил к моторчик, он есть на старом контроллере, но и без него всё в порядке было. Попробую конечно юсб изолятор, но что-то это какая то мутная история. На старом контроллере с педалями всё в порядке было, на новой ревизии такой бред творится...  https://drive.google.com/file/d/1bFB17yXPxOFApZ0IhRrKTYbAlaMByP91/view?usp=sharing",
      "user_id": 158002271487,
      "created_at": "2025-07-23T21:41:04Z",
      "updated_at": "2025-07-23T21:41:04Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158005487369,
      "body_text": "Hi anton shishonkov,  Вы можете подключить зелёный заземляющий провод от старого контроллера к новому блоку управления — это и есть основное отличие. В такой конфигурации датчик давления должен находиться в той же системе заземления, что и блок управления. Кроме того, я посмотрел ваше видео и заметил проблему: вы проверяли нажатие педали в настройках iRacing, верно? А в самой игре, во время вождения, индикатор педали тоже движется медленно? ",
      "user_id": 158000445778,
      "created_at": "2025-07-24T02:23:17Z",
      "updated_at": "2025-07-24T02:23:17Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005487394,
      "body_text": "Hi anton shishonkov,  Интерфейс iRacing сам по себе имеет эффект задержки анимации, если только старый контроллер Pro Plus не реагирует быстрее, что может объяснить разницу. Вы также можете предоставить видео для сравнения. Кроме того, версия Pro Plus 1.7.1 также может быть обновлена для поддержки SIMSONN Manager 2.0.9 — просто выберите прошивку plus.sfu. Если подтвердится, что дело в этом, я уведомлю команду разработчиков, чтобы быстро исправить проблему. ",
      "user_id": 158000445778,
      "created_at": "2025-07-24T02:26:57Z",
      "updated_at": "2025-07-24T02:26:57Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005487933,
      "body_text": "Hi anton shishonkov,   Turn off this filter switch, and the data refresh rate in iRacing should become much faster, eliminating the delay. ",
      "user_id": 158000445778,
      "created_at": "2025-07-24T03:30:30Z",
      "updated_at": "2025-07-24T03:30:30Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005488901,
      "body_text": "Юсб Изолятор вместо зеленого провода подойдет? или нужно еще и проводом заземлить?     Я попробую сегодня старый контроллер и запишу видео, хотя уже трогать ничего не хочется если честно xD     Я пробовал выключать эти фильтры - они либо не работают (не выключаются), либо наоборот работают и их никак нельзя отключить. В общем - отключай их или не отключай, на работу они никак не влияют эти фильтры.",
      "user_id": 158002271487,
      "created_at": "2025-07-24T06:31:08Z",
      "updated_at": "2025-07-24T06:31:08Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158005489329,
      "body_text": "Hi anton shishonkov,  Вы можете следовать моему совету и подключить зелёный провод от контроллера к металлическому винту на педали. Что касается отключения фильтра, то я лично проверял это вместе с командой разработчиков: после его отключения отклик педалей в тестовом интерфейсе iRacing становится очень быстрым. Я не уверен, нажимали ли вы кнопку отключения фильтра, затем кнопку Save, а потом уже тестировали в настройках iRacing. На самом деле изменения вступают в силу сразу и действительно работают. ",
      "user_id": 158000445778,
      "created_at": "2025-07-24T07:44:27Z",
      "updated_at": "2025-07-24T07:44:27Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005489428,
      "body_text": "Хорошо, попробую еще раз, не помню точно нажимал ли save. Если не поможет - напишу",
      "user_id": 158002271487,
      "created_at": "2025-07-24T07:55:50Z",
      "updated_at": "2025-07-24T07:55:50Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158005505222,
      "body_text": "Да, спасибо, кнопка save помогла, но я обычно нажимал save as и сохранял под названием.....инпут лаг пропал.  Осталось разобраться с рандомными отключениями педалей,  заказал юсб изолятор, надеюсь поможет, Со старого снять проводок не получилось, он видимо припаян к самому болтику или его разбирать надо полностью.",
      "user_id": 158002271487,
      "created_at": "2025-07-24T18:30:55Z",
      "updated_at": "2025-07-24T18:30:55Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158005510241,
      "body_text": "Hi anton shishonkov,    Проблема случайного отключения USB не связана с нашим продуктом, а вызвана особенностями компьютерной среды некоторых клиентов и электромагнитными помехами от базы. Для решения этой ситуации мы предоставили соответствующее решение: зелёный провод не требует пайки, он фиксируется всего лишь одним винтом M3. Пожалуйста, сделайте фотографию зелёного провода на вашем старом контроллере и отправьте мне, чтобы я понял, почему его невозможно снять. Если проблема не связана с длительной транспортировкой, я могу сразу отправить вам новый зелёный провод.",
      "user_id": 158000445778,
      "created_at": "2025-07-25T01:32:52Z",
      "updated_at": "2025-07-25T01:32:52Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005538591,
      "body_text": "Ну, вроде второй день без выключений прошел. Завтра приедет ещё юсб изолятор и с ним потестирую. Возможно проблема в прошивке была, которая слетала. Зелёный проводок я повредил, к сожалению :(",
      "user_id": 158002271487,
      "created_at": "2025-07-25T16:56:05Z",
      "updated_at": "2025-07-25T16:56:05Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158005538619,
      "body_text": "",
      "user_id": 158002271487,
      "created_at": "2025-07-25T16:57:58Z",
      "updated_at": "2025-07-25T16:57:58Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158005538672,
      "body_text": "Повредил усики для крепежа, когда доставал из коробки, зацепили за что то и оборвались :(",
      "user_id": 158002271487,
      "created_at": "2025-07-25T17:00:05Z",
      "updated_at": "2025-07-25T17:00:05Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158005550984,
      "body_text": "Hi anton shishonkov,  Есть ли ещё какие-либо повреждённые детали? Если да, мы можем отправить вам все замены одной посылкой экспресс-доставкой. ",
      "user_id": 158000445778,
      "created_at": "2025-07-26T04:10:39Z",
      "updated_at": "2025-07-26T04:10:39Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005577039,
      "body_text": "Да мне кажется это себе дороже выйдет, ну если есть вариант отправить его через Ozon в пункт выдачи (где я моторчики покупал), то можно. Нет, повреждённых деталей кроме него больше нет. Слишком хрупкие усики оказались. Спасибо",
      "user_id": 158002271487,
      "created_at": "2025-07-26T08:39:22Z",
      "updated_at": "2025-07-26T08:39:22Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158005584388,
      "body_text": "Hi anton shishonkov,    Хорошо, я уже уведомил отдел продаж, чтобы они отправили вам новую зелёную заземляющую линию.",
      "user_id": 158000445778,
      "created_at": "2025-07-26T10:03:35Z",
      "updated_at": "2025-07-26T10:03:35Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}