{
  "id": 1782,
  "subject": "Vam pro disconnection issues.",
  "description_text": "I just recently got and installed my vam pro motors on my pro x ultra\r\npedals and im getting intermittent disconnects every 10 - 15 minutes.\r\nHaving to unplug and plug back in the USB. I have the control box mounted\r\nunder my pedals on the other side of the plate. Ive also tried simhub with\r\nthe simsonn software closed.\r\n\r\n",
  "status": 3,
  "priority": 3,
  "created_at": "2025-07-22T12:16:09Z",
  "updated_at": "2025-08-09T15:10:49Z",
  "requester_id": 158002276781,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158005355458,
      "body_text": "Hi Joseph Bacha,    The issue may be caused by an unstable power supply. Please connect the pedal’s USB cable directly to a blue USB 3.0 port on the back of your PC, and avoid using a USB hub.  Additionally, if your PC uses a 2-prong power plug or the wall socket lacks grounding, electromagnetic interference from devices like Fanatec or Moza wheelbases may not be properly discharged. This can cause frequent USB disconnections. In our test environment, connections remain stable even overnight.     To address EMI (Electromagnetic Interference) issues, please follow the steps below to improve device stability and USB connection reliability:     1.    Ensure proper grounding: Make sure the computer is connected to a three-prong outlet with a reliable ground. Two-prong plugs do not provide grounding.     2.    Control box grounding: Use a green shielding wire to connect the metal housing (such as a copper post or screw) of the control box to any metal screw on the pedal. Ensure the contact point is paint-free and conductive.     3.    Base grounding (e.g., Fanatec / MOZA): It’s recommended to connect the metal part of the base to the PC chassis or an external ground to discharge static buildup.     4.    Avoid high-interference zones: Keep USB cables away from high-voltage power lines or adapters; route cables separately where possible.     5.    Use direct USB connection: Connect devices directly to a rear USB 3.0 port on the PC instead of using unpowered or low-quality USB hubs.     6.    Use USB cables with ferrite cores: If needed, switch to high-quality USB cables with ferrite beads to reduce high-frequency interference.     7.    Keep software and firmware updated: Ensure SIMSONN Manager and firmware are updated to the latest version, as some updates include EMI handling improvements.     8.    Use a USB isolator: If the above methods don’t resolve the issue, using a USB isolator is recommended. It physically separates the USB power and data lines, effectively shielding the control device from EMI sources.        https://github.com/SHWotever/SimHub/wiki/USB-Issues-Troubleshooting   https://support.gomezsimindustries.com/portal/en/kb/articles/understanding-emi-and-grounding",
      "user_id": 158000445778,
      "created_at": "2025-07-23T03:43:39Z",
      "updated_at": "2025-07-23T03:43:39Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158006163911,
      "body_text": "Ive tried all of those steps and still get frequent disconnections\r\n\r\n",
      "user_id": 158002276781,
      "created_at": "2025-08-03T18:20:25Z",
      "updated_at": "2025-08-03T18:20:25Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006278552,
      "body_text": "Hi Joseph Bacha,  First, update the software to SIMSONN Manager 2.1.0 in the “Settings → Update” section. Then, in the Settings → Update interface, click Manual Firmware Update, navigate to the pedals-firmware folder → pedals folder, and select the proxultra.sfu file to update. This firmware will disable the 4th axis. After completing the update, please test again. ",
      "user_id": 158000445778,
      "created_at": "2025-08-05T13:42:35Z",
      "updated_at": "2025-08-05T13:42:35Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158006441769,
      "body_text": "So that fixed some of the disconnection issues. Played an hour and half of\r\nGRID Legends with 0 rumble motor disconnects. Today I played 40 min of\r\nAmerican Truck Simulator and got 6 rumble motor disconnections in that 40\r\nminutes.\r\n\r\n",
      "user_id": 158002276781,
      "created_at": "2025-08-06T22:26:15Z",
      "updated_at": "2025-08-06T22:26:15Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006600150,
      "body_text": "Hi Joseph Bacha,  You should connect the device to the USB 3.0 (blue) port on the back of your PC. Avoid using a USB hub, as they are often unstable. ",
      "user_id": 158000445778,
      "created_at": "2025-08-09T15:10:48Z",
      "updated_at": "2025-08-09T15:10:48Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}