{
  "id": 1940,
  "subject": "New review (4★) of Simsonn VAM Pro Linear Motor - the Pedals Haptic Reactor for Vibration Feedback (from John B.)",
  "description_text": "Rating: 4 | Review Text: For the price these haptic reactors can't really be beaten. Solid construction, a little tricky to mount on some of the pedals but they did go on with some cajoling and unscrewing of various pedal bolts. \r\n\r\nThe force feedback feels good I mainly have ABS, traction loss and then road rumble strips running at either end. Couldn't seem to get it to work via the Simsonn software on iRacing so am using SimHub.\r\n\r\nOne gripe however is the power cable doesn't seem to lock into place and so comes lose easily when moving the rig. Could do with a clip or something to just hold it in there. ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ This review was automatically published.Learn more Brilliant! You have a new 4-star review of Simsonn VAM Pro Linear Motor - the Pedals Haptic Reactor for Vibration Feedback from John Bakie john.bakie@googlemail.com This review was generated by a Loox reminder email. John Bakie Display name: John B. For the price these haptic reactors can't really be beaten. Solid construction, a little tricky to mount on some of the pedals but they did go on with some cajoling and unscrewing of various pedal bolts. \r\n\r\nThe force feedback feels good I mainly have ABS, traction loss and then road rumble strips running at either end. Couldn't seem to get it to work via the Simsonn software on iRacing so am using SimHub.\r\n\r\nOne gripe however is the power cable doesn't seem to lock into place and so comes lose easily when moving the rig. Could do with a clip or something to just hold it in there. View, Reply or Share Customize for social Unpublish review This email is sent for 0a6bb1.myshopify.com Unsubscribe \r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-07-26T11:20:39Z",
  "updated_at": "2025-07-27T02:03:36Z",
  "requester_id": 158000954852,
  "responder_id": null,
  "cc_emails": [
    "john.bakie@googlemail.com"
  ],
  "conversations": [
    {
      "id": 158005620212,
      "body_text": "Hi john,     You can try updating to SIMSONN Manager version 2.1.0 to see if it resolves the ABS telemetry issue in iRacing. For now, you can temporarily secure the motor’s power cable with a zip tie. I’ll also pass this feedback on to the team to see if we can improve the power cable locking mechanism in future designs. ",
      "user_id": 158000445778,
      "created_at": "2025-07-27T02:03:36Z",
      "updated_at": "2025-07-27T02:03:36Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}