{
  "id": 1958,
  "subject": "Business Inquiry – Potential Partnership",
  "description_text": "Dear SIMSONN Team,\r\n\r\nMy name is Iskren Pondev, and I represent SIM GEAR Ltd., an established \r\nretailer of sim racing equipment in Europe. We recently discovered your \r\nrange of wind simulator products and were very impressed by their \r\ndesign, performance capabilities, and potential value to the sim racing \r\ncommunity.\r\n\r\nCurrently, we do not offer any wind simulation products in our \r\nportfolio, and we believe your solutions would be a great addition to \r\nour store. We are very interested in starting a business relationship \r\nwith you and exploring the possibility of distributing or reselling your \r\nproducts.\r\n\r\nCould you please share more information about your distribution \r\nconditions, pricing, and requirements for a potential business \r\ncollaboration? We are open to discussing any necessary steps to \r\nestablish a successful partnership.\r\n\r\nLooking forward to your response.\r\n\r\n-- \r\n\r\n\r\n    IskrenPondev\r\n\r\nOffice Manager\r\n\r\nOffice Department  | SIM Gear Ltd.\r\n\r\n\t\r\n\r\n\t\r\n\t\r\n\r\n\t\r\nmobilePhone\r\n\r\n\t+359 895 743 800 <tel:+359 876 505 565> | +359 876 505 565 <tel:+359 \r\n894 484 487>\r\nemailAddress\r\n\r\n\toffice@simgear.bg <mailto:office@simgear.bg>\r\nwebsite\r\n\r\n\twww.simgear.bg <//www.simgear.bg>\r\naddress\r\n\r\n\tSofia, Bulgaria\r\n\r\n\r\n\r\n\r\n\t\r\nfacebook \t\r\n\r\n\tinstagram \t\r\n\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-07-26T20:07:34Z",
  "updated_at": "2025-07-31T05:53:56Z",
  "requester_id": 158002358422,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158005620237,
      "body_text": "Hi Iskren Pondev,     We’re glad to hear that you’re interested in our products, and we’re also interested in exploring a distribution partnership with you. I’ve looked through your website and noticed you represent quite a number of brands. Could you share more about your distribution model? Do you purchase directly from us and stock the products in your local warehouse before selling them?",
      "user_id": 158000445778,
      "created_at": "2025-07-27T02:12:33Z",
      "updated_at": "2025-07-27T02:12:33Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005648446,
      "body_text": "Thank you for your prompt response.\r\n\r\nWe work with different brands in various ways and would like to learn \r\nmore about how your company operates. We’d appreciate it if you could \r\nshare more details about your workflow and collaboration terms.\r\n\r\nSpecifically, we are interested in the following:\r\n\r\n- What are your general conditions for partnership?\r\n\r\n- How do you handle technical issues and what warranty policies do you \r\noffer?\r\n\r\n- Is it possible to start with a dropshipping model?\r\n\r\n- Do you offer special terms or discounts for larger initial orders \r\nintended to stock our warehouse?\r\n\r\n- Are you open to providing demo products for video reviews? We are \r\nactively developing our YouTube channel, where we produce detailed \r\nproduct reviews, and we believe this could help quickly establish your \r\nbrand in our market.\r\n\r\nWe also organize virtual racing championships on platforms such as \r\niRacing, Dirt 2.0, WRC, Assetto Corsa, and Richard Burns Rally. These \r\nevents can serve as an additional marketing platform to promote your brand.\r\n\r\nOur goal is to build a stable and effective partnership, so we would \r\nlike to understand your full process—from start to finish.\r\n\r\nWe look forward to your response.\r\n\r\nBest regards,\r\n\r\n",
      "user_id": 158002358422,
      "created_at": "2025-07-27T13:20:26Z",
      "updated_at": "2025-07-27T13:20:26Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005869605,
      "body_text": "Hi Office | SIM Gear Ltd.，    对于批量订单，我们会根据您的购买数量和金额提供折扣。 请告知我们您需要的产品和数量，我们将为您提供相应的批发价格。 所有产品均享有 2 年保修，保修期过后，我们将以成本价提供备件更换。 如遇技术问题，客户可通过电子邮件直接联系我们的支持团队，我们通常会在 24 小时内回复。  至于一件代发，我们不建议这种方式，因为它涉及关税、物流成本和配送延迟等不确定性。 海外一件代发还可能导致库存不一致或计划库存不足，从而与我们的销售产生冲突，导致库存短缺。",
      "user_id": 158000445778,
      "created_at": "2025-07-31T05:53:56Z",
      "updated_at": "2025-07-31T05:53:56Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}