{
  "id": 202,
  "subject": "Feedback for Simsonn Sequential Shifter",
  "description_text": "I've included a machine translation via ChatGPT below. Original is \r\nwritten in english.\r\n\r\nHello,\r\n\r\nI recently purchased your sequential shifter and handbrake, and both are \r\nexcellent products. I’m very happy with them — they exceeded my \r\nexpectations in terms of quality and mechanical operation.\r\n\r\nHowever, I did notice two minor issues with the shifter that you might \r\nconsider addressing at the factory before shipping:\r\n\r\n 1.\r\n\r\n    *Loose Hex Screws:* Two sets of hex screws on the shifter body were\r\n    loosening during operation — one at the pivot point of the lever\r\n    arm, and another directly below it. I resolved this by applying blue\r\n    threadlocker. For the lower set, I also added washers. You might\r\n    consider also including oversized oxidized (blackened) washers from\r\n    the start to maintain the shifter’s blacked-out aesthetic and spread\r\n    the load evenly on the pivot point, to avoid over-tightening.\r\n\r\n 2.\r\n\r\n    *Loose Adjustment Nut:* The left nut on the strength adjustment\r\n    mechanism was also coming loose during use. Again, blue threadlocker\r\n    and tightening resolved the issue.\r\n\r\nAdditionally, I have one suggestion: the two rear buttons on the shifter \r\ncould be left blank (instead of S1 and S2), with a set of stickers \r\nincluded so customers can customize them as they like.\r\n\r\nI've attached photos for everything I mentioned here.\r\n\r\nOverall, it’s a very solid and well-built product. Thank you, and best \r\nwishes from Poland!\r\n\r\nMatt Slomka\r\n\r\n你好，\r\n\r\n我最近购买了你们的序列式换挡器和手刹，这两款产品都非常出色。它们的质量和机械操作性能超出了我的预期，我对此非常满意。\r\n\r\n不过，我在使用换挡器时注意到两个小问题，您可能可以在出厂前进行改进：\r\n\r\n螺丝松动：换挡器本体上有两组内六角螺丝在使用过程中会松动——一组位于换挡杆的枢轴点，另一组位于其正下方。我通过涂抹蓝色螺丝胶解决了这个问题。对于下方那组，我还额外添加了垫圈。建议您从出厂开始就配备加大的氧化（黑化）垫圈，以保持换挡器的整体黑色外观，同时能更均匀地分散枢轴点的受力，避免用户过度拧紧。\r\n\r\n调节螺母松动：力度调节机构左侧的螺母在使用过程中也会松动。我同样通过使用蓝色螺丝胶并重新紧固解决了这个问题。\r\n\r\n另外，我还有一个小建议：换挡器背部的两个按钮可以出厂时不印“S1”和“S2”，改为空白，并附上一套贴纸，供用户根据需要自行贴上标识。\r\n\r\n我已附上了相关问题的照片供您参考。\r\n\r\n总的来说，这是一款结构扎实、做工优良的产品。谢谢你们，来自波兰的诚挚祝福！\r\n\r\nMatt Slomka\r\n\r\n",
  "status": 3,
  "priority": 3,
  "created_at": "2025-06-05T13:41:29Z",
  "updated_at": "2025-06-06T02:26:00Z",
  "requester_id": 158001249087,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158002538938,
      "body_text": "Hi Matt Slomka, We have received your message — thank you very much for taking the time to share your valuable feedback on our product. Personally, I find your suggestions highly insightful. I’ve already forwarded your feedback to our design and development team, and our engineers will work on it as soon as possible. If we make any updates to the product, we will let you know right away. ",
      "user_id": 158000445778,
      "created_at": "2025-06-06T02:26:00Z",
      "updated_at": "2025-06-06T02:26:00Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}