{
  "id": 2108,
  "subject": "Questions about Order #SSN2155",
  "description_text": "Hello, I ordered the Simsonn Pro x Ultra with haptic reactor pedals two \r\ndays ago, and today i saw that the shipment started, but first of all I \r\nnoticed that the number of the the adress is missing, I guess i forgot \r\nto type it so sorry for that, either way the adress is Via del Pincio 3.\r\n\r\nSecondly some minutes ago UPS (while in the order page it appears to be \r\nDHL the courier) sent me a mail asking for the value of the package and \r\nother info, I'm asking if everything it's ok or some info is missing, \r\nthank you\r\n\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-07-30T14:27:16Z",
  "updated_at": "2025-08-04T09:22:09Z",
  "requester_id": 158002435540,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158005864235,
      "body_text": "Hi Lorenzo Pasquini,     We apologize, but we are unable to change the address at this time. You may contact your local DHL office to request an address change once the package arrives in Italy.",
      "user_id": 158001343601,
      "created_at": "2025-07-31T01:33:15Z",
      "updated_at": "2025-07-31T01:33:15Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158006201180,
      "body_text": "Hello the issue of the address was solved, however I have now to pay an\r\nadditional price of 97 euros (or 112$) of customs service, and I have to\r\nask why isnt it written in the store or in the moment that i have to pay?\r\nThe delivery stated that I had to pay 30$ and I don't think is fair to come\r\nto knowledge about it like that. At least there should have bene a warning\r\nabout the cost of the customs service, or even so there shouldn't have\r\nbeen, since the pedals I ordered came from germany, and the baseplate from\r\nchina.\r\nIl 31/07/2025 03:33, service@simsonn.com ha scritto:\r\n\r\nHi Lorenzo Pasquini,\r\n\r\nWe apologize, but we are unable to change the address at this time. You may\r\ncontact your local DHL office to request an address change once the package\r\narrives in Italy.\r\n\r\n\r\nOn Wed, 30 Jul at 10:27 AM , Lorenzo Pasquini <lorenzopasquini.lp@gmail.com>\r\n<lorenzopasquini.lp@gmail.com> wrote:\r\nHello, I ordered the Simsonn Pro x Ultra with haptic reactor pedals two\r\ndays ago, and today i saw that the shipment started, but first of all I\r\nnoticed that the number of the the adress is missing, I guess i forgot\r\nto type it so sorry for that, either way the adress is Via del Pincio 3.\r\n\r\nSecondly some minutes ago UPS (while in the order page it appears to be\r\nDHL the courier) sent me a mail asking for the value of the package and\r\nother info, I'm asking if everything it's ok or some info is missing,\r\nthank you\r\n\r\n\r\n2108:4206036\r\n\r\n",
      "user_id": 158002435540,
      "created_at": "2025-08-04T08:02:56Z",
      "updated_at": "2025-08-04T08:02:56Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006201339,
      "body_text": "Hi Lorenzo Pasquini,    Sorry, our base plates are out of stock in our German warehouse. We don't understand why such high taxes are being charged for a baseplate. Please send us a UPS invoice and we will try to resolve this issue for you.",
      "user_id": 158001343601,
      "created_at": "2025-08-04T08:19:58Z",
      "updated_at": "2025-08-04T08:19:58Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158006201424,
      "body_text": "Hi, I have attached the receipt of the customs payment\r\n\r\nIl 04/08/2025 10:19, service@simsonn.com ha scritto:\r\n> Hi Lorenzo Pasquini,\r\n>\r\n> Sorry, our base plates are out of stock in our German warehouse. We \r\n> don't understand why such high taxes are being charged for a \r\n> baseplate. Please send us a UPS invoice and we will try to resolve \r\n> this issue for you.\r\n>\r\n>     On Mon, 4 Aug at 4:02 AM , Lorenzo Pasquini\r\n>     <lorenzopasquini.lp@gmail.com> wrote:\r\n>     Hello the issue of the address was solved, however I have now to\r\n>     pay an additional price of 97 euros (or 112$) of customs service,\r\n>     and I have to ask why isnt it written in the store or in the\r\n>     moment that i have to pay? The delivery stated that I had to pay\r\n>     30$ and I don't think is fair to come to knowledge about it like\r\n>     that. At least there should have bene a warning about the cost of\r\n>     the customs service, or even so there shouldn't have been, since\r\n>     the pedals I ordered came from germany, and the baseplate from china.\r\n>     Il 31/07/2025 03:33, service@simsonn.com ha scritto:\r\n>\r\n>         Hi Lorenzo Pasquini,\r\n>\r\n>         We apologize, but we are unable to change the address at this\r\n>         time. You may contact your local DHL office to request an\r\n>         address change once the package arrives in Italy.\r\n>\r\n>\r\n>             On Wed, 30 Jul at 10:27 AM , Lorenzo Pasquini\r\n>             <lorenzopasquini.lp@gmail.com>\r\n>             <mailto:lorenzopasquini.lp@gmail.com> wrote:\r\n>             Hello, I ordered the Simsonn Pro x Ultra with haptic\r\n>             reactor pedals two\r\n>             days ago, and today i saw that the shipment started, but\r\n>             first of all I\r\n>             noticed that the number of the the adress is missing, I\r\n>             guess i forgot\r\n>             to type it so sorry for that, either way the adress is Via\r\n>             del Pincio 3.\r\n>\r\n>             Secondly some minutes ago UPS (while in the order page it\r\n>             appears to be\r\n>             DHL the courier) sent me a mail asking for the value of\r\n>             the package and\r\n>             other info, I'm asking if everything it's ok or some info\r\n>             is missing,\r\n>             thank you\r\n>\r\n>\r\n> 2108:4206036\r\n",
      "user_id": 158002435540,
      "created_at": "2025-08-04T08:31:43Z",
      "updated_at": "2025-08-04T08:31:43Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006201587,
      "body_text": "Hi Lorenzo Pasquini,    We apologise, but we are unaware of what the ‘Addebiti governativi’ charge refers to. We can cover the cost of 60 dollars for you, or you may choose to abandon the shipment and wait for our German warehouse to restock around the 11th, at which point we will reship the item to you. We apologise for any inconvenience this may cause.",
      "user_id": 158001343601,
      "created_at": "2025-08-04T08:51:02Z",
      "updated_at": "2025-08-04T08:51:02Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158006201645,
      "body_text": "Look I already paid the customs service so I don't want to abandon the \r\nshipment, anyway if you could cover me 60 dollars it would be ok, \r\naltough sorry but I think that I shouldn't have paid at all the customs \r\nservice and should've got a notification about the missing stock\r\n\r\nIl 04/08/2025 10:51, service@simsonn.com ha scritto:\r\n> Hi Lorenzo Pasquini,\r\n>\r\n> We apologise, but we are unaware of what the ‘Addebiti governativi’ \r\n> charge refers to. We can cover the cost of 60 dollars for you, or you \r\n> may choose to abandon the shipment and wait for our German warehouse \r\n> to restock around the 11th, at which point we will reship the item to \r\n> you. We apologise for any inconvenience this may cause.\r\n>\r\n>\r\n>\r\n>     On Mon, 4 Aug at 4:31 AM , Lorenzo Pasquini\r\n>     <lorenzopasquini.lp@gmail.com> wrote:\r\n>     Hi, I have attached the receipt of the customs payment\r\n>     Il 04/08/2025 10:19, service@simsonn.com ha scritto:\r\n>\r\n>         Hi Lorenzo Pasquini,\r\n>\r\n>         Sorry, our base plates are out of stock in our German\r\n>         warehouse. We don't understand why such high taxes are being\r\n>         charged for a baseplate. Please send us a UPS invoice and we\r\n>         will try to resolve this issue for you.\r\n>\r\n>             On Mon, 4 Aug at 4:02 AM , Lorenzo Pasquini\r\n>             <lorenzopasquini.lp@gmail.com> wrote:\r\n>             Hello the issue of the address was solved, however I have\r\n>             now to pay an additional price of 97 euros (or 112$) of\r\n>             customs service, and I have to ask why isnt it written in\r\n>             the store or in the moment that i have to pay? The\r\n>             delivery stated that I had to pay 30$ and I don't think is\r\n>             fair to come to knowledge about it like that. At least\r\n>             there should have bene a warning about the cost of the\r\n>             customs service, or even so there shouldn't have been,\r\n>             since the pedals I ordered came from germany, and the\r\n>             baseplate from china.\r\n>             Il 31/07/2025 03:33, service@simsonn.com ha scritto:\r\n>\r\n>                 Hi Lorenzo Pasquini,\r\n>\r\n>                 We apologize, but we are unable to change the address\r\n>                 at this time. You may contact your local DHL office to\r\n>                 request an address change once the package arrives in\r\n>                 Italy.\r\n>\r\n>\r\n>                     On Wed, 30 Jul at 10:27 AM , Lorenzo Pasquini\r\n>                     <lorenzopasquini.lp@gmail.com>\r\n>                     <mailto:lorenzopasquini.lp@gmail.com> wrote:\r\n>                     Hello, I ordered the Simsonn Pro x Ultra with\r\n>                     haptic reactor pedals two\r\n>                     days ago, and today i saw that the shipment\r\n>                     started, but first of all I\r\n>                     noticed that the number of the the adress is\r\n>                     missing, I guess i forgot\r\n>                     to type it so sorry for that, either way the\r\n>                     adress is Via del Pincio 3.\r\n>\r\n>                     Secondly some minutes ago UPS (while in the order\r\n>                     page it appears to be\r\n>                     DHL the courier) sent me a mail asking for the\r\n>                     value of the package and\r\n>                     other info, I'm asking if everything it's ok or\r\n>                     some info is missing,\r\n>                     thank you\r\n>\r\n>\r\n> 2108:4206036\r\n",
      "user_id": 158002435540,
      "created_at": "2025-08-04T09:01:14Z",
      "updated_at": "2025-08-04T09:01:14Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006202134,
      "body_text": "Hi Lorenzo Pasquini,    We apologise, this is the first time we have encountered this situation with Addebiti governativi. We will take note of this and implement full European warehouse shipping as soon as possible. We apologise for the inconvenience caused. We have refunded you $60, please check your account.",
      "user_id": 158001343601,
      "created_at": "2025-08-04T09:11:34Z",
      "updated_at": "2025-08-04T09:11:34Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158006203908,
      "body_text": "Thanks for the refund and the assistance, have a good day\r\n\r\nIl 04/08/2025 11:11, service@simsonn.com ha scritto:\r\n> Hi Lorenzo Pasquini,\r\n>\r\n> We apologise, this is the first time we have encountered this \r\n> situation with Addebiti governativi. We will take note of this and \r\n> implement full European warehouse shipping as soon as possible. We \r\n> apologise for the inconvenience caused. We have refunded you $60, \r\n> please check your account.\r\n>\r\n>     On Mon, 4 Aug at 5:01 AM , Lorenzo Pasquini\r\n>     <lorenzopasquini.lp@gmail.com> wrote:\r\n>     Look I already paid the customs service so I don't want to abandon\r\n>     the shipment, anyway if you could cover me 60 dollars it would be\r\n>     ok, altough sorry but I think that I shouldn't have paid at all\r\n>     the customs service and should've got a notification about the\r\n>     missing stock\r\n>     Il 04/08/2025 10:51, service@simsonn.com ha scritto:\r\n>\r\n>         Hi Lorenzo Pasquini,\r\n>\r\n>         We apologise, but we are unaware of what the ‘Addebiti\r\n>         governativi’ charge refers to. We can cover the cost of 60\r\n>         dollars for you, or you may choose to abandon the shipment and\r\n>         wait for our German warehouse to restock around the 11th, at\r\n>         which point we will reship the item to you. We apologise for\r\n>         any inconvenience this may cause.\r\n>\r\n>\r\n>\r\n>             On Mon, 4 Aug at 4:31 AM , Lorenzo Pasquini\r\n>             <lorenzopasquini.lp@gmail.com> wrote:\r\n>             Hi, I have attached the receipt of the customs payment\r\n>             Il 04/08/2025 10:19, service@simsonn.com ha scritto:\r\n>\r\n>                 Hi Lorenzo Pasquini,\r\n>\r\n>                 Sorry, our base plates are out of stock in our German\r\n>                 warehouse. We don't understand why such high taxes are\r\n>                 being charged for a baseplate. Please send us a UPS\r\n>                 invoice and we will try to resolve this issue for you.\r\n>\r\n>                     On Mon, 4 Aug at 4:02 AM , Lorenzo Pasquini\r\n>                     <lorenzopasquini.lp@gmail.com> wrote:\r\n>                     Hello the issue of the address was solved, however\r\n>                     I have now to pay an additional price of 97 euros\r\n>                     (or 112$) of customs service, and I have to ask\r\n>                     why isnt it written in the store or in the moment\r\n>                     that i have to pay? The delivery stated that I had\r\n>                     to pay 30$ and I don't think is fair to come to\r\n>                     knowledge about it like that. At least there\r\n>                     should have bene a warning about the cost of the\r\n>                     customs service, or even so there shouldn't have\r\n>                     been, since the pedals I ordered came from\r\n>                     germany, and the baseplate from china.\r\n>                     Il 31/07/2025 03:33, service@simsonn.com ha scritto:\r\n>\r\n>                         Hi Lorenzo Pasquini,\r\n>\r\n>                         We apologize, but we are unable to change the\r\n>                         address at this time. You may contact your\r\n>                         local DHL office to request an address change\r\n>                         once the package arrives in Italy.\r\n>\r\n>\r\n>                             On Wed, 30 Jul at 10:27 AM , Lorenzo\r\n>                             Pasquini <lorenzopasquini.lp@gmail.com>\r\n>                             <mailto:lorenzopasquini.lp@gmail.com> wrote:\r\n>                             Hello, I ordered the Simsonn Pro x Ultra\r\n>                             with haptic reactor pedals two\r\n>                             days ago, and today i saw that the\r\n>                             shipment started, but first of all I\r\n>                             noticed that the number of the the adress\r\n>                             is missing, I guess i forgot\r\n>                             to type it so sorry for that, either way\r\n>                             the adress is Via del Pincio 3.\r\n>\r\n>                             Secondly some minutes ago UPS (while in\r\n>                             the order page it appears to be\r\n>                             DHL the courier) sent me a mail asking for\r\n>                             the value of the package and\r\n>                             other info, I'm asking if everything it's\r\n>                             ok or some info is missing,\r\n>                             thank you\r\n>\r\n>\r\n> 2108:4206036\r\n",
      "user_id": 158002435540,
      "created_at": "2025-08-04T09:17:01Z",
      "updated_at": "2025-08-04T09:17:01Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}