{
  "id": 2112,
  "subject": "Affiliate Program",
  "description_text": "Dear Simsonn,\r\n\r\nI hope this email finds you well. My name is Sean Bongcayao, and I’m a\r\npassionate sim racing content creator with a growing audience on\r\nYouTube, TikTok, etc. I’m reaching out because I admire Simsonn\r\ncommitment to offering high-quality, affordable sim racing products\r\nthat provide a compelling alternative to the more expensive mainstream\r\nbrands.\r\nI’d love the opportunity to collaborate with you by testing and\r\nreviewing some of your products, specifically those designed to\r\ndeliver great performance at a fraction of the cost of major brands.\r\n My goal is to showcase how your gear performs for budget-conscious\r\nracers like myself and my audience, highlighting its value and quality\r\nthrough detailed video reviews, written content, and social media posts.\r\n\r\nIn my detailed review of the Simsonn Haptic Vam Pro Linear Motor, I\r\ncompared it to DIY haptic solutions in my setup. Specifically, I evaluated\r\nthe Simsonn motor against a DIY setup using the Dayton Audio bass shaker\r\nfrom Amazon. Given their similar price points, the Simsonn Haptic Vam Pro\r\noffers superior performance and value, making the Dayton Audio option less\r\nappealing.\r\n\r\nI also wanted to try your high-end Simsonn pedals alongside my Fanatec V3\r\npedals to compare their performance. My goal was to demonstrate that more\r\nexpensive pedals aren’t always superior. By showcasing the Simsonn pedals,\r\nI highlight their benefits and show that you don’t need to spend a fortune\r\nto enjoy a high-quality sim racing experience.\r\n\r\n*Comparison with Fanatec V3 Pedals:*\r\n*Performance:* The Simsonn pedals deliver precise and responsive feedback,\r\nrivaling the Fanatec V3 in terms of feel and control.\r\n*Build Quality:* Both sets are well-constructed, but the Simsonn pedals\r\noffer a sleek design with durable materials at a lower price point.\r\n*Price:* The Simsonn pedals are significantly more affordable, making them\r\na compelling option for sim racers on a budget.\r\n\r\n*Benefits of Simsonn Pedals:*\r\n*Affordability:* High-quality performance at a fraction of the cost of\r\npremium brands.\r\n*Ease of Use:* Simple setup and compatibility with most sim racing rigs.\r\n*Accessibility:* Ideal for beginners and enthusiasts looking to enter sim\r\nracing without a large investment.\r\nConclusion\r\n\r\nThe Simsonn pedals prove that you don’t need to spend heavily to achieve a\r\ncompetitive and immersive sim racing experience. Compared to the Fanatec\r\nV3, they offer comparable performance and better value, making them an\r\nexcellent choice for cost-conscious racers.\r\nI’m particularly interested in affordable options that compete with\r\nbigger brands, as I believe my audience would benefit from discovering\r\ncost-effective alternatives like yours.\r\nPlease let me know if you’re interested You can reach me at\r\n\r\nseandom29@gmail.com\r\n213-479-9985.\r\n\r\nThank you for your time and consideration—I’m excited about the\r\npossibility of working together to bring your innovative products to\r\nthe sim racing community! You can check out my sim racing setup in the\r\nYouTube link provided below. Thanks!\r\n\r\nBest regards,\r\nSean Bongcayao\r\nhttps://www.youtube.com/@Grail-05\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-07-30T15:53:32Z",
  "updated_at": "2025-07-31T05:12:26Z",
  "requester_id": 158002437534,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158005863284,
      "body_text": "Hi Sean Bongcayao, Hello, what kind of cooperation do you have in mind? Our website offers a commission program, where you can earn commissions from orders generated through your referrals. ",
      "user_id": 158000445778,
      "created_at": "2025-07-30T23:55:42Z",
      "updated_at": "2025-07-30T23:55:42Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005865569,
      "body_text": "Hello,\r\n\r\nThank you for your message about your affiliate program. I’m eager to\r\ncollaborate and promote your sim racing products through a strategic\r\npartnership. My plan is to showcase your products by creating detailed\r\ncomparisons that highlight their value, leveraging my experience with sim\r\nracing equipment.\r\n\r\nSpecifically, I’d like to produce content comparing your products to my\r\ncurrent setup, which includes Fanatec V3 pedals and a DIY bass shaker. For\r\ninstance, I could create side-by-side reviews or videos demonstrating how\r\nyour solution outperforms a DIY bass shaker, emphasizing its superior\r\nperformance and cost-effectiveness. This would provide valuable insights\r\nfor buyers, showing that a dedicated product like yours can be a better\r\nalternative to DIY setups.\r\n\r\nAdditionally, I’d like to compare your pedals to higher-priced options like\r\nthe Fanatec V3, which retail around $600, versus your more affordable $300\r\noption. My goal is to illustrate that mid-tier products aren’t always the\r\nbest choice and that your pedals offer comparable or better performance at\r\na lower price point, appealing to budget-conscious sim racers.\r\n\r\nI believe this content-driven approach, showcasing real-world comparisons,\r\nwill engage my audience and drive referrals to your products. Looking\r\nforward to your thoughts and next steps.\r\n\r\nBest regards,\r\n\r\nSean Bongcayao\r\n\r\nOn Wed, Jul 30, 2025 at 4:55 PM service@simsonn.com ",
      "user_id": 158002437534,
      "created_at": "2025-07-31T03:42:19Z",
      "updated_at": "2025-07-31T03:42:19Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}