{
  "id": 2160,
  "subject": "Re: Simsonn Order Confirmation #SSN2181",
  "description_text": "That is wonderful. I am using some old generic pedals I have had for a few years. I don’t have Simsonn pedals. Thank you for checking and appreciate the changeout.\r\nSent from my iPhone\r\n\r\nOn 31 Jul 2025, at 16:34, SIMSONN <service@simsonn.com> wrote:\r\n\r\n﻿\r\nSIMSONN<https://www.simsonn.com>\r\n\r\nHello, I noticed that you purchased the VAM Pro 3-piece kit and the Pro X Ultra control box. May I ask what pedals you are currently using? If it's not a Pro X pedal, we'll replace it with a Plus X control box and refund the difference in price as they work the same for pedals other than the Pro X. And the Pro X Ultra control box may have compatibility issues with Plus pedals.\r\nSince we don't plan to sell the Pro X Ultra Control Box separately, we don't have a packaging solution, and choosing the Plus X Control Box will make it easier for us to ship it in a package with the VAM Pro kit. And the Pro X Ultra control box may have compatibility issues with Plus pedals.\r\n\r\nIf you have any questions, reply to this email or contact us at service@simsonn.com<mailto:service@simsonn.com>\r\n\r\n\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-07-31T22:32:32Z",
  "updated_at": "2025-08-01T02:44:45Z",
  "requester_id": 158002481489,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158005917758,
      "body_text": "Hi there,\r\n\r\nThank you for the update.\r\n\r\nI have simforge pedals. I was watching sim racing corner where he was using some of the blue anadised shakers that you have on line. I am looking for three of the shakers with power supply (Australia) and a control box plus any ancillary wiring.\r\n\r\nReally appreciate the advice. Please let me know if there is any change to the cost and I will progress.\r\n\r\nRegards,\r\n\r\nPaul.\r\n________________________________\r\n",
      "user_id": 158002481489,
      "created_at": "2025-07-31T22:38:43Z",
      "updated_at": "2025-07-31T22:38:43Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005920519,
      "body_text": "Hi Paul Webb,    Okay, thank you for confirming. We will add an Australian plug for you, so please don't worry.",
      "user_id": 158001343601,
      "created_at": "2025-08-01T02:44:45Z",
      "updated_at": "2025-08-01T02:44:45Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}