{
  "id": 2269,
  "subject": "Content Collaboration & Giveaway Request – Simsonn Pedals Plus X",
  "description_text": "Dear Simsonn Team,\r\n\r\nMy name is Pierre Lorenz, and I’m a passionate Sim Racing content creator\r\non Twitch. I recently purchased the *Simsonn Pedals Plus X with VAM motors*,\r\nand I wanted to reach out directly before producing my upcoming content\r\naround this exciting new gear.\r\n\r\nOver the next few days, I’ll be creating a detailed *unboxing and review\r\nvideo*, highlighting build quality, performance, and the unique VAM motor\r\nintegration. If my experience confirms what I already suspect – that these\r\nare truly top-tier pedals – I’ll be actively recommending them to my Sim\r\nRacing community.\r\n\r\nI’ve been focusing exclusively on *Le Mans Ultimate* content for the past 8\r\nweeks, and my channel has grown quickly during that time. I currently\r\naverage *around 23 live viewers*, with a dedicated and steadily growing\r\naudience. My most recent *Le Mans Ultimate* event *peaked at over 60 live\r\nviewers* and saw *intense community interaction and chat engagement* –\r\nshowing strong momentum and a loyal following.\r\n\r\nThat’s why I’d love to ask if there’s any possibility to *receive a second\r\nset of Simsonn Pedals Plus X* to use in a *giveaway* during my next major *Le\r\nMans Ultimate* event. This would be a fantastic opportunity to reward the\r\ncommunity and present Simsonn as a brand that supports grassroots creators.\r\n\r\nTo verify my purchase, feel free to check my AliExpress order number:\r\n*3058519247337854*.\r\n\r\nI’m genuinely excited about a potential *collaboration* and hope this could\r\nbe the start of something ongoing. I would also like to mention that *Simsonn\r\nis still relatively unknown here in Germany* – so this could be a great\r\nopportunity to increase visibility in a growing market with a highly\r\nengaged audience.\r\n\r\nThank you very much for your time and consideration. I’d be happy to\r\nprovide additional stream data or insights at any time, and I look forward\r\nto your response.\r\n\r\nBest regards,\r\n*Pierre Lorenz*\r\n\r\nTwitch.tv/Chuxl90_ <www.twitch.tv/Chuxl90_>\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-08-04T07:48:05Z",
  "updated_at": "2025-08-22T09:41:07Z",
  "requester_id": 158002584139,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158006209138,
      "body_text": "​Dear Pierre, Thank you for reaching out and for choosing the Simsonn Pedals Plus X with VAM motors! We’re thrilled to hear about your upcoming review and unboxing content—it’s always inspiring to see passionate creators like yourself diving deep into the details of our products. We’d love to explore a collaboration and support your efforts to engage the sim racing community. Here’s how we can proceed: Initial Showcase & Review We’re excited to see your honest feedback on the pedals’ performance, build quality, and VAM motor integration. Your perspective will be invaluable to both our team and your audience. Once your video is live, we’d be happy to share it across our social channels to help amplify your reach (with your permission, of course). Future Collaboration & Giveaway Potential We’d love to support a giveaway for your community! To ensure this aligns with mutual goals, we propose a results-driven approach: If your review generates at least 5 confirmed orders (by our Affiliate Program), we’ll gladly provide a second set of Simsonn Pedals Plus X for your next Le Mans Ultimate event giveaway. This way, we can celebrate your audience’s engagement while also seeing tangible momentum for Simsonn in the German market. As your channel grows, we’re open to discussing ongoing sponsorships for future events or content. We’re particularly interested in supporting creators who share our commitment to innovation and community building. Share the video link with us once it’s live. We’re confident this could be the start of a great partnership. Germany is a key market for us, and your authentic enthusiasm is exactly what we value in collaborators. Looking forward to your review and the energy you’ll bring to the sim racing scene! Best regards, Simsonn Team",
      "user_id": 158001343601,
      "created_at": "2025-08-04T10:26:34Z",
      "updated_at": "2025-08-04T10:26:34Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158006225532,
      "body_text": "Dear Simsonn Team,\r\n\r\nThank you so much for your positive response – I’m truly excited about the\r\nopportunity to collaborate with you!\r\n\r\nI’ll begin working on the review and unboxing content as soon as the pedals\r\narrive, and I’ll make sure to promote the video and your brand actively\r\nacross my Twitch channel and social platforms. Once the video is live, I’ll\r\nshare the link with you immediately and would be honored if you shared it\r\non your channels as well.\r\n\r\nTo make the promotion as visually strong and consistent as possible, I’d\r\nlike to kindly ask if you could provide me with some media assets – such as\r\nyour logo, a banner, or any promotional visuals I could use during the\r\nstream (for overlays, panels, or intro screens). Having official branding\r\nwould help me represent Simsonn properly and professionally.\r\n\r\nThanks again for this opportunity. I’m looking forward to putting\r\neverything together and helping more sim racers in Germany discover your\r\ngreat products!\r\n\r\nBest regards,\r\nPierre\r\n\r\nservice@simsonn.com ",
      "user_id": 158002584139,
      "created_at": "2025-08-04T14:26:45Z",
      "updated_at": "2025-08-04T14:26:45Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006422604,
      "body_text": "Dear Simsonn Team,\r\n\r\nThank you again for the great collaboration – I truly appreciate your\r\nsupport and I’m excited to help bring more attention to Simsonn within the\r\nsim racing community.\r\n\r\nI’ve noticed that the discount code *CHUXL*, which offers 8% off, is\r\ncurrently only valid for orders over *€200*. While I understand the\r\nreasoning behind having a minimum order value, I feel this restriction\r\nlimits the effectiveness of the code – especially for my audience.\r\n\r\nMany of my viewers are beginners or hobby racers who often purchase\r\nindividual parts or accessories before committing to a full setup. For\r\nthem, the €200 minimum is a real barrier – the code becomes unusable and,\r\nunfortunately, a bit discouraging.\r\n\r\nIn fact, *two people from my community already decided not to order*, as\r\nthey only wanted to purchase the *VAM motors*, and the discount didn’t\r\napply to that amount. This shows that the current limit can block potential\r\nsales, even when there’s real interest.\r\n\r\nThat’s why I’d kindly like to request the removal of the minimum order\r\nvalue, so the *8% discount can apply to all purchases*, regardless of the\r\ntotal amount. This would make the offer much fairer and more attractive for\r\nmy audience – and likely help drive more conversions as a result.\r\n\r\nI’d really appreciate if this adjustment could be made – it would allow me\r\nto offer a more valuable benefit to my community.\r\n\r\nThank you again, and I look forward to the next steps together!\r\n\r\nBest regards,\r\n*Pierre (ChuxL90_ @ Twitch )*\r\n\r\nAm Mo., 4. Aug. 2025 um 16:26 Uhr schrieb Pierre Lorenz <\r\nlorenz.pierre1990@gmail.com>:\r\n\r\n> Dear Simsonn Team,\r\n>\r\n> Thank you so much for your positive response – I’m truly excited about the\r\n> opportunity to collaborate with you!\r\n>\r\n> I’ll begin working on the review and unboxing content as soon as the\r\n> pedals arrive, and I’ll make sure to promote the video and your brand\r\n> actively across my Twitch channel and social platforms. Once the video is\r\n> live, I’ll share the link with you immediately and would be honored if you\r\n> shared it on your channels as well.\r\n>\r\n> To make the promotion as visually strong and consistent as possible, I’d\r\n> like to kindly ask if you could provide me with some media assets – such as\r\n> your logo, a banner, or any promotional visuals I could use during the\r\n> stream (for overlays, panels, or intro screens). Having official branding\r\n> would help me represent Simsonn properly and professionally.\r\n>\r\n> Thanks again for this opportunity. I’m looking forward to putting\r\n> everything together and helping more sim racers in Germany discover your\r\n> great products!\r\n>\r\n> Best regards,\r\n> Pierre\r\n>\r\n> service@simsonn.com ",
      "user_id": 158002584139,
      "created_at": "2025-08-06T16:03:16Z",
      "updated_at": "2025-08-06T16:03:16Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006446265,
      "body_text": "Dear Pierre,   Sorry, the reason we set this threshold is because our haptic motors have very low profit margins, and discounts + commissions would cause us to lose money. That's why we set this discount threshold.   However, our haptic motors are definitely made with high-quality materials and are excellent value for money! We hope you and your community partners can understand.  Best regards, Simsonn Team ",
      "user_id": 158001343601,
      "created_at": "2025-08-07T04:00:06Z",
      "updated_at": "2025-08-07T04:00:06Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158006469056,
      "body_text": "Dear Simsonn Team,\r\n\r\nThank you again for the clear explanation – I fully understand the\r\nchallenges with profit margins, especially when it comes to your haptic\r\nmotors. I truly value your openness and completely respect your reasoning.\r\n\r\nThat said, I’d really like to offer a *meaningful discount* to my\r\ncommunity, even for those who only want to buy accessories or haptic\r\nmotors. Here’s a suggestion that might work for both sides:\r\n\r\n I’d be *happy to waive my affiliate commission* for orders that only\r\ninclude the haptic motors or accessories, so that the *8% discount can\r\nstill be applied*, without affecting your profit margins.\r\n\r\nThis way, the community still benefits from the code – even on smaller\r\npurchases – and Simsonn doesn’t lose money in the process.\r\n\r\nIf this is something we can set up technically (e.g. by tracking order\r\ntypes or using a second code), I’d be glad to help make it work.\r\n\r\nLet me know your thoughts! I’m really excited to keep building this\r\npartnership and bring your brand to more sim racers in Germany.\r\n\r\nBest regards,\r\n*Pierre (ChuxL90_)*\r\n\r\nAm Do., 7. Aug. 2025 um 06:00 Uhr schrieb service@simsonn.com <\r\nservice@simsonn.com>:\r\n\r\n> Dear Pierre,\r\n> Sorry, the reason we set this threshold is because our haptic motors have\r\n> very low profit margins, and discounts + commissions would cause us to lose\r\n> money. That's why we set this discount threshold.\r\n> However, our haptic motors are definitely made with high-quality materials\r\n> and are excellent value for money! We hope you and your community partners\r\n> can understand.\r\n> Best regards,\r\n> Simsonn Team\r\n> 2269:4206036\r\n>\r\n\r\n",
      "user_id": 158002584139,
      "created_at": "2025-08-07T09:02:23Z",
      "updated_at": "2025-08-07T09:02:23Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006477394,
      "body_text": "Dear Pierre,   Thank you for your selfless contribution to the community. We have created a new no-threshold discount code for you. However, we are unable to both track order sources and remove commissions, so we will exclude orders below $199 when settling commissions. Here is your new discount code: CHUXL90  Best regards, Simsonn Team ",
      "user_id": 158001343601,
      "created_at": "2025-08-07T10:48:36Z",
      "updated_at": "2025-08-07T10:48:36Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158006477422,
      "body_text": "This is actually the first time we have offered a discount on orders under $199. We admire and thank you for your selfless contribution to the community!",
      "user_id": 158001343601,
      "created_at": "2025-08-07T10:51:03Z",
      "updated_at": "2025-08-07T10:51:03Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158006779003,
      "body_text": "Dear Simsonn Support Team,\r\n\r\nI hope you’re doing well. My review and unboxing videos are already fully\r\nrecorded – I just need to edit them. There will be two separate videos in\r\ntotal.\r\n\r\nHowever, I’ve run into a small issue: my *1-way hydraulic cylinder* has\r\nsuddenly become stuck. It no longer moves through its full range – perhaps\r\nonly 20–30% now.\r\n\r\nFor the moment, I’ve removed the hydraulic cylinder from the gas pedal so I\r\ncan continue using the pedals in general. Could you please let me know how\r\nwe can proceed to fix or replace it?\r\n\r\nThank you in advance for your help!\r\n\r\nBest regards,\r\n*Pierre (ChuxL90_)*\r\n\r\nAm Do., 7. Aug. 2025 um 12:51 Uhr schrieb service@simsonn.com <\r\nservice@simsonn.com>:\r\n\r\n> This is actually the first time we have offered a discount on orders under\r\n> $199. We admire and thank you for your selfless contribution to the\r\n> community!\r\n> 2269:4206036\r\n>\r\n\r\n",
      "user_id": 158002584139,
      "created_at": "2025-08-12T23:06:03Z",
      "updated_at": "2025-08-12T23:06:03Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006782516,
      "body_text": "Hi Chuxl, please provide us with a video for inspection to see if there are any problems. If it is irreparable, we will send you a replacement.",
      "user_id": 158001343601,
      "created_at": "2025-08-13T02:44:18Z",
      "updated_at": "2025-08-13T02:44:18Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158006787812,
      "body_text": "Hi:\r\n\r\nOrdernumber(AliExpress) : 3058519247337854\r\nName: Pierre Lorenz\r\nPhone: +4917621648035\r\nAdress: Pierre Lorenz, Hohe Strasse 12, 56244 Hahn am See, Germany\r\n\r\nhttps://youtube.com/shorts/CsJlHIuf5Y4\r\n\r\n",
      "user_id": 158002584139,
      "created_at": "2025-08-13T05:59:13Z",
      "updated_at": "2025-08-13T05:59:13Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006837912,
      "body_text": "Dear Simsonn Support Team,\r\n\r\nI hope you’re doing well. I’ve encountered another issue with my pedals and\r\nwanted to describe it in detail.\r\n\r\nWhen no game is running, the pedals work perfectly – very precise and\r\nsmooth.\r\nHowever, as soon as I start a game like *Assetto Corsa Competizione* or *Le\r\nMans Ultimate*, the *throttle pedal starts to jitter*. You can clearly see\r\nthis in both the driver software and inside the game itself.\r\n\r\nAs soon as I close the game, the problem disappears immediately, and the\r\npedals work normally again.\r\n\r\nI’ve recorded a short video showing the exact problem:\r\nhttps://youtu.be/EvBVLLsoh6Q\r\n\r\nCould you please advise on what might be causing this and how I can resolve\r\nit?\r\n\r\nThank you very much for your help!\r\n\r\nBest regards,\r\n*Pierre (ChuxL90_)*\r\n\r\nAm Do., 14. Aug. 2025 um 04:42 Uhr schrieb General and sales enquiries <\r\nservice@simsonn.com>:\r\n\r\n> Dear, your order has been shipped. The logistics number\r\n> is:YT2522601400345849. You can track it at this website\r\n> https://www.17track.net/zh-cn.\r\n>\r\n> ------------------------------\r\n> service@simsonn.com\r\n>\r\n>\r\n> *发件人：* Pierre Lorenz <lorenz.pierre1990@gmail.com>\r\n> *发送时间：* 2025-08-13 13:58\r\n> *收件人：* service@simsonn.com\r\n> *主题：* Re: Content Collaboration & Giveaway Request – Simsonn Pedals Plus X\r\n> Hi:\r\n>\r\n> Ordernumber(AliExpress) : 3058519247337854\r\n> Name: Pierre Lorenz\r\n> Phone: +4917621648035\r\n> Adress: Pierre Lorenz, Hohe Strasse 12, 56244 Hahn am See, Germany\r\n>\r\n> https://youtube.com/shorts/CsJlHIuf5Y4\r\n>\r\n>\r\n>\r\n>\r\n\r\n",
      "user_id": 158002584139,
      "created_at": "2025-08-14T09:01:37Z",
      "updated_at": "2025-08-14T09:01:37Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006845016,
      "body_text": "Hi Chuxl,  What base are you using, Fanatec? Has the green wire from the controller been connected to any metal screw on the pedal? ",
      "user_id": 158000445778,
      "created_at": "2025-08-14T09:43:03Z",
      "updated_at": "2025-08-14T09:43:03Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158006847055,
      "body_text": "i use moza and ye i have the green wire connected between pedal& screw and\r\nthe connector\r\n\r\nAm Do., 14. Aug. 2025 um 11:43 Uhr schrieb service@simsonn.com <\r\nservice@simsonn.com>:\r\n\r\n> Hi Chuxl,\r\n>\r\n> What base are you using, Fanatec?\r\n> Has the green wire from the controller been connected to any metal screw\r\n> on the pedal?\r\n>\r\n>\r\n> ",
      "user_id": 158002584139,
      "created_at": "2025-08-14T10:03:25Z",
      "updated_at": "2025-08-14T10:03:25Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006861997,
      "body_text": "Dear Simsonn Team,\r\n\r\nI wanted to give you an update regarding the issue I experienced with the\r\nthrottle pedal signal “spiking” when launching certain games like Assetto\r\nCorsa Competizione or Le Mans Ultimate.\r\n\r\nAfter some investigation, I found that the cause was not the pedals\r\nthemselves, but electromagnetic interference (EMI) coming from my graphics\r\ncard (AMD RX 6900 XT). My GPU produces coil whine at high FPS, which in\r\nturn caused signal disturbances to the pedal sensors. The issue completely\r\ndisappeared when the GPU load was reduced, and I was able to almost\r\neliminate it by slightly undervolting the card.\r\n\r\nIn the future, I will be adding an EMI filter to my setup to ensure the\r\nsignal path remains clean. As a suggestion, it might be worth considering\r\nintegrating an EMI filter directly into the Simsonn hardware control box,\r\nor alternatively including a ferrite choke with the pedals. This could help\r\ncustomers who might encounter similar issues without having to troubleshoot\r\nextensively.\r\n\r\nThank you again for your great support and for building such high-quality\r\npedals. I’m happy to report that the pedals themselves are performing\r\nperfectly now.\r\n\r\nBest regards,\r\nPierre (Chuxl90_)\r\n\r\nAm Do., 14. Aug. 2025 um 12:03 Uhr schrieb Pierre Lorenz <\r\nlorenz.pierre1990@gmail.com>:\r\n\r\n> i use moza and ye i have the green wire connected between pedal& screw and\r\n> the connector\r\n>\r\n> Am Do., 14. Aug. 2025 um 11:43 Uhr schrieb service@simsonn.com <\r\n> service@simsonn.com>:\r\n>\r\n>> Hi Chuxl,\r\n>>\r\n>> What base are you using, Fanatec?\r\n>> Has the green wire from the controller been connected to any metal screw\r\n>> on the pedal?\r\n>>\r\n>>\r\n>> ",
      "user_id": 158002584139,
      "created_at": "2025-08-14T14:01:25Z",
      "updated_at": "2025-08-14T14:01:25Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006890397,
      "body_text": "Hi Chuxl,  We are currently testing a new main controller with added EMI protection circuitry. We will update you once testing is complete. If you encounter any issues during use, please feel free to contact us, and we will assist you. ",
      "user_id": 158000445778,
      "created_at": "2025-08-15T03:42:29Z",
      "updated_at": "2025-08-15T03:42:29Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158006905572,
      "body_text": "Dear guys,\r\n\r\nhere is my unboxing video.\r\nhttps://www.youtube.com/watch?v=ZXQffPFMOSs&t=1s\r\n\r\n\r\nmy review is coming on sunday\r\n\r\ngreets\r\n\r\nAm Fr., 15. Aug. 2025 um 05:42 Uhr schrieb service@simsonn.com <\r\nservice@simsonn.com>:\r\n\r\n> Hi Chuxl,\r\n>\r\n> We are currently testing a new main controller with added EMI protection\r\n> circuitry. We will update you once testing is complete. If you encounter\r\n> any issues during use, please feel free to contact us, and we will assist\r\n> you.\r\n>\r\n>\r\n> ",
      "user_id": 158002584139,
      "created_at": "2025-08-15T11:59:45Z",
      "updated_at": "2025-08-15T11:59:45Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006933634,
      "body_text": "Dear Simsonn Team,\r\n\r\nThank you for your quick reply and for letting me know about the new main\r\ncontroller with added EMI protection. I’m really glad to hear you’re\r\nworking on this improvement. If you ever need someone to test it in a\r\nreal-world sim racing setup, I’d be happy to help.\r\n\r\nAlso, my review and unboxing were completed earlier than expected, and I’m\r\nexcited to share the YouTube link with you:\r\nhttps://youtu.be/MfFx_shqNUs\r\n\r\nThank you again for your support and for listening to feedback from the\r\ncommunity. I’m looking forward to seeing the progress on the new controller.\r\n\r\nBest regards,\r\nPierre (Chuxl90_)\r\n\r\nAm Fr., 15. Aug. 2025 um 13:59 Uhr schrieb Pierre Lorenz <\r\nlorenz.pierre1990@gmail.com>:\r\n\r\n> Dear guys,\r\n>\r\n> here is my unboxing video.\r\n> https://www.youtube.com/watch?v=ZXQffPFMOSs&t=1s\r\n>\r\n>\r\n> my review is coming on sunday\r\n>\r\n> greets\r\n>\r\n> Am Fr., 15. Aug. 2025 um 05:42 Uhr schrieb service@simsonn.com <\r\n> service@simsonn.com>:\r\n>\r\n>> Hi Chuxl,\r\n>>\r\n>> We are currently testing a new main controller with added EMI protection\r\n>> circuitry. We will update you once testing is complete. If you encounter\r\n>> any issues during use, please feel free to contact us, and we will assist\r\n>> you.\r\n>>\r\n>>\r\n>> ",
      "user_id": 158002584139,
      "created_at": "2025-08-15T18:38:52Z",
      "updated_at": "2025-08-15T18:38:52Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}