{
  "id": 2383,
  "subject": "Re: Re: General and sales enquiries order 113-8748956-9591401",
  "description_text": "Following up - did the upgraded parts arrive yet? Still waiting for a\r\nresolution, I quit posting on social media like requested - just dusted\r\nthese off and figured before I get rid of them, will send one last email.\r\n\r\nFor reference, I never expected you to make this right, that's why I\r\nhaven't pushed or purchased more from you!\r\n\r\n\r\nThanks.\r\n\r\nRon\r\n\r\nOn Thu, Mar 6, 2025 at 1:10 AM support@simsonn.com <support@simsonn.com>\r\nwrote:\r\n\r\n> We are sorry for the inconvenience. The pedal makes noise when in use. It\r\n> is probably caused by some parts loosening during transportation. Because\r\n> each set of pedals is tested before delivery, we will send it to you only\r\n> when there is no problem. Regarding the squeaking problem of the clutch\r\n> pedal, it should be caused by the loose hydraulic rod. I have attached a\r\n> solution video for you to take a look. As for the clicking sound of the\r\n> throttle, you can provide us with a video about this problem so that we can\r\n> check which part has the problem. Then regarding damping, we have currently\r\n> developed better damping, but the factory is still in production and has\r\n> not yet delivered it to us. After delivery, we will send you the new\r\n> damping for free for trial, okay? The original damping will also be sent to\r\n> you together.\r\n>\r\n> ------------------------------\r\n> support@simsonn.com\r\n>\r\n>\r\n> *From:* Ronald Willhauck <ronald.willhauck@gmail.com>\r\n> *Date:* 2025-03-05 21:20\r\n> *To:* support@simsonn.com\r\n> *Subject:* Re: General and sales enquiries order 113-8748956-9591401\r\n> Good morning.\r\n>\r\n> There are several issues with these pedals, and with running into these\r\n> issues with them being that new I’m certain they’re only going to continue\r\n> to get worse (thinking that’s why the new pedals were released, you knew of\r\n> these issues and instead of repairing them you simply redesigned and left\r\n> the original pedal owners behind). I’m far from a serious sim racer (yet)\r\n> so the initial failure I experienced within first 2 weeks is troubling! So\r\n> far one of the red polymers split in half, clutch squeaks (tried to lube\r\n> it, nothing helps), and now the accelerator has a click when you push the\r\n> pedal at the very beginning of pedal stroke! Is this normal wear and tear\r\n> for a 4-5 hour/week user?? So what are you going to replace, the entire\r\n> setup?? If so can I pay extra and get the new version since I’m sure you\r\n> addressed issues I mentioned above in the new release? Otherwise, do what\r\n> you think is best and let me know\r\n>\r\n> On Wed, Mar 5, 2025 at 1:21 AM support@simsonn.com <support@simsonn.com>\r\n> wrote:\r\n>\r\n>> Hi ronald,\r\n>> This is Ariel, the Amazon after-sales customer service. My colleague told\r\n>> me that you want to return your product because it is broken. Could you\r\n>> please tell me where it is broken so that we can provide you with a free\r\n>> replacement? We will try our best ro solve your problem. I am sorry for all\r\n>> the inconvenience cause. And we will also be glad to issue $30 to you as a\r\n>> compensation.\r\n>>\r\n>>\r\n>> ------------------------------\r\n>> support@simsonn.com\r\n>>\r\n>\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-08-06T16:17:51Z",
  "updated_at": "2025-08-07T03:05:10Z",
  "requester_id": 158002678707,
  "responder_id": null,
  "cc_emails": [],
  "conversations": []
}