{
  "id": 2428,
  "subject": "New review (5★) of Simsonn Pro Pedals and Pro Plus Pedals Upgrade Kit (from Brian A.)",
  "description_text": "Rating: 5 | Review Text: This upgrade is awesome! Improves the feel of the pedals immensely. The new dampers really do feel more realistic, and the brake stack up is a huge improvement.\r\nWhen I first opened the package, I was a little intimidated by the number of parts included (no instructions are provided). However, once I began disassembling the pedals and looking at how all the bearings, spacers, etc. are arranged, it was easy to figure out how the new parts fit in.\r\nIt's amazing that Simsonn is selling this as an upgrade package! Totally worth the price. ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ This review was automatically published.Learn more Nice Work! You have a new 5-star review of Simsonn Pro Pedals and Pro Plus Pedals Upgrade Kit from Brian Albertalli brian.albertalli@gmail.com This review was generated by a Loox reminder email. Brian Albertalli Display name: Brian A. This upgrade is awesome! Improves the feel of the pedals immensely. The new dampers really do feel more realistic, and the brake stack up is a huge improvement.\r\nWhen I first opened the package, I was a little intimidated by the number of parts included (no instructions are provided). However, once I began disassembling the pedals and looking at how all the bearings, spacers, etc. are arranged, it was easy to figure out how the new parts fit in.\r\nIt's amazing that Simsonn is selling this as an upgrade package! Totally worth the price. View, Reply or Share Customize for social Unpublish review This email is sent for 0a6bb1.myshopify.com Unsubscribe \r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-08-07T17:04:38Z",
  "updated_at": "2025-08-08T01:45:40Z",
  "requester_id": 158000954852,
  "responder_id": null,
  "cc_emails": [],
  "conversations": []
}