{
  "id": 2469,
  "subject": "Simsonn x Sim it studios collaboration proposal",
  "description_text": "Hey guys!\r\n\r\n\r\nJust wanted to stop by and say hi, i have been running over both your\r\ncontent and words a out your pedals over the last few months and I am very\r\nintrigued. I’ll give you some backstory on me first tho. I have already\r\nbeen in contact with you guys on instagram but you stopped answering so\r\nthought i'd reach out again here.\r\n\r\n\r\nMy name is Alex, and I am a 37 year old filmmaker living in Sweden and the\r\nNetherlands. My job is in other worlds to create content and videos for\r\norganizations and brands. I also run a YouTube channel in the filmmaking\r\nspace with about 39k subscribers. In January this year I got into sim\r\nracing via a collaboration , and turns out, it is not just incredibly fun.\r\nIt is also very nice to create reviews and content on. My YouTube has\r\nalready grown to about 3000 subscribers, 159 discord users, an official\r\nesports team with liveries and all and Instagram is growing.\r\n\r\n\r\nSo, my question, or proposal is easy. I have tested the heusinkveld,\r\nsimagic p2000 and simucube active pedals amongst others and are working on\r\nreviews.\r\n\r\n\r\nHowever, I have heard from multiple users now that you pedals with haptics\r\non beat a lot of the bigger brands so I would love to try yours, reviews\r\nand create some reels of them. Here you can see a small reel undid for the\r\nactive pedal, so you can kind of see the quality of content.\r\n\r\n\r\nWould it be interesting for you to provide me with pedals and haptics for a\r\nlong form video review where I compare to bigger brands, share buying\r\nlinks, and then also provide you with some reels etc? I am still growing\r\nand I am not asking for any money, only that I get to keep the pedals. One\r\nthing that cube did was to send an extra wheel as a giveaway which gave\r\nthem a lot of new followers and recognition .\r\n\r\n\r\nA recent review is linked below so you can get a sense of my production\r\nquality and tone.\r\n\r\nLatest review:\r\n▶️ https://youtu.be/nQ8HKE31WQI\r\n\r\nMy channels:\r\n? Main YouTube (Filmmaking): https://www.youtube.com/@AlexReinholdsson\r\n? Sim Racing Channel: https://www.youtube.com/@SimItStudios\r\n? Instagram: https://www.instagram.com/simitstudio\r\n\r\nWould love to hear your thoughts — is this something that might be\r\ninteresting for you?\r\n\r\nBest regards,\r\nAlex\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-08-08T13:15:18Z",
  "updated_at": "2025-08-22T09:32:10Z",
  "requester_id": 158002826145,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158006737940,
      "body_text": "Hi Alexander Reinholdsson,    Thank you for your recognition. Your video quality is really high. We will send you a set of Plus X pedals and Haptics. Please choose the model you want.  https://www.simsonn.com/products/simsonn-pro-plus-x-pedals",
      "user_id": 158001343601,
      "created_at": "2025-08-12T09:37:41Z",
      "updated_at": "2025-08-12T09:37:41Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158006738002,
      "body_text": "Hi!\r\n\r\nThanks for getting back to me, what are the main differences with the plus and pro cause I have people asking me about the pro pedals and how they work, I have had zero interest from people in the plus pedals, i don’t know why. \r\n\r\nBut from a views perspective and reach, I think the plus would be a lot more engaging from my audience. \r\n\r\nAlso, what is the difference between the two different haptics?\r\n\r\nThanks for answering.\r\n\r\nMed vänlig hälsning\r\nAlex Reinholdsson \r\n+46(0)738 - 24 33 88\r\n\r\n> 12 aug. 2025 kl. 11:37 skrev service@simsonn.com:\r\n> \r\n> ﻿\r\n> Hi Alexander Reinholdsson,\r\n> \r\n> Thank you for your recognition. Your video quality is really high. We will send you a set of Plus X pedals and Haptics. Please choose the model you want.\r\n> https://www.simsonn.com/products/simsonn-pro-plus-x-pedals\r\n> ",
      "user_id": 158002826145,
      "created_at": "2025-08-12T09:48:30Z",
      "updated_at": "2025-08-12T09:48:30Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006743744,
      "body_text": "Hi Alexander Reinholdsson,  Pro X Ultra and Plus X are our two latest pedal models. Pro X Ultra is equipped with an adjustable hydraulic lever and is designed for experienced professional riders. The pedal features a lighting system that provides feedback based on game telemetry data, with more sophisticated lighting effects and styling. If these features are not required, the Plus We have below a rough description of the upgrade points we have made to the pedal, and hopefully it will provide you with some ideas for your review shoot. One of the most important upgrades is the braking system. We've introduced a completely redesigned elastomer unit: the red, yellow and blue elastomers have durometer ratings of 60, 70 and 80HA respectively, and have recommended maximum force limits of 60kg, 100kg and 140kg respectively, although in practice they're capable of withstanding much higher forces. The blue elastomers are fully capable of withstanding 200kg. A wide selection of shims are available, allowing up to 128 different combinations with the elastomers to fine-tune pedal stiffness. When it comes to the hydraulic cushioning system, we've moved away from our previous misguided use of air springs (which weren't ideal) and are now using a completely redesigned hydraulic rod. You can elaborate on what it's like to use this hydraulic cushioning system. The throttle uses a one-way hydraulic lever, and the clutch and brakes use a two-way hydraulic lever. The bi-directional lever has the same hydraulic cushioning feeling back and forth, while the uni-directional lever has a hydraulic cushioning when pressed, but the rebound is smooth. This design is to prevent the hydraulic lever from affecting the throttle rebound speed. Limit sleeve we also upgraded, we use a softer material, hard pedal to the end will not have a strong sense of frustration. The new control box is made of metal with a closed design, which enhances the anti-jamming ability and adds a Rumble Motor hole to support Simsonn's original Rumble Motor. Plus X pedals come with the official SIMSONN Manager software, so there's no need to manually upgrade the hardware. SIMSONN Manager supports the latest Rumble Motor adjustments and currently supports 8 types of telemetry for vibration feedback and corresponding data adjustments. We have also upgraded the limit sleeve, using a softer material so that there is no strong jolt or noise when pressing down hard. The new control box is made of metal with a closed design, enhancing its EMI interference resistance, and adding a Rumble Motor hole to support Simsonn's original haptics. SIMSONN Manager supports haptics calibration, currently offering 8 vibration feedback telemetry modes and corresponding data adjustments. However, the number of supported games is limited. If needed, we can provide you with the supported game list. For unsupported games, you can use Simhub. Regarding the difference in haptics, the Vam Pro uses a linear motor, while the Vam uses a rumble motor, and their operating principles are different. You can find more information online about their specific differences.",
      "user_id": 158001343601,
      "created_at": "2025-08-12T11:00:35Z",
      "updated_at": "2025-08-12T11:00:35Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158006743783,
      "body_text": "Hi!\r\n\r\nSo based on the email and the help inhale from various riders during my reviews and the fact that my raceteam have some riders with 5-9k in irating. I would say that the pro pedals is the ones I should use. Since I am letting pro drivers use the pedals as well.\r\n\r\nAlso the fact that I have had people asking me about the pro pedals.  Or if you want to send one of each and I do a giveaway for the plus pedals? Looking at the cost for you I don’t think it would matter to much if you send the plus or pro? But the value for the video would be higher.\r\n\r\nI will look again if I find the info I wanted in the haptics, was a bit unclear on the website. \r\n\r\nI will be spending about 25-40 hours in creating content, reels and a review for this project. Also carry that in mind. So maybe content on both is even more precious for you? A video comparing the two steps for people so the my know which one to choose? \r\n\r\nMed vänlig hälsning\r\nAlex Reinholdsson \r\n+46(0)738 - 24 33 88\r\n\r\n> 12 aug. 2025 kl. 13:00 skrev service@simsonn.com:\r\n> \r\n> ﻿\r\n> Hi Alexander Reinholdsson,\r\n> \r\n> Pro X Ultra and Plus X are our two latest pedal models. Pro X Ultra is equipped with an adjustable hydraulic lever and is designed for experienced professional riders. The pedal features a lighting system that provides feedback based on game telemetry data, with more sophisticated lighting effects and styling. If these features are not required, the Plus\r\n> We have below a rough description of the upgrade points we have made to the pedal, and hopefully it will provide you with some ideas for your review shoot.\r\n> One of the most important upgrades is the braking system. We've introduced a completely redesigned elastomer unit: the red, yellow and blue elastomers have durometer ratings of 60, 70 and 80HA respectively, and have recommended maximum force limits of 60kg, 100kg and 140kg respectively, although in practice they're capable of withstanding much higher forces. The blue elastomers are fully capable of withstanding 200kg. A wide selection of shims are available, allowing up to 128 different combinations with the elastomers to fine-tune pedal stiffness.\r\n> When it comes to the hydraulic cushioning system, we've moved away from our previous misguided use of air springs (which weren't ideal) and are now using a completely redesigned hydraulic rod.\r\n> You can elaborate on what it's like to use this hydraulic cushioning system. The throttle uses a one-way hydraulic lever, and the clutch and brakes use a two-way hydraulic lever. The bi-directional lever has the same hydraulic cushioning feeling back and forth, while the uni-directional lever has a hydraulic cushioning when pressed, but the rebound is smooth. This design is to prevent the hydraulic lever from affecting the throttle rebound speed. Limit sleeve we also upgraded, we use a softer material, hard pedal to the end will not have a strong sense of frustration. The new control box is made of metal with a closed design, which enhances the anti-jamming ability and adds a Rumble Motor hole to support Simsonn's original Rumble Motor. Plus X pedals come with the official SIMSONN Manager software, so there's no need to manually upgrade the hardware. SIMSONN Manager supports the latest Rumble Motor adjustments and currently supports 8 types of telemetry for vibration feedback and corresponding data adjustments.\r\n> We have also upgraded the limit sleeve, using a softer material so that there is no strong jolt or noise when pressing down hard. The new control box is made of metal with a closed design, enhancing its EMI interference resistance, and adding a Rumble Motor hole to support Simsonn's original haptics. SIMSONN Manager supports haptics calibration, currently offering 8 vibration feedback telemetry modes and corresponding data adjustments. However, the number of supported games is limited. If needed, we can provide you with the supported game list. For unsupported games, you can use Simhub. Regarding the difference in haptics, the Vam Pro uses a linear motor, while the Vam uses a rumble motor, and their operating principles are different. You can find more information online about their specific differences.\r\n> \r\n> \r\n> 2469:4206036\r\n\r\n",
      "user_id": 158002826145,
      "created_at": "2025-08-12T11:09:20Z",
      "updated_at": "2025-08-12T11:09:20Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006744107,
      "body_text": "Hi!\r\n\r\nThen you will have several videos and also reels and images for social media ??\r\n\r\nOkay perfect with the vam pro!\r\n\r\nSo you will send one set of each with clutch, brake, throttle, haptics and baseplate.\r\n\r\nOr one set of haptics that I switch over?:)\r\n\r\nMed vänlig hälsning\r\nAlex Reinholdsson \r\n+46(0)738 - 24 33 88\r\n\r\n> 12 aug. 2025 kl. 13:44 skrev General and sales enquiries ",
      "user_id": 158002826145,
      "created_at": "2025-08-12T11:50:44Z",
      "updated_at": "2025-08-12T11:50:44Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006744173,
      "body_text": "Silver will be peefect, also a nice way to separate the plus and pro pedals!\r\n\r\nI want the vam pro, will you be sending a wam kit for each pedal set? Or do I switch them over?\r\n\r\nMed vänlig hälsning\r\nAlex Reinholdsson \r\n+46(0)738 - 24 33 88\r\n\r\n> 12 aug. 2025 kl. 13:54 skrev General and sales enquiries ",
      "user_id": 158002826145,
      "created_at": "2025-08-12T11:57:26Z",
      "updated_at": "2025-08-12T11:57:26Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006744207,
      "body_text": "Yes of course!\r\n\r\nI will create a lot of good content for you on both pedals??\r\n\r\nWant my shipping info?\r\n\r\nMed vänlig hälsning\r\nAlex Reinholdsson \r\n+46(0)738 - 24 33 88\r\n\r\n> 12 aug. 2025 kl. 13:59 skrev General and sales enquiries ",
      "user_id": 158002826145,
      "created_at": "2025-08-12T12:01:45Z",
      "updated_at": "2025-08-12T12:01:45Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158006744349,
      "body_text": "Perfect!\r\n\r\nAlexander Reinholdsson \r\nNachtegaalstraat 2\r\nApartment 410\r\n8011BV Zwolle\r\nThe Netherlands \r\n+31619783969\r\n\r\n\r\nCan you ship to a service point for pickup?:)\r\n\r\nMed vänlig hälsning\r\nAlex Reinholdsson \r\n+46(0)738 - 24 33 88\r\n\r\n> 12 aug. 2025 kl. 14:02 skrev General and sales enquiries ",
      "user_id": 158002826145,
      "created_at": "2025-08-12T12:11:44Z",
      "updated_at": "2025-08-12T12:11:44Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}