{
  "id": 24,
  "subject": "EU customer",
  "description_text": "Hi\r\n\r\nI am from europe. I have been following your products for some time. I am\r\ninterested in some things.\r\n\r\nDo you have a warehouse in the EU? or are you planning to have?\r\nBecause it would make it easier for us customers from the EU to shop\r\nbecause of VAT and thus avoid possible complications with customs and a\r\nlong wait for customs to do their job and for the products to be delivered\r\nto us.\r\n\r\nI see you don't have a Discord page yet?\r\nThat would be useful, because this way we customers can easily connect and\r\nsolve possible problems more easily, as well as solving various questions,\r\nwith of course the professional supervision of one of the Simsonn experts.\r\n\r\nIgor\r\n\r\n",
  "status": 3,
  "priority": 3,
  "created_at": "2025-06-03T23:42:12Z",
  "updated_at": "2025-06-17T03:16:07Z",
  "requester_id": 158000954854,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158002319896,
      "body_text": "if you have a warehouse in Germany then it would be desirable to have VAT\r\ncalculated for each EU country right away. that way you will start selling\r\nbetter in the EU faster.\r\nPersonally I am on Fanatec V3 pedals and I want to upgrade. but since I am\r\nused to ffb on pedals and riding like that, that is why your new VAM system\r\nis interesting to me, as well as the pedals of course.\r\nI am only a Discord user, and since I have a VRS 20nm wheel, I am regularly\r\npresent on their Discord, and if I notice that someone needs help I suggest\r\nit. because I am quite engineering-minded, so I made some innovations on\r\nthe wheel myself. but I do not have any organizational influence on the\r\nDiscord groups. that requires a lot of effort that no one is willing to pay\r\nfor.\r\nDiscord is quite important to you if you are seriously thinking of starting\r\nout in that sim racing world. so my advice is to pay someone to run the\r\nDiscord group, or to be there as technical support. Once upon a time when I\r\nwas considering Moza products, I was also on their Discord group and there\r\nwas a guy who was paid for technical support and it all works very well.\r\nthe man was very dedicated to the job and the users were extremely\r\nsatisfied. I haven't been on Moza discord for a long time because I don't\r\nuse their equipment, so I can't confirm if this is still the case with\r\nthem. but it is certainly a good recipe for successful support. because\r\nmany of them do not understand how to use sim racing equipment, even the\r\nmost banal things to adjust, because many do not even read the instructions\r\nor do not understand them even when they read them.\r\n\r\nned, 1. lip 2025. u 19:15 General and sales enquiries ",
      "user_id": 158000954854,
      "created_at": "2025-06-03T23:42:58Z",
      "updated_at": "2025-06-03T23:42:58Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158002439346,
      "body_text": "Hi igo fanatic,  Our PlusX products will arrive at our Hamburg, Germany warehouse in the next few days, and orders within Europe will start shipping from there. By the way, do you have an idea of the typical cost to maintain a Discord community? And how is MOZA currently managing their community operations? ",
      "user_id": 158000445778,
      "created_at": "2025-06-05T07:29:50Z",
      "updated_at": "2025-06-05T07:29:50Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158002854665,
      "body_text": "sorry I didn't answer, I was on a trip.\r\n\r\nI don't know how much others pay for discord maintenance. In my opinion, a\r\nrealistic price for someone to follow discord and commit to it when it\r\narrives would be €1000 per month. Personally, I would never do it for less.\r\n\r\nAbout MOZA now zero info, as I said, because I haven't taken their products\r\nand I'm not interested in them in the future.\r\n\r\nčet, 5. lip 2025. u 09:30 service@simsonn.com ",
      "user_id": 158000954854,
      "created_at": "2025-06-09T12:44:57Z",
      "updated_at": "2025-06-09T12:44:57Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158003041940,
      "body_text": "Hi igo fanatic,  If we were to collaborate on Discord, what would be your estimated fee for maintaining support for the SIMSONN brand? ",
      "user_id": 158000445778,
      "created_at": "2025-06-14T03:25:57Z",
      "updated_at": "2025-06-14T03:25:57Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158003103622,
      "body_text": "Hi\r\n\r\nIn order to do it properly, you would have to send me the equipment you\r\nhave, so that I can test it, drive races, see the technical specifications,\r\nand of course if we were to continue the cooperation later with each new\r\nproduct, I would have to do the testing and have it available, so that I\r\ncould be adequately prepared and give advice to people who have problems.\r\nWould also have to familiarize with the app that supports the hardware in\r\ndetail. because most of the user's questions are related to software.\r\n\r\nThe products you would send me would remain in my ownership, and the\r\nmonthly fee for being present on discord would be €1200.\r\nI would try to be on discord as much as possible, because I work from home,\r\notherwise it's my job. And it's not a problem for me to follow what needs\r\nto be helped from the side on discord. Of course I would also be away from\r\nhome, but considering the time in the EU, I would try to help when I arrive\r\nand when I am not at home.\r\n\r\nWould add something. I don't have a classic rig. Have a desktop rig. But\r\neverything is fixed to the table and to the floor. I have a top-notch chair\r\non wheels, but I also have a stop behind the wheels that is screwed into\r\nthe floor. That my experience could potentially also be useful to some\r\nusers who may not dare to buy this kind of equipment, because they think\r\nthey can't install it on their table.\r\nI also do 3D printing, privately. So design various objects in 3D program\r\nand print what need. Have some things printed in 3D for sim equipment that\r\nused before, but also now at the moment.\r\n\r\nOtherwise, I am very long in the sim racing world. let's say that I started\r\nmore seriously some 20 years ago with the rfactor1 game, on Logitech G27. I\r\nhave developed into a fast driver over the years and I always try to be\r\namong fast drivers. so I also have a lot of experience as a quality sim\r\ndriver. Of course, with so many years I have learned a bit about physics,\r\nand especially in games where telemetry can be used with motec, I also like\r\nto be detailed about it.\r\nIn general, I am full of experience and knowledge in general about sim\r\nracing.\r\n\r\nsub, 14. lip 2025. u 05:26 service@simsonn.com ",
      "user_id": 158000954854,
      "created_at": "2025-06-14T11:52:24Z",
      "updated_at": "2025-06-14T11:52:24Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}