{
  "id": 2674,
  "subject": "New review (4★) of Simsonn Plus X Racing Simulation Pedal with Haptic Reactor (from Bram V.)",
  "description_text": "Rating: 4 | Review Text: Great loadcell pedals, they look and feel very nice. Tons of tune options wich makes it great for different racingseries.\r\nFound out that my simrig can't handle the brake force being needed to get a realistisc feel really well, but i have an entry level rig so that has not really something to do with the pedals.\r\nOnly 2 negative points i found were that al the pedals have a little bit of horizontal play in them, not really a big problem while driving, but big enough to notice while setting the pedals up and finetuning.\r\nAnd the pedals didn't fit on my rig as its supposed to, they were to wide, so i had to get creative. but again, i think thats more a problem from my rig than from the pedals, but maybe some more installation holes would be great!\r\nBesides that, i'm really happy with them and already seeing some improvement on my laptimes! Super happy with them, also when looking at the price! Thank you! ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ This review was automatically published.Learn more Congrats! You have a new 4-star review of Simsonn Plus X Racing Simulation Pedal with Haptic Reactor from Bram Van Keeken Bcvankeeken@gmail.com Bram Van Keeken Display name: Bram V. Great loadcell pedals, they look and feel very nice. Tons of tune options wich makes it great for different racingseries.\r\nFound out that my simrig can't handle the brake force being needed to get a realistisc feel really well, but i have an entry level rig so that has not really something to do with the pedals.\r\nOnly 2 negative points i found were that al the pedals have a little bit of horizontal play in them, not really a big problem while driving, but big enough to notice while setting the pedals up and finetuning.\r\nAnd the pedals didn't fit on my rig as its supposed to, they were to wide, so i had to get creative. but again, i think thats more a problem from my rig than from the pedals, but maybe some more installation holes would be great!\r\nBesides that, i'm really happy with them and already seeing some improvement on my laptimes! Super happy with them, also when looking at the price! Thank you! View, Reply or Share Customize for social Unpublish review This email is sent for 0a6bb1.myshopify.com Unsubscribe \r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-08-14T11:08:42Z",
  "updated_at": "2025-08-15T01:31:32Z",
  "requester_id": 158000954852,
  "responder_id": null,
  "cc_emails": [],
  "conversations": []
}