{
  "id": 281,
  "subject": "Clutch Pedal",
  "description_text": "Dear Simsoon Support Team,\r\n\r\nI recently purchased the *Simsoon Plus X *(throttle and brake) and I’m very\r\nsatisfied with the product so far.\r\n\r\nHowever, I would now like to expand my setup by adding a *clutch pedal*,\r\nbut I couldn’t find an option to purchase the clutch module *separately* –\r\nneither on your website nor through third-party retailers.\r\n\r\nBefore considering the option of selling my current 2-pedal set (which I\r\nbought at a good price), just to purchase the full 3-pedal version again, I\r\nwanted to ask:\r\n\r\n*Is it possible to purchase the clutch pedal separately* and integrate it\r\ninto my existing Simsoon Plus X setup?\r\n\r\nIf so:\r\n\r\n   - What would the price be?\r\n   - Is it available from an *EU warehouse* or only directly from you?\r\n   - Would it come with any required cables or accessories?\r\n\r\nThank you in advance for your help, and keep up the great work – your pedal\r\nset is truly impressive!\r\n\r\nBest regards,\r\n*Marcel Rosenberg*\r\n------------------------------\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-06-08T23:06:38Z",
  "updated_at": "2025-06-09T11:00:39Z",
  "requester_id": 158001343055,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158002849452,
      "body_text": "Dear Marcel,  Thank you so much for your kind message and for your support of the Simsoon Plus X pedals – we’re really glad to hear you're enjoying them!  Regarding your request: We haven’t yet listed the new clutch pedal module for the Plus X series as a standalone product, but I will make it available for you tomorrow. The expected price will be $79 USD.  At the moment, our EU warehouse does not yet have stock of the new Plus X components, so the clutch pedal would be shipped directly from our main warehouse in China. Rest assured, all necessary cables and accessories will be included.  Thanks again for your great feedback – it truly means a lot to us!  Best regards, Simsoon Support Team",
      "user_id": 158001343601,
      "created_at": "2025-06-09T10:27:57Z",
      "updated_at": "2025-06-09T10:27:57Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158002851694,
      "body_text": "Hi, Simsoon Support Team\r\n\r\nThanks for confirming that the clutch pedal can be purchased separately.\r\n\r\nI just wanted to check because I don’t have a shifter yet and can’t really\r\nuse the clutch properly right now. I’m just gathering info so I know what’s\r\npossible for the future.\r\n\r\nI’m not buying it now, but I’ll get back to you once I have all my\r\nequipement ready, like the shifter and everything.\r\n\r\nAppreciate your help!\r\n\r\nBest Regards,\r\n\r\nMarcel Rosenberg\r\n\r\n\r\nservice@simsonn.com ",
      "user_id": 158001343055,
      "created_at": "2025-06-09T10:56:05Z",
      "updated_at": "2025-06-09T10:56:05Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}