{
  "id": 2849,
  "subject": "New review (5★) of Sprung (from Felipe M.)",
  "description_text": "Rating: 5 | Review Text: This is best spring you guys have for the brakes, it’s so easy to modulate the brakes with that, specially those last 5% before you are completely off the brake, that should be the spring you guys put in all the brake pedals, honestly, the other ones are horrible, the one that came in the brake pedals and the one on the upgrade kit, you can’t even compare that. ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ This review was automatically published.Learn more Good Job! You have a new 5-star review of Sprung from Felipe Morais felipe7morais@icloud.com This review was generated by a Loox reminder email. Felipe Morais Display name: Felipe M. This is best spring you guys have for the brakes, it’s so easy to modulate the brakes with that, specially those last 5% before you are completely off the brake, that should be the spring you guys put in all the brake pedals, honestly, the other ones are horrible, the one that came in the brake pedals and the one on the upgrade kit, you can’t even compare that. View, Reply or Share Customize for social Unpublish review This email is sent for 0a6bb1.myshopify.com Unsubscribe \r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-08-19T00:22:01Z",
  "updated_at": "2025-08-19T04:05:25Z",
  "requester_id": 158000954852,
  "responder_id": 158000445778,
  "cc_emails": [
    "felipe7morais@icloud.com"
  ],
  "conversations": [
    {
      "id": 158007111725,
      "body_text": "Hi Felipe M ,     Please provide a photo of the installed spring for our reference, and we will evaluate it. ",
      "user_id": 158000445778,
      "created_at": "2025-08-19T04:05:25Z",
      "updated_at": "2025-08-19T04:05:25Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}