{
  "id": 2894,
  "subject": "New review (1★) of Simsonn VAM Pro Linear Motor - the Pedals Haptic Reactor for Vibration Feedback (from Shane C.)",
  "description_text": "Rating: 1 | Review Text: Ordered these and the Plus X pedals combo back on July 18, 2025. Finally received these from China on August 6, 2025. Installed them shortly after and already had to submit a ticket on August 8th because every time the haptic was triggered while iRacing my brake have false input. The only way to resolve this false input is to set the haptic volume (how aggressive it vibrates) to 51% or more. That is extremely aggressive and shakes my house down. Anything below and it continues with the false reading. I’ve trouble shot out the wazoo and have been getting the runaround from support that it’s an EMI issue to which I’ve checked continuity and the grounding is connected. Really disappointing as these haptics are why I chose Simsonn and they will end up being the reason I request a return. ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ This review was automatically published.Learn more You have a new 1-star review of Simsonn VAM Pro Linear Motor - the Pedals Haptic Reactor for Vibration Feedback from Shane Clore sclore91@gmail.com This review was generated by a Loox reminder email. Shane Clore Display name: Shane C. Ordered these and the Plus X pedals combo back on July 18, 2025. Finally received these from China on August 6, 2025. Installed them shortly after and already had to submit a ticket on August 8th because every time the haptic was triggered while iRacing my brake have false input. The only way to resolve this false input is to set the haptic volume (how aggressive it vibrates) to 51% or more. That is extremely aggressive and shakes my house down. Anything below and it continues with the false reading. I’ve trouble shot out the wazoo and have been getting the runaround from support that it’s an EMI issue to which I’ve checked continuity and the grounding is connected. Really disappointing as these haptics are why I chose Simsonn and they will end up being the reason I request a return. View, Reply or Share Unpublish review This email is sent for 0a6bb1.myshopify.com Unsubscribe \r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-08-20T01:54:54Z",
  "updated_at": "2025-08-20T02:25:48Z",
  "requester_id": 158000954852,
  "responder_id": null,
  "cc_emails": [],
  "conversations": []
}