{
  "id": 3010,
  "subject": "New review (3★) of Simsonn Plus X Racing Simulation Pedal with Haptic Reactor (from Jacob H.)",
  "description_text": "Rating: 3 | Review Text: Its got potential to be pretty great but it's not there yet. \r\n\r\nThe haptics need a whole package reset, the wire comes out from a terrible bottom spot instead of the top. \r\n\r\nEven with the grounding wire straight to unpainted metal on the brake there is still a significant EMI issue, should have a higher quality set of shielded cords for every slot as standard.\r\n\r\nNeed to include a rubber seat/sheet of some kind to put between the haptic motors and the brackets to isolate vibration so it doesnt activate the loadcell feom vibration instead of force.\r\n\r\nThe screw heads and threads for connecting haptic brackets are small and weak and easily strip out as opposed to all the sturdy ones used for the rest of the set. ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ This review was automatically published.Learn more You have a new 3-star review of Simsonn Plus X Racing Simulation Pedal with Haptic Reactor from Jacob Harris lordralh3@gmail.com This review was generated by a Loox reminder email. Jacob Harris Display name: Jacob H. Its got potential to be pretty great but it's not there yet. \r\n\r\nThe haptics need a whole package reset, the wire comes out from a terrible bottom spot instead of the top. \r\n\r\nEven with the grounding wire straight to unpainted metal on the brake there is still a significant EMI issue, should have a higher quality set of shielded cords for every slot as standard.\r\n\r\nNeed to include a rubber seat/sheet of some kind to put between the haptic motors and the brackets to isolate vibration so it doesnt activate the loadcell feom vibration instead of force.\r\n\r\nThe screw heads and threads for connecting haptic brackets are small and weak and easily strip out as opposed to all the sturdy ones used for the rest of the set. View, Reply or Share Unpublish review This email is sent for 0a6bb1.myshopify.com Unsubscribe \r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-08-23T01:23:55Z",
  "updated_at": "2025-08-25T03:37:50Z",
  "requester_id": 158000954852,
  "responder_id": 158000445778,
  "cc_emails": [
    "lordralh3@gmail.com"
  ],
  "conversations": [
    {
      "id": 158007441037,
      "body_text": "Hi Jacob H     The bracket at the cable outlet has been designed with a notch, and we also include small accessories to secure the cables. This ensures that the wiring between the pedals and the motor looks neat and tidy. Since the top area has a logo, routing the cable from the top would affect the overall appearance.  For motor installation, we now provide additional nylon screws, insulating washers, as well as metal screws and washers, allowing customers to resolve EMI interference issues more effectively.  At the same time, we have started upgrading to the PlusX V2 control box, which provides an excellent solution to EMI issues and makes operation more convenient.  Regarding the screw stripping issue you mentioned, we will re-evaluate the suppliers of the included screws and wrenches, and upgrade to higher-quality accessories.  Once again, thank you for your valuable feedback — it is greatly helpful for us in continuously improving our products.",
      "user_id": 158000445778,
      "created_at": "2025-08-25T03:37:50Z",
      "updated_at": "2025-08-25T03:37:50Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}