{
  "id": 3145,
  "subject": "Partnership Opportunity with Simsonn",
  "description_text": "﻿\r\nDear Simsonn Team,\r\n\r\n\r\n\r\nMy name is Joshua, and I am a content creator focused on sim racing and immersive driving setups. I’ve been following Simsonn’s products and the unique value you bring to the sim racing community, and I would love to explore a potential partnership with your brand. \r\n\r\nThrough my platform, on YouTube where I create engaging content for an audience of 3,000 dedicated sim racing enthusiasts, I believe a collaboration between Simsonn and my channel could provide strong exposure and mutual value.\r\n\r\n\r\n\r\n\r\nI would be happy to share audience insights, growth metrics, and ideas for creative integration of Simsonn’s products into my content. Please let me know if your team is open to discussing partnership opportunities.\r\n\r\n\r\n\r\nThank you for your time and consideration — I look forward to the possibility of working together.\r\n\r\n\r\n\r\nBest regards,\r\n\r\nJoshua Perez \r\n\r\nFuelforgedgaming and, Fuelforgedmotorsports Fuelforgedgaming@icloud.com\r\n\r\n\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-08-26T17:52:49Z",
  "updated_at": "2025-08-28T06:25:36Z",
  "requester_id": 158003611185,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158007618118,
      "body_text": "Hi Joshua Perez,    Thank you for contacting us. Please provide your channel link, and we shall submit it to our manager for approval. We look forward to working with you!",
      "user_id": 158001343601,
      "created_at": "2025-08-27T10:00:55Z",
      "updated_at": "2025-08-27T10:00:55Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158007630805,
      "body_text": "Thank you for this potential opportunity. Here is my channel as you requested Fuel forged gaming youtube.com Joshua Perez ",
      "user_id": 158003611185,
      "created_at": "2025-08-27T14:18:08Z",
      "updated_at": "2025-08-27T14:18:08Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}