{
  "id": 3255,
  "subject": "Black Friday Discounts on Plus X Pedals",
  "description_text": "Dear Simsonn Team,\r\n\r\nThank you very much for taking the time to read my email and I hope this\r\nfind you in good health and happiness.\r\n\r\nI’ve been looking all over the internet for a set of high quality pedals at\r\na affordable price and I have kept hearing a lot of great things about your\r\nPlus X pedals they sound like the absolute top of the line for sim racing,\r\nand I’m really interested in getting them. However, even after the many\r\namazing deals you have to offer the summer season has left me in a less\r\nthan desirable position to be able to afford the set.\r\n\r\nI’m planning ahead for November Black Friday and I wanted to write to the\r\nteam to see if you let me know if you’ll be offering any Black Friday\r\ndiscounts or deals on the Plus X pedals (or other products)? It would\r\nreally help me on my thought budget and make sure I don’t miss out.\r\n\r\nThanks a lot for your time, I really appreciate it and look forward to\r\nhopefully joining the Simsonn community soon!\r\n\r\nBest regards,\r\n\r\nRobert Cristian\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-08-29T16:31:44Z",
  "updated_at": "2025-08-30T10:54:51Z",
  "requester_id": 158003854763,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158007802349,
      "body_text": "Hi SJ,      Yes, we will be running Black Friday promotions and discounts. However, if you'd like to join us early, we can provide you with an exclusive discount code equivalent to our Black Friday offer.",
      "user_id": 158001343601,
      "created_at": "2025-08-30T03:29:08Z",
      "updated_at": "2025-08-30T03:29:08Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158007807444,
      "body_text": "Hi,\r\n\r\nThank you so much for the opportunity and to even take the time to read my\r\nemail means a lot to me, many other companies would have brushed it under\r\nthe rug and left me on read. However, you have showed true respect and\r\ncompassion for the sim racing community not by just being able to provide\r\nthe average person with a set of pedals rivalling some of the best but also\r\nshowing amazing support not only for me but for others as well.\r\n\r\nI will be sure to post a personal review on multiple sites and platforms to\r\nshow the world how much the company cares about the community they are part\r\nof. I will try to not send everyone to you for free stuff but if it does\r\nI’m sorry.\r\n\r\nThanks so much once again for the opportunity and I am definitely looking\r\nforward to my set of pedals and will definitely get the haptic system as\r\nwell when I have the money.\r\n\r\nOn Sat, 30 Aug 2025 at 04:29, service@simsonn.com ",
      "user_id": 158003854763,
      "created_at": "2025-08-30T10:38:44Z",
      "updated_at": "2025-08-30T10:38:44Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158007807637,
      "body_text": "Hi SJ,     Thank you so much for your kind words — it truly means a lot to us. At Simsonn, our goal has always been to create high-quality gear for sim racers while also supporting the community that makes this sport so special. Reading your message confirms that we’re moving in the right direction, and we couldn’t be happier to have you with us on this journey.  We really appreciate your willingness to share your experience and spread the word about Simsonn. Support like yours helps us grow and continue bringing new innovations to sim racing.  We understand your situation, and assisting you aligns with our mission. Our goal is to help every racer immerse themselves in reliable, realistic driving adventures—without overspending.  You can use this discount code: Black45 for an instant $45 off orders over $219.  Thanks again for your recognition and praise — we can’t wait for you to experience your new pedals and to hear your feedback once you’ve had the chance to put them through their paces!     Best regards, The Simsonn Team",
      "user_id": 158001343601,
      "created_at": "2025-08-30T10:54:50Z",
      "updated_at": "2025-08-30T10:54:50Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}