{
  "id": 3276,
  "subject": "Order 08/28",
  "description_text": "Hello,\r\n\r\n\r\n\r\nI'm writing to introduce myself. I'm the founder of the French LSX\r\ncommunity (a community of 2,000 simracing players). I ordered the Simsonn\r\nPlus X Racing Simulator Pedal with Baseplate from you for my personal setup\r\n(order #SSN2477).\r\n\r\nCurrently, I use a Simagic Alpha mini 10NM base and an FX-C steering wheel.\r\nI hope your pedal set fits my setup well and that my buying experience will\r\nbe positive.\r\n\r\n\r\n\r\nPlease feel free to share as much information as possible about it, and\r\nI'll be happy to share my experience with my community. Knowing that few\r\npeople in your community are familiar with your brand, my feedback might be\r\nof great interest to them.\r\n\r\n\r\n\r\nIf in the future you'd like us to try your products so we can share them\r\nwith our community (Haptic pedals, Hanbrake, shifters), please feel free to\r\ncontact you, and we'll be happy to share our feedback with our members.\r\n\r\n\r\n\r\nGood day.\r\n\r\n_________________\r\n\r\n*CASTRO Grégory*\r\n\r\n*Discord :* https://discord.gg/pGjCB9nkat\r\n*Facebook :* https://www.facebook.com/groups/674346790842570\r\n\r\n*Web :* https://les-simracers.fr/\r\n\r\n",
  "status": 3,
  "priority": 2,
  "created_at": "2025-08-30T08:19:53Z",
  "updated_at": "2025-08-30T10:45:32Z",
  "requester_id": 158003938017,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158007807465,
      "body_text": "Hi Grégory Castro,  Thank you for your order and for introducing yourself to us — we’re very glad to know about the LSX community and your passion for sim racing.  Since you’ll soon be receiving the Simsonn Plus X Pedals with Baseplate, we’d like to share a bit more about what makes this set special:  Full steel frame – 3.5mm laser-cut stainless steel with anti-rust treatment and precision ball bearings at all pivot points for long-lasting durability.  Load cell technology – Equipped with a high-precision 200kg sensor for consistent and accurate pedal response.  Customizable brake feel – Includes 60/70/80HA elastomers and a hard spacer, all tested for 100,000 compression cycles. Features a snap-in design for effortless elastomer replacement  Hydraulic dampers – High-quality dampers, custom-produced by the same manufacturer as HE pedals, providing unmatched hydraulic pedal feel.  Fully adjustable – Pedal angle, travel, resistance, and response curves can all be fine-tuned.  Professional-grade electronics – 16-bit control unit ensures low latency and high precision.  Software integration – Simsonn Manager supports curve configuration, dead zone adjustments, status monitoring, and native plug-and-play support for Simsonn Haptics Rector.  We’re confident these features will integrate well with your Simagic Alpha Mini base and FX-C steering wheel, giving you a strong, reliable, and highly adjustable platform for your racing.  We truly look forward to your feedback once you’ve tested the pedals, and we’re excited about the possibility of sharing your impressions with the LSX community. Please feel free to reach out at any time if you’d like more technical details or setup recommendations.  Best regards, The Simsonn Team",
      "user_id": 158001343601,
      "created_at": "2025-08-30T10:45:32Z",
      "updated_at": "2025-08-30T10:45:32Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}