{
  "id": 327,
  "subject": "Trouble with a pedal purchase with you amazon store.",
  "description_text": "On may 28 I purchased SIMSONN Upgraded PRO X PC Racing Simulator Pedals Sim Racing Pedals Pressure Sensor HE Hydraulic Pedal (P3-H3-Plate-Board)<https://www.amazon.com/dp/B0F2Y2YQR8?ref_=ppx_hzod_title_dt_b_fed_asin_title_0_0>. As of today 6/10/2025 i have not recieved them nor has the Fedx tracking changed from \"Package left the shipper facility\"...Tracking number is 881608712050.\r\n\r\n  The pedals were paid off my credit card in full, the money has been taking out by simsonn.. Im kinda feeling like i got burned or ripped off for almost 400 bucks.. the Amazon Order # 112-6007908-3935445.  I would just like to know where they at or if i am going to get them.. in the amazon listing it was stated that they would ship out off a California warehouse.  I hope you can help me out on this cause amazon customer service isnt helpful.\r\n\r\n Thank you\r\n\r\n       Paul\r\n\r\n\r\n\r\n\r\n",
  "status": 5,
  "priority": 1,
  "created_at": "2025-06-10T18:51:08Z",
  "updated_at": "2025-12-18T08:54:32Z",
  "requester_id": 158001388465,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158002906646,
      "body_text": "Hi，PJ Wentline， Please don’t worry. We’ll have our operations team immediately check the status of the shipment. If it turns out to be unshipped or there’s any issue, we’ll arrange a replacement or resolve it accordingly. Rest assured, if you purchased a SIMSONN product from an authorized platform, we will make sure you receive your order. ",
      "user_id": 158000445778,
      "created_at": "2025-06-11T02:08:34Z",
      "updated_at": "2025-06-11T02:08:34Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158002945945,
      "body_text": "Hi PJ Wentline,  We’ve checked with our overseas warehouse, and it appears that your package may have been lost in transit. We’ve already arranged a replacement shipment for you. FedEx Tracking Number: 881966264044 ",
      "user_id": 158000445778,
      "created_at": "2025-06-12T02:56:39Z",
      "updated_at": "2025-06-12T02:56:39Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158002945954,
      "body_text": "Thank you so for helping me out!\r\n\r\nSent via the Samsung Galaxy S25 Ultra, an AT&T 5G smartphone\r\nGet Outlook for Android<https://aka.ms/AAb9ysg>\r\n________________________________\r\n",
      "user_id": 158001388465,
      "created_at": "2025-06-12T02:58:58Z",
      "updated_at": "2025-06-12T02:58:58Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}