{
  "id": 34,
  "subject": "Pro to Plus X upgrade kit inquiry",
  "description_text": "Hello, I'm looking to upgrade my pedals (Simsonn Pro from the attached pic)\r\nthat I bought last year through your Aliexpress store page (you guys didn't\r\nhave a website way back when), they're still working just fine I would like\r\nto upgrade some parts to be closer to the newest version. I know that the\r\ndamper kit upgrade is available which contains new springs for throttle and\r\nclutch and the upgradaded stack for the brake pedal, however it doesn't\r\nappear to include the spacer/centering pieces for the new brake spring. I\r\nhad reached out to the ali store page and got from the AI assistant that\r\nthe pedal faces are for sale as well but couldn't find them I was wondering\r\nif by reaching out to you I could get some answers and likely the parts i'm\r\nlooking for to bring my \"old\" pedals to a new level without having to\r\npurchase an entire new set, since mine work perfectly fine and have little\r\nto no wear.\r\n\r\nIn short here's a list of the specific parts i'm looking to upgrade and a\r\nshort reasoning behind them:\r\n\r\n- New controller box: In preparation for when you guys start selling your\r\nhaptics (i know you sell this)\r\n- New damper spring set + new brake rod: Damper kit is for obvious reasons,\r\nplus i know you sell it, and the rod because I'd rather avoid getting it to\r\na shop and have them cut it only to cut it too much and damage my pedals\r\n- New pedal faces: because comfort and adjustment\r\n\r\nIf you sell all these I'd appreciate your help guiding me towards the items\r\nmentioned, if you don't maybe we can work together to build such little\r\nupgrade kit for you to sell? I bet there are tons of clients who have\r\nrelatively new pedals from the old version that need just one or 2 things\r\nto make them awesome.\r\n\r\n[image: image.png]\r\n\r\nLooking forward to hearing from you, cheers!\r\n\r\nSantiago Talavera\r\n\r\n",
  "status": 5,
  "priority": 1,
  "created_at": "2025-06-03T23:42:48Z",
  "updated_at": "2025-12-18T09:48:06Z",
  "requester_id": 158000954894,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158002325515,
      "body_text": "Hi Santiago Talavera,  Hi, we don't currently sell the upgraded pedal surfaces separately, this is the link to the brake system upgrade kit: https://www.simsonn.com/products/plus-ultra-upgrade-kit Control box: https://www.simsonn.com/products/simsonn-vam-pedals-haptic-reactor?variant=51351053533498",
      "user_id": 158000445778,
      "created_at": "2025-06-04T07:36:30Z",
      "updated_at": "2025-06-04T07:36:30Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004356492,
      "body_text": "Thank you for getting back to me!\r\nSorry for the delay in my response, i have an additional question, would i\r\nbe able to use the pro x ultra control box with my pro pedals?\r\n\r\n",
      "user_id": 158000954894,
      "created_at": "2025-07-01T11:36:34Z",
      "updated_at": "2025-07-01T11:36:34Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158004363144,
      "body_text": "Hi Santiago Talavera,  No problem at all, rest assured. ",
      "user_id": 158000445778,
      "created_at": "2025-07-02T04:16:27Z",
      "updated_at": "2025-07-02T04:16:27Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004419270,
      "body_text": "Hello!\r\nCould you help me better understand the differences between control boxes?\r\n\r\n- Pro X Ultra Pedal Control box\r\n- Plus X pedal Control box\r\n\r\nMain questions are:\r\n- What makes them different besides the shape and connector orientation?\r\n- Which one is \"better\" and why?\r\n- Are both control boxes viable to upgrade Simsonn Black Pro pedals with\r\nthe haptics?\r\n\r\nBonus questions:\r\n\r\nDespite not being supported, would it be possible to use non Simsonn haptic\r\nmotors? this is out of curiosity due to sourcing of the haptics is limited\r\nfor the time being.\r\n\r\nRegards,\r\n\r\nSantiago Talavera\r\n\r\n\r\nOn Tue, 1 Jul 2025 at 23:16, service@simsonn.com ",
      "user_id": 158000954894,
      "created_at": "2025-07-03T02:59:41Z",
      "updated_at": "2025-07-03T02:59:41Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158004447053,
      "body_text": "Hi Santiago Talavera,  Correction: Older pedals such as the Pro Plus can be upgraded to the PlusX control box, but cannot be upgraded to the ProX Ultra. The ProX Ultra supports lighting output and telemetry-based lighting effects. Both PlusX and ProX Ultra support vibration motors and are compatible with Simagic motors. ",
      "user_id": 158000445778,
      "created_at": "2025-07-04T23:49:20Z",
      "updated_at": "2025-07-04T23:49:20Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}