{
  "id": 3530,
  "subject": "Re: Simsonn Collaboration Invitation: Review the Simsonn Plus X Pedals",
  "description_text": "Hi Simsonn Team,\r\n\r\n\r\nThank you very much for reaching out and for your kind words about my\r\ncontent. I really appreciate your offer and the opportunity to try the\r\nSimsonn Plus X pedals.\r\n\r\n\r\nTo be fully transparent, I already have a set of high-end pedals installed\r\nin my cockpit, so while I don’t necessarily need another set, I’d be happy\r\nto collaborate with you if we can structure it as a professional\r\npartnership.\r\n\r\n\r\nProducing a detailed and objective review, integrating the product into my\r\nworkflow, and giving it proper exposure across my YouTube channel, Twitch\r\nstreams, and social media requires a significant investment of time and\r\neffort. For that reason, I usually work with brands under a paid\r\ncollaboration fee in addition to receiving the product.\r\n\r\n\r\nIf this approach makes sense for you, I’d be glad to discuss the details\r\nand see how we can make this partnership valuable for both sides.\r\n\r\n\r\nLooking forward to hearing your thoughts.\r\n\r\n\r\nBest regards,\r\n\r\nPedro Galisteo / PhotoRacerTV\r\n\r\n\r\nEl El vie, 5 sept 2025 a las 3:48, General and sales enquiries <\r\nservice@simsonn.com> escribió:\r\n\r\n> Hello,\r\n>\r\n> I’m the Product Manager at Simsonn. We’ve seen your objective and\r\n> impressive reviews of various sim racing equipment on YouTube, and we were\r\n> very impressed.\r\n>\r\n> The influence of the Simsonn brand is growing rapidly, and our potential\r\n> customers are eager to see more authentic feedback from professional sim\r\n> racers. We believe that your review would not only help us promote our\r\n> products more effectively, but also bring you greater audience engagement\r\n> and revenue opportunities. This could be a meaningful collaboration for\r\n> both of us.\r\n>\r\n> We would like to sincerely invite you to review our latest product, the\r\n> Simsonn Plus X Pedals. If you are interested, we will be happy to provide\r\n> the product to you free of charge. You can choose the model you prefer and\r\n> create a detailed and objective review video.\r\n> Here’s the product link:\r\n> https://www.simsonn.com/products/simsonn-plus-x-pedals\r\n>\r\n> In addition, through our affiliate program you can earn 8% commission (up\r\n> to 15%) on sales generated via your content. Please see the details here:\r\n> http://simsonn.com/pages/affiliate-program\r\n>\r\n> Thank you for taking the time to consider our collaboration offer. We have\r\n> full confidence in your professionalism and are looking forward to your\r\n> reply. If you are interested, we would be glad to discuss the next steps\r\n> with you.\r\n>\r\n> Best regards,\r\n> The Simsonn Team\r\n>\r\n> ------------------------------\r\n> service@simsonn.com\r\n>\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-09-05T15:56:54Z",
  "updated_at": "2025-09-08T06:17:03Z",
  "requester_id": 158004192762,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": []
}