{
  "id": 3538,
  "subject": "Re: Simsonn Collaboration Invitation: Review the Simsonn Plus X Pedals",
  "description_text": "Hi,\r\nMy video content concentrates on Flight Simulation rather than racing content - so I'm not sure I would be the best fit for you.\r\nBest wishes, \r\n \r\nJames Huddison\r\n\r\nHuddison - YouTube\r\n\r\n \r\n \r\n\r\n    On Friday 5 September 2025 at 02:43:48 BST, General and sales enquiries <service@simsonn.com> wrote:  \r\n \r\n Hello,\r\nI’m the Product Manager at Simsonn. We’ve seen your objective and impressive reviews of various sim racing equipment on YouTube, and we were very impressed.\r\nThe influence of the Simsonn brand is growing rapidly, and our potential customers are eager to see more authentic feedback from professional sim racers. We believe that your review would not only help us promote our products more effectively, but also bring you greater audience engagement and revenue opportunities. This could be a meaningful collaboration for both of us.\r\nWe would like to sincerely invite you to review our latest product, the Simsonn Plus X Pedals. If you are interested, we will be happy to provide the product to you free of charge. You can choose the model you prefer and create a detailed and objective review video.Here’s the product link: https://www.simsonn.com/products/simsonn-plus-x-pedals\r\nIn addition, through our affiliate program you can earn 8% commission (up to 15%) on sales generated via your content. Please see the details here:http://simsonn.com/pages/affiliate-program\r\nThank you for taking the time to consider our collaboration offer. We have full confidence in your professionalism and are looking forward to your reply. If you are interested, we would be glad to discuss the next steps with you.\r\nBest regards,The Simsonn Team\r\nservice@simsonn.com  \r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-09-05T22:44:56Z",
  "updated_at": "2025-09-08T06:07:10Z",
  "requester_id": 158004203978,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": []
}