{
  "id": 3589,
  "subject": "Pédale pas droite",
  "description_text": "Bonjour a vous l'équipe de simsonn je vous envoie ce petit mail car j'ai\r\nacquis un de votre gamme de pédalier simsonn plus.\r\n\r\nAu déballage on sent tous de suite un pédalier de grande qualité.\r\n\r\nUn mise en place très facile, un logiciel très bien fait et surtout très\r\nsimple d'utilisation.\r\n\r\nJ'ai remarqué juste une chose sur votre pédale de frein que je vous envoie\r\nen photo qui n'est pas droite. ( J'ai peut être un œil trop regardant mais\r\nc'est mon métier qui fait cela car je suis chaudronnier).\r\n\r\nJe joue le plus souvent sur LMU avec un pédalier thrusmaster t3pa avec des\r\ntemps très sympa et après 2h de conduite je reviens a mes temps avec votre\r\npédalier mais surtout une régularité qui est mieux pour ma part.\r\n\r\nDonc je valide énormément votre produit continuer comme cela et j'ai\r\nplustot hâte de voir la suite sur par exemple une base + volant.\r\n\r\nCordialement Mr forestier David\r\n\r\n",
  "status": 2,
  "priority": 1,
  "created_at": "2025-09-07T20:10:05Z",
  "updated_at": "2025-12-28T22:10:57Z",
  "requester_id": 158004246291,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158008233700,
      "body_text": "Hi David Forestier,    Hello, the pedal plate can be adjusted in height. The issue may be caused by the screws being slightly loose. You can loosen the screws, realign the pedal plate, and then tighten the screws again. This should solve the problem, similar to adjusting the pedal plate height.",
      "user_id": 158000445778,
      "created_at": "2025-09-07T23:07:19Z",
      "updated_at": "2025-09-07T23:07:19Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158008282237,
      "body_text": "Rebonjour suite à votre conseil de desserré puis bougé la pédale et\r\nresserrer cela a résolu le problème.\r\n\r\nJe vous remercie de m'avoir répondu très rapidement.( C'est même\r\nimpressionnant la réactivité)\r\n\r\nJe vais vous faire de la pub sur les différentes plateformes que j'utilise\r\npour promouvoir votre marque. ( Facebook, Instagram, discord et twitch)\r\n\r\nCordialement Mr forestier David\r\n\r\nLe lun. 8 sept. 2025, 01:07, service@simsonn.com ",
      "user_id": 158004246291,
      "created_at": "2025-09-08T15:57:50Z",
      "updated_at": "2025-09-08T15:57:50Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158008304560,
      "body_text": "Rebonjour a vous l'équipe simsonn je vous envoie ce mail pour avoir\r\nquelques informations sur votre marque et aussi voir avec vous pour un\r\npossible partenariat car honnêtement votre devise de la marque, les\r\nambitions, la qualité et bien d'autres choses m'intéresse très fortement.\r\n\r\nJe voulais savoir un peu qui a créé cette marque et comment et Venu l'idée\r\nde vous lancer avec ces ambitions ?\r\nSavoir depuis quand la marque a était créé ?\r\n\r\nSi vous voulez discuter un peut plus ou même savoir mes ambitions mais\r\naussi mon parcours simracing je suis prêt à vous partagé cela.\r\n\r\nCordialement Mr forestier David\r\n\r\nLe lun. 8 sept. 2025, 17:57, David Forestier <davidfofo42@gmail.com> a\r\nécrit :\r\n\r\n> Rebonjour suite à votre conseil de desserré puis bougé la pédale et\r\n> resserrer cela a résolu le problème.\r\n>\r\n> Je vous remercie de m'avoir répondu très rapidement.( C'est même\r\n> impressionnant la réactivité)\r\n>\r\n> Je vais vous faire de la pub sur les différentes plateformes que j'utilise\r\n> pour promouvoir votre marque. ( Facebook, Instagram, discord et twitch)\r\n>\r\n> Cordialement Mr forestier David\r\n>\r\n> Le lun. 8 sept. 2025, 01:07, service@simsonn.com ",
      "user_id": 158004246291,
      "created_at": "2025-09-09T07:40:26Z",
      "updated_at": "2025-09-09T07:40:26Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158008374946,
      "body_text": "Hello Mr. Forestier,     Thank you very much for your message and for your interest in Simsonn. We are delighted to hear that our philosophy and ambitions resonate with you.  The founder of Simsonn is a passionate motorsport enthusiast from China, as well as a hands-on engineer and craftsman. His belief is simple: the thrill of professional motorsport should not be reserved only for a select few. From the very beginning, his vision has been to make sim racing as realistic and immersive as possible at an affordable price, without compromising on quality.  Since the creation of the brand, our mission has been to strike the perfect balance between professional-grade quality and accessibility — delivering equipment that allows every racing fan to experience authentic driving sensations without financial barriers. Thanks to China’s world-leading supply chain, we are able to provide sim racing gear that combines performance, durability, and outstanding value to enthusiasts worldwide.  Our goal is clear: to merge cutting-edge technology with craftsmanship, offering sim racing equipment that empowers every aspiring racer to pursue their passion and enjoy a truly realistic motorsport experience.  We would also love to hear more about your own sim racing journey and ambitions. Please feel free to share them with us, and we can continue the discussion about a potential partnership.     Best regards, The Simsonn Team",
      "user_id": 158001343601,
      "created_at": "2025-09-10T10:49:30Z",
      "updated_at": "2025-09-10T10:49:30Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158008433443,
      "body_text": "bonsoir du coup je vais faire ma présentation le plus simple pour vous.\r\n\r\nNom: Forestier\r\nPrénom: David\r\nAge: 33 ans\r\nProfession: Chaudronnier\r\nAdresse: 48 chemin de la madonne 42190 St pierre la noailles, France\r\n\r\nMon parcours simracing: j'ai débuté sur Forza motorsport 7 ou j'ai fait un\r\nchampionnat de France a la manette, part la suite ma femme ma offert un\r\nvolant thrusmaster TMX Pro et un pedalier T3PA pour continuer et apprendre\r\nla discipline sous un angle comme je pourrais dire.\r\nj'ai continuer sur forza en intégrant une team; la Team TPON ou j'ai fait\r\npas mal de championnat avec eux comme la 308 racing cup, civic cup, ford\r\ncup, coupe des mx5, V8 supercars.\r\n\r\nj'ai ensuite fait une grande pause pour plusieurs événements familiaux (\r\nenfants, construction maison et mariage).\r\n\r\nCourant février 2023 pour découvrir les mondes de Asseto corsa, Asseto\r\ncorsa competizione, EVO, Le mans ultimate; mais aussi une nouvelle team la\r\nRedLine Racing Team.\r\n\r\nj'ai commencé avec eux sur asseto corsa competizione avec plusieurs open,\r\nchampionnat et même des endurance de 24h en équipe tous cela sur un chassie\r\nfait maison que je vous mets en photo.\r\n\r\nEt actuellement j'ai fait évoluer mon pc ainsi que les équipement de\r\nsimracing comme vous pouvais voir sur la deuxième photo. (chassis OPLITE et\r\nvotre pédalier)\r\n\r\nje vais vous montrer aussi les résultats que j'ai actuellement sur Le mans\r\nultimate en photo 4.\r\n\r\nPour de mes motivation et ambition: je cherchez a changé mon pédalier T3PA\r\npart un load ceed mais des pédaliers a plus de 300€ n'étais pas\r\nenvisageable et surtouts pour moi injustifiable aux niveaux des prix, c'est\r\npour cela que je me suis tourné chez vous en regardant votre site et lu\r\nvotre descriptif qui ma fait accroché directement et on va dire avec le\r\nprix que j'ai eu votre pédalier je suis entièrement satisfait et j'ai les\r\nattente que je voulais; j'ai même convaincu un ami de prendre une boite en\r\nH7 chez vous a la place d'une Moza.\r\nPour moi le simracing dois être accessible au plus grand nombres de\r\npersonne sans ce dire qu'il faut dépensé une fortune pour avoir de la\r\nqualité.\r\n\r\nPour mes ambition j'aimerais continuer sur Le mans ultimate et pourquoi pas\r\nvous représenter lors des évènements dont je participerais ( voir mètre\r\nvotre sponsor sur la voiture ) je suis un pilote amateur qui aime taquiner\r\nles semi pro; Puis pourquoi pas allez sur d'autre simulation comme I\r\nracing...\r\nMais pour cela je pense qu'il faudra que je change de matériel niveau\r\nvolant pour passé sur un Direct Drive.\r\n\r\nj'aimerais aussi faire découvrir votre marque sur mes différente plate\r\nforme que j'utilise pour montrer que le sim racing peut être accessible\r\npour tous et toutes avec une qualité de produit, j'utilise Instagrame (\r\ndav.smotioncars ) Facebook, et Twitch : simracingdavid ( je suis a 37\r\nfollower actuellement).\r\nje suis prêt aussi a vous aidez si vous le souhaitez au développements de\r\nvos futur produit part l'expérience de mon métier de chaudronnier, mais\r\naussi par l'essais de vos futurs gamme de votre marque et faire des\r\nprésentations pour le simracing Français.\r\n\r\nLe mer. 10 sept. 2025 à 12:49, service@simsonn.com ",
      "user_id": 158004246291,
      "created_at": "2025-09-10T18:19:59Z",
      "updated_at": "2025-09-10T18:19:59Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158008504129,
      "body_text": "Hello David,  Thank you very much for taking the time to share your detailed background and passion for sim racing with us. It’s inspiring to read about your journey, from your beginnings on Forza to your current experiences with Assetto Corsa Competizione and Le Mans Ultimate, and we’re glad to hear that our pedals have met your expectations.  We truly appreciate your motivation to represent Simsonn and to help make sim racing more accessible to everyone. As a next step, we would encourage you to create a video that highlights your experience with our products and share it with your community. If it generates positive engagement and impact, we would be happy to support you further. In fact, once our new wheelbase is ready to launch, we could consider sending you a unit to test and present.  Thank you again for your enthusiasm and support. We look forward to seeing your content and following your progress.  Best regards, The Simsonn Team",
      "user_id": 158001343601,
      "created_at": "2025-09-11T09:39:33Z",
      "updated_at": "2025-09-11T09:39:33Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158015158877,
      "body_text": "Bonjour a vous je reviens à vous pour l'expérience avec votre pédalier\r\nc'est juste monstrueux mes freinages sont juste parfait je peux enfin faire\r\ndes dépassements que je n'aurais jamais pû faire.\r\n\r\nPlein de monde mon demandé quel pédalier j'utilise et a chaque fois je mets\r\nen avant votre marque car pour moi rien n'égale le marché votre produit.\r\n\r\nVoilà une petite vidéo d'un dépassement réalisé ces derniers jours.\r\n\r\nLe jeu. 11 sept. 2025, 11:39, service@simsonn.com \nAttachment(s) that exceed the 20 MB limit have been dropped. Please reach out to the sender.",
      "user_id": 158004246291,
      "created_at": "2025-12-28T11:00:09Z",
      "updated_at": "2025-12-28T11:00:09Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}