{
  "id": 3662,
  "subject": "Re: Reminder: Order #SSN2373, how did it go?",
  "description_text": "Hi For m'y order, I don't have the setup to try a make the pedals work. However, the haptic motors have 2 supports designed to be mounted on the brakes and throttle. But this wide support only fits the brake. I have to use the support designed for the clutch to have a motor on the throttle. Thus, I have one large support left that doesn't fit the clutch pedal Could you kindly send me one support which would fit the clutch pedal, then I'll be able to make a honest review for your product. You may also correct the installation guide for the future clients. Kind Regards Chtatar Zacaria Le 9 sept. 2025 à 14:53, SIMSONN <no-reply@loox.io> a écrit : ﻿ Hello Zacaria, We would be grateful if you shared how things look and feel. Your review helps us and the community that supports us, and it only takes a few seconds. ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ Hello Zacaria, We would be grateful if you shared how things look and feel. Your review helps us and the community that supports us, and it only takes a few seconds. Simsonn VAM Pro Linear Motor - the Pedals Haptic Reactor for Vibration Feedback VAM Pro Set (3 pac/includes power supply) Dislike it Love it! Simsonn Pro Plus Pedal Upgrade Hydraulic Pedal Set Black Plus-P3-H3 / without Baseplate Dislike it Love it! Unsubscribe \r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-09-09T15:27:46Z",
  "updated_at": "2025-09-09T23:34:56Z",
  "requester_id": 158004353600,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158008346131,
      "body_text": "Hi zacaria Chtatar,  Hello, if the throttle bracket cannot be installed, you can first loosen the screws on both sides of the throttle pedal arm, then install the pedal arm. The throttle pedal only needs to be secured with one screw. After installation, tighten the screws on both sides of the throttle pedal arm. The clutch should be installed in its designated clutch position. ",
      "user_id": 158000445778,
      "created_at": "2025-09-09T23:32:55Z",
      "updated_at": "2025-09-09T23:32:55Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}