{
  "id": 3721,
  "subject": "Simsonn Pro X Ultra Review Product Request",
  "description_text": "Hi Simsonn,\r\n\r\nI hope this message finds you well!\r\n\r\nMy name is Gav Elias, and I run a YouTube channel called Gaps Exist, where I create content focused on sim racing, and particularly VR-based sim racing. I'm reaching out because I’m interested in featuring your product in an upcoming review and would love the opportunity to collaborate.\r\n\r\nI have previously been involved in various sim racing communities, such as Race Department and OverTake, but am now focused on building up a new channel, being Gaps Exist. Up to now, I have largely reviewed products and provided support to users within various sim racing Discord communities, focusing on anything and everything sim racing, from budget-friendly equipment up to high end equipment and VR equipment to beta testing numerous sim racing software such as RaceLab and CrewChief. However, my new channel is looking to focus on those who are serious about sim racing and the 30+ demographic with the disposable income to meaningfully enjoy this amazing hobby, and I would love the opportunity to showcase affordable quality products, showing my audience that you do not have to spend extortionate amounts of money to have a top tier sim racing experience.\r\n\r\nMy audience have always welcomed my reviews and support and have always appreciated my honest insights into quality gear, and I believe your product would be a great fit for my new channel and loved by my audience. I’d be happy to provide:\r\n\r\n\r\n  *\r\nA detailed, hands-on review video\r\n  *\r\nMentions/links in the description\r\n  *\r\nCross-promotion on my social platforms\r\n  *\r\nShare any affiliation or discount codes you may wish to provide\r\n\r\nI would also be happy to discuss anything further you would wish for me to include.\r\n\r\nIf you're open to providing a product sample for review, I’d ensure it’s given fair, thorough, and professional coverage. The product I am particularly interested in, being a current release that seems like an amazing new product, is your Simsonn Pro X Ultra Sim Racing Pedals with Baseplate and Haptic Reactors (PRO X ULTRA-P3-H3 with BASEPLATE and VAM PRO reactors), which are on your website here: https://www.simsonn.com/products/simsonn-racing-sim-pedal-pro-x-ultra?variant=51308304007482. I would clearly be more than happy to return the item to you after an appropriate review period if necessary.\r\n\r\nMy contact details should you wish to discuss further and/or send a review sample are:\r\n\r\n    Gav Elias.\r\n    Gaps Exist.\r\n    98 Aberrhondda Road,\r\n    Porth,\r\n    Rhondda Cynon Taf,\r\n    United Kingdom,\r\n    CF39 0AU.\r\n    \r\n    Email: GapsExist@outlook.com\r\n\r\nThank you for your time, and I hope we can work together!\r\n\r\nWarm regards,\r\n\r\nGav Elias\r\nhttps://www.youtube.com/@GapsExist\r\nGapsExist@outlook.com<mailto:GapsExist@outlook.com>\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-09-11T14:00:17Z",
  "updated_at": "2025-09-24T09:13:13Z",
  "requester_id": 158004439284,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158009178746,
      "body_text": "Hi there,\r\n\r\nI sent you an email last week and received the below automated response. I've not recieve anything since, and cannot seem to check the status of the ticker using any other links in the message.\r\n\r\nI would be grateful if you could respond to me when you can.\r\n\r\nThanks again,\r\n\r\nGav Elias\r\nGaps Exist\r\n________________________________\r\n",
      "user_id": 158004439284,
      "created_at": "2025-09-23T15:42:32Z",
      "updated_at": "2025-09-23T15:42:32Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}