{
  "id": 3823,
  "subject": "Vam Pro Kit",
  "description_text": "Dear Sir or Madam,\r\nI am very interested in purchasing the VAM PRO 2-piece kit for my BJ simracing pedals. I'd like to adapt them to my pedals, but I am unsure which control box module I need to buy. I would appreciate your help so I can complete my purchase as soon as possible.\r\nAdditionally, I need the order to be shipped to Chile. I am willing to buy it either from your website or through your official store on AliExpress.\r\nThank you very much, and I look forward to your response.\r\n",
  "status": 5,
  "priority": 1,
  "created_at": "2025-09-15T02:13:43Z",
  "updated_at": "2025-12-18T10:23:22Z",
  "requester_id": 158004549404,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158008720001,
      "body_text": "Hi Leo Bavaud,     It should also be a 4P4C RJ11 connector. You may need to re-crimp the connector, though the current one might still work. Most local computer shops can help with re-crimping. Alternatively, you can take a clear photo of the connector’s wiring sequence and send it to me for confirmation.   https://www.simsonn.com/products/simsonn-vam-pedals-haptic-reactor?variant=51351053533498",
      "user_id": 158000445778,
      "created_at": "2025-09-15T03:12:33Z",
      "updated_at": "2025-09-15T03:12:33Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158008755865,
      "body_text": "Hi,\r\n\r\nI hope this email finds you well.\r\n\r\nI'm writing because I'm a bit confused about the cable situation. If I buy\r\nthe kit and the Control Box you sent, can I connect the VAMs to the Control\r\nBox and then connect the Control Box to my PC via USB, completely\r\nindependent of my pedals? Is it a simple plug-and-play setup?\r\n\r\nAny help you can provide to clarify this would be greatly appreciated.\r\n\r\nThank you for your time.\r\n\r\nBest regards,\r\nLeandro.\r\n\r\nEl El lun, 15 sep. 2025 a la(s) 00:12, service@simsonn.com <\r\nservice@simsonn.com> escribió:\r\n\r\n> Hi Leo Bavaud,\r\n>\r\n> It should also be a 4P4C RJ11 connector. You may need to re-crimp the\r\n> connector, though the current one might still work. Most local computer\r\n> shops can help with re-crimping. Alternatively, you can take a clear photo\r\n> of the connector’s wiring sequence and send it to me for confirmation.\r\n>\r\n>\r\n> https://www.simsonn.com/products/simsonn-vam-pedals-haptic-reactor?variant=51351053533498\r\n>\r\n>\r\n> ",
      "user_id": 158004549404,
      "created_at": "2025-09-15T12:47:16Z",
      "updated_at": "2025-09-15T12:47:16Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158008838019,
      "body_text": "Hi Leo Bavaud,  Yes, theoretically you no longer need your previous control box — you can simply use our control box and software. ",
      "user_id": 158000445778,
      "created_at": "2025-09-17T02:06:41Z",
      "updated_at": "2025-09-17T02:06:41Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158008862553,
      "body_text": "Hello there,\r\n\r\nI hope this email finds you well.\r\n\r\nWhy do you say that I don't need the previous control box?\r\n\r\nLet me explain how I would like to connect the pedals.\r\n\r\nI would like to connect my Bj pedals to their control box so they function\r\nas they originally did.\r\n\r\n I would then connect your VAM pedals to the separate control box you\r\nprovided to use with either SimHub or your software.\r\n\r\nThis would allow both devices to be connected, each to its own control box,\r\nand remain completely independent.\r\n\r\nIs this possible?\r\n\r\nThank you for your time and apologies for all the emails.\r\n\r\nBest regards,\r\n\r\nLeandro\r\n\r\n\r\nEl El mar, 16 sep. 2025 a la(s) 23:06, service@simsonn.com <\r\nservice@simsonn.com> escribió:\r\n\r\n> Hi Leo Bavaud,\r\n>\r\n> Yes, theoretically you no longer need your previous control box — you can\r\n> simply use our control box and software.\r\n>\r\n>\r\n> ",
      "user_id": 158004549404,
      "created_at": "2025-09-17T13:03:13Z",
      "updated_at": "2025-09-17T13:03:13Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158008933350,
      "body_text": "Hi Leo Bavaud,  What you suggested is absolutely feasible. What I meant earlier is that the BJ pedals might be able to connect directly to our controller. However, I believe your approach of keeping the control separate is better. No problem at all. ",
      "user_id": 158000445778,
      "created_at": "2025-09-19T01:57:25Z",
      "updated_at": "2025-09-19T01:57:25Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158008933424,
      "body_text": "Hello,\r\n\r\nThank you for your response. I have a few final questions.\r\n\r\nOn your website, there are two types of control boxes: a square one and a\r\nmore rectangular one. You've recommended that I purchase the rectangular\r\none. Is this the newer model that is compatible with your software?\r\n\r\nRegarding the purchase, is it possible to ship to Chile directly from your\r\nwebsite, or should I make the purchase through AliExpress?\r\n\r\nThank you again for your help.\r\n\r\nBest regards,\r\n\r\n\r\nEl El jue, 18 sep. 2025 a la(s) 22:57, service@simsonn.com <\r\nservice@simsonn.com> escribió:\r\n\r\n> Hi Leo Bavaud,\r\n>\r\n> What you suggested is absolutely feasible. What I meant earlier is that\r\n> the *BJ pedals* might be able to connect directly to our controller.\r\n> However, I believe your approach of keeping the control *separate* is\r\n> better. No problem at all.\r\n>\r\n>\r\n> ",
      "user_id": 158004549404,
      "created_at": "2025-09-19T02:06:13Z",
      "updated_at": "2025-09-19T02:06:13Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158008933526,
      "body_text": "Hi Leo Bavaud,     You can purchase it directly from our official website, and there won’t be any issues with shipping. I’ve already sent you the rectangular purchase link. It may be compatible with your current BJ pedal RJ connector, although you might not necessarily need it, since it mainly handles telemetry data and vibration signals.    https://www.simsonn.com/products/simsonn-vam-pedals-haptic-reactor?variant=51351053533498",
      "user_id": 158000445778,
      "created_at": "2025-09-19T02:16:31Z",
      "updated_at": "2025-09-19T02:16:31Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}