{
  "id": 3927,
  "subject": "RE: Re: RE: Re: RE: Re: CABLE PROBLEME GT2",
  "description_text": "\r\n\r\n\r\n \r\n Hello, It's clearly written as the official store. Thank you. Envoyé depuis l'application Mail Orange ---------------- De : \"service@simsonn.com\" <service@simsonn.com> Envoyé : mercredi 17 septembre 2025 08:15 À : lodoroma@orange.fr Objet : Re: RE: Re: RE: Re: CABLE PROBLEME GT2 Hi Dominique CASTEL, Could you please provide a screenshot of the order details page? It seems that the purchase was not made from our official store. On\r\n Mon, 15 Sep at 1:39 AM , Dominique CASTEL <lodoroma@orange.fr> wrote: Aliexpress envoyé : 12 août 2025 à 05:37 de : General and sales enquiries <service@simsonn.com> à : Dominique CASTEL <lodoroma@orange.fr> objet : Re: Re: CABLE PROBLEME GT2 Which platform and store did you place the order from? service@simsonn.com From: Dominique CASTEL Date: 2025-08-06 23:40 To: service Subject: Re: RE: Re: RE: Re: CABLE PROBLEME GT2 Thank you for your feedback. Please find the requested information below: ORDER NUMBER : 3046049663252939 (29/11/2024) SHIPPING ADRESS : Laurent CASTEL 14, route de la Cour de la Dathée 14380 NOUES DE SIENNE PHONE NUMBER : +33 6 70 95 30 73 CONTACT : Laurent CASTEL envoyé : 6 août 2025 à 15:51 de : \"service@simsonn.com\" <service@simsonn.com> à : lodoroma@orange.fr objet : Re: RE: Re: RE: Re: CABLE PROBLEME GT2 Hi Dominique CASTEL, We need your order number, shipping address, phone number, and contact person information. On Wed, 6 Aug at 5:20 AM , Dominique CASTEL <lodoroma@orange.fr> wrote: The fault isn't visible from the outside, and to satisfy your request, I'll let you check that one of the wires is unsoldered. For this reason, it's not working. Thank you for your understanding. Sincerly, Envoyé depuis l'application Mail Orange ---------------- De : \"service@simsonn.com\" <service@simsonn.com> Envoyé : mercredi 06 août 2025 03:09 À : lodoroma@orange.fr Objet : Re: RE: Re: CABLE PROBLEME GT2 Hi Dominique CASTEL, I didn’t notice any obvious issues with this wire. Is it broken? Please provide a clear photo showing the break point so we can verify. On Tue, 5 Aug at 10:24 AM , Dominique CASTEL <lodoroma@orange.fr> wrote: Envoyé depuis l'application Mail Orange ---------------- De : \"service@simsonn.com\" <service@simsonn.com> Envoyé : mardi 05 août 2025 14:33 À : lodoroma@orange.fr Objet : Re: CABLE PROBLEME GT2 Hi Dominique CASTEL, What issue are you experiencing with the GT2 steering wheel cable? Please provide a photo, and we can arrange to send you a new one free of charge. 2368:4206036",
  "status": 3,
  "priority": 1,
  "created_at": "2025-09-18T07:37:25Z",
  "updated_at": "2025-09-18T07:54:23Z",
  "requester_id": 158002632564,
  "responder_id": null,
  "cc_emails": [],
  "conversations": []
}