{
  "id": 4224,
  "subject": "New review (5★) of Simsonn HB Pro Racing Simulator Handbrake (from William B.)",
  "description_text": "Rating: 5 | Review Text: Nice build quality, easy to set up, no complaints. I would recommend checking to see if the longer grip will be in your line of sight, I didn’t think about that and just wanted one that looked more like a drift brake. I’ll probably get a shorter one to keep it out of sight in the future.\r\n\r\nI guess if you don’t have triples it will be ok though.\r\n\r\nShockingly, the stock elastomer is kind of soft, but they include another and two die springs so you can tune it to your liking.\r\n\r\nMine also seems to want to rest at 1-2% engagement. There is probably a way to mechanically adjust it, but I just made a dead zone in the software to counter it.\r\n\r\nInstall onto profile is easy, and I suppose it would be for a plate as well, all the hardware is included.\r\n\r\nThe included usbc cable (with adapter) is long enough to connect just about anywhere…I had to bundle up about 3’ of it to keep it tidy. ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ This review was automatically published.Learn more Good Job! You have a new 5-star review of Simsonn HB Pro Racing Simulator Handbrake from William Belanger freyja13@comcast.net This review was generated by a Loox reminder email. William Belanger Display name: William B. Nice build quality, easy to set up, no complaints. I would recommend checking to see if the longer grip will be in your line of sight, I didn’t think about that and just wanted one that looked more like a drift brake. I’ll probably get a shorter one to keep it out of sight in the future.\r\n\r\nI guess if you don’t have triples it will be ok though.\r\n\r\nShockingly, the stock elastomer is kind of soft, but they include another and two die springs so you can tune it to your liking.\r\n\r\nMine also seems to want to rest at 1-2% engagement. There is probably a way to mechanically adjust it, but I just made a dead zone in the software to counter it.\r\n\r\nInstall onto profile is easy, and I suppose it would be for a plate as well, all the hardware is included.\r\n\r\nThe included usbc cable (with adapter) is long enough to connect just about anywhere…I had to bundle up about 3’ of it to keep it tidy. View, Reply or Share Customize for social Unpublish review This email is sent for 0a6bb1.myshopify.com Unsubscribe \r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-09-29T01:54:31Z",
  "updated_at": "2025-09-29T10:37:00Z",
  "requester_id": 158000954852,
  "responder_id": null,
  "cc_emails": [],
  "conversations": []
}