{
  "id": 4245,
  "subject": "I love your Products!",
  "description_text": "I love my Simsonn HB Pro handbrake! I really want to make all my equipment\r\nSimsonn products ? im just not able to afford them right now being a sole\r\nprovider. My sim is my escape from the tough realities of life and having\r\nproducts that work seamlessly and can take repeated hard usage, makes the\r\nexperience much more pleasant. The second I unboxed my HB pro I knew\r\ninstantly my pedals and shifter eill have to be Simsonn soon. I see you\r\nguys are also coming out with a wheelbase soon, thats awesome. Ever since I\r\ngot my HB Pro I haven't shut up about it on discord and on Facebook alike.\r\nI am starting to post my reels and videos as my drift skills get better and\r\nI'd love to add an affiliate link to all the reels and vids just because I\r\nlike the product so much. Eventually ill be able to afford upgrading my\r\nequipment from the thrustmaster T300rsGT and Th8a to all Simsonn stuff.\r\nJust not able to right now.\r\nKeep being amazing guys! Keep Making quality products!\r\n\r\nU Davis\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-09-29T15:28:11Z",
  "updated_at": "2025-10-09T04:00:42Z",
  "requester_id": 158005155421,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158009665618,
      "body_text": "Hi, Nathan Davis    Thank you for your love and support. We're thrilled to deliver an exceptional racing experience for you. Look for us on your next purchase to get special discounts.",
      "user_id": 158001343601,
      "created_at": "2025-09-30T04:02:16Z",
      "updated_at": "2025-09-30T04:02:16Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158009674186,
      "body_text": "Thank you and I will.\r\n\r\nU Davis\r\n\r\nOn Tue, Sep 30, 2025, 12:02 AM service@simsonn.com ",
      "user_id": 158005155421,
      "created_at": "2025-09-30T08:16:48Z",
      "updated_at": "2025-09-30T08:16:48Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}