{
  "id": 449,
  "subject": "Re: 回复：Re: 回复：Haptoc motor not working on pro x pedals.",
  "description_text": "Hi there, What is the status of my order SSN1639? Thanks, Pete On Jun 3, 2025 7:32 PM, General and sales enquiries <service@simsonn.com> wrote: Hi, it means ''need upgrade the control box firmware to support Haptic Reactor''. You can add this link to your order and we will add a Pro X Ultra control box to your order.https://www.simsonn.com/products/difference Peter herath<peterherath@hotmail.com> 在 2025年6月4日 周三 0:49 写道： Hi There, Thank you for the response. I did upgrade the software on the control box to the latest, however what do you mean by \"original control box firmware to support Haptic Reactor\". I would like to use the Vam Pro, how do I get a new control box or motherboard? Thanks, Pete From: General and sales enquiries <service@simsonn.com> Sent: Wednesday, 4 June 2025 1:27 AM To: Peter herath <peterherath@hotmail.com> Subject: 回复：Haptoc motor not working on pro x pedals. Hello, the Pro X control box needs to upgrade the software and the original control box firmware to support Haptic Reactor. And using Vam Pro can only vibrate in one direction, and the intensity is lower than Pro X Ultra. You can check the precautions point 3. If you need stronger vibration, you can choose Vam. If you need a better feeling, you can choose Vam pro. We will give you a Pro X Ultra control box or motherboard.",
  "status": 3,
  "priority": 1,
  "created_at": "2025-06-14T17:11:08Z",
  "updated_at": "2025-06-16T02:55:42Z",
  "requester_id": 158000954928,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158003225601,
      "body_text": "Hi Peter herath,  The shipment of the VAM Pro motor was delayed due to a holdup with the motor housing. The housings have arrived today, and we will be shipping your order between June 16th and 18th. Thank you for your understanding and support! ",
      "user_id": 158000445778,
      "created_at": "2025-06-16T02:55:42Z",
      "updated_at": "2025-06-16T02:55:42Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}