{
  "id": 4551,
  "subject": "FORMAL NOTICE: EU Right of Withdrawal - Order #SSN2868 - New Ticket",
  "description_text": "Dear Simonns Team,\r\n\r\nI am opening this new ticket as I have not received a response on my\r\nprevious communication regarding my cancellation, and the original ticket\r\nappears to be closed or ignored.\r\n\r\nPlease find below the formal declaration of my Right of Withdrawal, which\r\nwas originally sent today at 13:04:\r\n\r\nDear Simonns Team,\r\n\r\n\r\nI am contacting you regarding my recent order\r\n#SSN2868\r\nwhich is currently marked as “confirmed” but not shipped. I requested a\r\ncancellation earlier, but my request was refused on the basis that the\r\norder is “already shipping.”\r\n\r\n\r\nUnder EU consumer protection law (Directive 2011/83/EU on consumer rights),\r\nI am exercising my right of withdrawal, which allows me to cancel any\r\nonline order within 14 days of receiving the goods — regardless of shipping\r\nstatus. Since the item has not yet been delivered, my cancellation is fully\r\nvalid and must be accepted.\r\n\r\n\r\nPlease confirm the cancellation of my order and issue a full refund to my\r\noriginal payment method.\r\n\r\nIf you have already created a shipment label, please note that this does\r\nnot void my right of withdrawal unless the item has physically been handed\r\nto the carrier.\r\n\r\n\r\nThank you for confirming the cancellation and refund within the next 24\r\nhours.\r\n\r\n\r\nKind regards,\r\n\r\nSimon Berger\r\n\r\nPlease confirm you have processed the cancellation and initiated a full\r\nrefund to my original payment method. As stated, I will be refusing\r\ndelivery of the package, and I expect the refund to be processed promptly\r\nupon your re-receiving the item, in line with the EU legal requirement of\r\n14 days from my notice.\r\n\r\n",
  "status": 3,
  "priority": 4,
  "created_at": "2025-10-07T14:29:11Z",
  "updated_at": "2025-10-09T10:00:16Z",
  "requester_id": 158005440745,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158010134122,
      "body_text": "Hi Simon Berger,    We apologize for the delayed response; we've just returned from our 8-day holiday. Your order has been shipped. Please note that our return policy does not apply unless the product has a quality issue. Should you still wish to return the item, we can provide the address of our German warehouse. You would be responsible for shipping the package back to our warehouse at your own expense. Thank you for your understanding.",
      "user_id": 158001343601,
      "created_at": "2025-10-09T07:55:31Z",
      "updated_at": "2025-10-09T07:55:31Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158010134387,
      "body_text": "Dear Simsonn Team,\r\n\r\nThank you for your reply. Please note that your stated position violates\r\nmandatory EU consumer law and is rejected entirely.\r\n\r\nRight of Withdrawal: As a consumer purchasing at a distance, I have a\r\nnon-negotiable 14-day Right of Withdrawal under the EU Consumer Rights\r\nDirective (2011/83/EU), which allows me to cancel without providing any\r\nreason. Your internal policy requiring a \"quality issue\" is legally void\r\nand unenforceable against this statutory right.\r\n\r\nRefund Obligation: The contract was legally terminated upon my notice of\r\nwithdrawal on [Date of your first cancellation message].\r\nReturn Logistics: As previously stated, I will refuse delivery of the\r\npackage, thereby fulfilling my obligation to return the goods.\r\n\r\nYou are legally obligated to issue a full refund within 14 days of my\r\nwithdrawal notice, or upon re-receiving the goods.\r\n\r\nI now require you to immediately initiate a full refund. If I do not\r\nreceive confirmation of the refund initiation within 24 hours, I will be\r\nleft with no choice but to:\r\n\r\nLodge a formal complaint with the relevant European  Consumer Centre (ECC)\r\nfor your country due to your failure to comply with Directive 2011/83/EU.\r\nInitiate a chargeback dispute with my payment provider, providing them with\r\nthe evidence of my formal withdrawal and your explicit refusal to honor my\r\nstatutory EU rights.\r\n\r\nI expect compliance with the law.\r\n\r\n\r\nKind regards,\r\n\r\nSimon Berger\r\n\r\n\r\n\r\nservice@simsonn.com ",
      "user_id": 158005440745,
      "created_at": "2025-10-09T08:19:37Z",
      "updated_at": "2025-10-09T08:19:37Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158010141290,
      "body_text": "​​​​​Dear Mr. Berger,  Thank you for your message. Please rest assured that we fully comply with all applicable EU consumer protection laws, including the Right of Withdrawal under Directive 2011/83/EU.  If you wish to return the product without reason, we will, of course, accept the return in accordance with the law. However, you will need to cover the return shipping costs to our German warehouse. Once the returned package is received, we will process a full refund promptly.  Thank you for your understanding and cooperation.  Kind regards, The Simsonn Team",
      "user_id": 158001343601,
      "created_at": "2025-10-09T09:49:07Z",
      "updated_at": "2025-10-09T09:49:07Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158010141341,
      "body_text": "Dear Simsonn Team,\r\n\r\nThank you for confirming your compliance with the EU Right of Withdrawal\r\n(Directive 2011/83/EU).\r\n\r\nAs the item was never accepted by me (due to my prior cancellation notice)\r\nand the contract is cancelled, I must be fully refunded the price of the\r\nproduct plus the original outgoing shipping cost (standard shipping), as\r\nrequired by EU law.\r\n\r\nTo expedite the full resolution of this matter and waive the need for a\r\nformal dispute, I propose the following:\r\n\r\nI will accept liability for the return shipping cost (incurred when I\r\nrefuse the package) IF AND ONLY IF you confirm you will fully refund the\r\noriginal outgoing shipping cost to my payment method.\r\n\r\nIn summary: I pay for the return, you pay for the original delivery.\r\n\r\nPlease confirm immediately that you agree to this resolution and that you\r\nwill initiate the full refund (product price + original shipping cost)\r\nwithin 24 hours.\r\n\r\nIf I do not receive this confirmation, I will proceed with filing a formal\r\ncomplaint with the European Consumer Centre (ECC) and initiating a\r\nchargeback dispute, using the documentation that clearly shows your failure\r\nto honor the full refund of shipping costs mandated by EU law.\r\n\r\nKind regards,\r\n\r\nSimon Berger\r\n\r\n\r\nservice@simsonn.com ",
      "user_id": 158005440745,
      "created_at": "2025-10-09T09:53:53Z",
      "updated_at": "2025-10-09T09:53:53Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158010141428,
      "body_text": "We agree to follow this procedure. We will issue a full refund once you return the package to our warehouse. Please rest assured.",
      "user_id": 158001343601,
      "created_at": "2025-10-09T10:00:15Z",
      "updated_at": "2025-10-09T10:00:15Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}