{
  "id": 4681,
  "subject": "Newly purchased product issues",
  "description_text": "Hi Simsonn Team!\r\n\r\nI hope this email finds you well.\r\n\r\nToday I'm reaching out to give you visibility on three issues that my new Carbon Fiber S1 came with.\r\n\r\nThe first one was the switch close to the \"PIT\" button, it is loose and sometimes it clicks by itself. And the last one is that I felt the carbon fiber from the back was a bit open, upon inspection, I noticed one screw was not tighten, for my surprise, the thread inside the Hub is stripped, and last but not least, the rotary encoders for \"MAP\" and \"ADJ\" do not recognize when pushed.\r\n\r\nBesides that, I wanted to tell you that the provided screws came without nuts and they are just too short for me to install the really cool Simsonn plate, I needed to source 6x M5 50mm screws to at least mount the wheel to the quick release without the plate.\r\n\r\n\r\nThanks for the attention, I hope this gives you a bit of an idea of what customers are getting when ordering your devices. I will go for the 3 pedal set in the future, I hope that all comes with the great quality that made Simsonn a trusty name in the simulation world.\r\n\r\n\r\nBest regards,\r\n\r\n\r\nIván Bernal\r\n\r\n",
  "status": 3,
  "priority": 4,
  "created_at": "2025-10-09T22:01:22Z",
  "updated_at": "2025-10-10T01:22:18Z",
  "requester_id": 158005535609,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158010185142,
      "body_text": "Hi Ivan Bernal,    You can record a short video showing the issue and send it to me via Google Drive, making sure to grant access permission. If the issue is confirmed, we will send you a new replacement free of charge. All our products are fully tested before shipment, so it’s possible that vibration or impact during international transit caused the fault or looseness. We sincerely apologize for any inconvenience this may have caused.  Also, please provide your order number, contact name, phone number, and address so we can arrange the follow-up accordingly.",
      "user_id": 158000445778,
      "created_at": "2025-10-10T01:22:18Z",
      "updated_at": "2025-10-10T01:22:18Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}