{
  "id": 4708,
  "subject": "Remove My Review",
  "description_text": "Yesterday, I asked for my review to be removed from your site. The response I received was that it was not possible. I have now noticed you have removed quite a bit of negative reviews since yesterday, meaning it’s very possible. \r\n\r\nI would still like my review removed and I would also like to be contacted by a member of management. \r\n\r\nI have photos showing all the negative reviews for your products on your site that you removed in effort to make your products appear greater than they are. I have a team ready to scour the internet for every mention of your brand, in every forum to provide photo documentation of your dishonesty about the ratings of your products.\r\n\r\nYour scam will be public soon if a manager does not contact me today. I will make it my purpose in the future to make sure everyone knows what kind of company you are. They will know that you falsely advertise discounts and product reviews. It’s been screenshotted every step of the way, emails included. \r\n\r\nSo far, your discount scam has cost you about $500 in revenue just from the couple guys in my group that were in the market for pedals.  I will provide strong evidence to many others online who are on the fence, to go to a more reputable brand.  I will never stop. I will be filing consumer complaints to oversight agencies like the FTC, BBB, and anywhere else that will accept them. I will wake up every morning and give you more product reviews to scrub and hide from your potential future customers. I will think of new actions daily. I will also search SIMSONN to see if there is anywhere I haven’t reached. I will have friends validate my claims on these sites. \r\n\r\nAll of this because you wanted to save about $17. You could have looked at the email you initially sent me and said “The email we sent doesn’t say anything about usage conditions and it also mentions exactly what is in this guy’s cart and says to come use this discount code to finish the purchase.  We could do a better job and put more details in our email.  Let’s take care of this little discount because we came up short and the customer, who has already spent money with us, gave us a review, added a picture to the review for an 8% discount that he also still has NOT received, and was ready to buy more and get others to buy, is frustrated.” \r\n\r\nThat would have been the easy way. We’ll do it the hard way, but I’m glad to do it. Have a manager reach please. \r\n\r\n\r\n\r\n\r\n\r\n\r\nSent from my iPhone\r\n",
  "status": 5,
  "priority": 1,
  "created_at": "2025-10-10T12:00:16Z",
  "updated_at": "2025-10-14T06:44:32Z",
  "requester_id": 158005520318,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158010262623,
      "body_text": "Hi Daniel,    We’ve sent you a $20 gift card — it has no minimum spending requirement and can also be used together with other discounts.  We truly hope you can understand our discount policy, and we’re very sorry for any misunderstanding or inconvenience this may have caused!       Card code: ck3f7bf87qrydgy9",
      "user_id": 158001343601,
      "created_at": "2025-10-11T09:39:33Z",
      "updated_at": "2025-10-11T09:39:33Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158010272026,
      "body_text": "We’re way past $20 being acceptable. That was okay back on day one before\r\nwhoever was handling my concern was extraordinarily rude, dishonest, and\r\nunhelpful. That was before I learned that your company deletes negative\r\nreviews to make your products look better. I still want my positive review\r\nremoved. I was lied to and told it was not possible but then saw it was\r\npossible when you were able to remove my negative review.\r\n\r\nWhile I do appreciate that someone at your company is at least trying to be\r\nsomewhat polite finally, I was treated terribly this past week. I went from\r\nenjoying your product and wanting to buy another for my uncle and talking\r\ntwo other friends into getting some, to changing my mind and talking\r\neveryone else out of it.  I’m sharing my Simsonn experience with everyone\r\non every forum where your name comes up. Sorry, $20 doesn’t give the story\r\na happy ending.\r\n\r\n\r\nOn Sat, Oct 11, 2025 at 5:39 AM service@simsonn.com ",
      "user_id": 158005520318,
      "created_at": "2025-10-11T11:55:28Z",
      "updated_at": "2025-10-11T11:55:28Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158010296017,
      "body_text": "This won’t stop.\r\n\r\nDaniel Wells - Operations Manager\r\nSimply Physio\r\n111 Fox Rd STE 101\r\nKnoxville, TN, 37922\r\n(p) 865-351-0615\r\n(f) 865-622-9566\r\nwww.simplypt.com\r\n\r\n\r\nOn Sat, Oct 11, 2025 at 9:17 PM service@simsonn.com ",
      "user_id": 158005520318,
      "created_at": "2025-10-12T03:17:31Z",
      "updated_at": "2025-10-12T03:17:31Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158010344786,
      "body_text": "I’m just starting. This will get worse as time goes on. You’ve had every\r\nopportunity to do the right thing. Take my review down.\r\n\r\nI haven’t even gotten others involved yet. Two have already DM’d me on\r\nReddit about the accusations.\r\n\r\nDaniel Wells - Operations Manager\r\nSimply Physio\r\n111 Fox Rd STE 101\r\nKnoxville, TN, 37922\r\n(p) 865-351-0615\r\n(f) 865-622-9566\r\nwww.simplypt.com\r\n\r\n\r\nOn Sun, Oct 12, 2025 at 10:07 PM service@simsonn.com ",
      "user_id": 158005520318,
      "created_at": "2025-10-13T10:49:59Z",
      "updated_at": "2025-10-13T10:49:59Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}