{
  "id": 4850,
  "subject": "Partnership Inquiry – Simsonn Plus X Pedals & TikTok Livestream Collaboration",
  "description_text": "Greetings Simsonn Team, I’m Theo Rouzan, a racer from Los Angeles, California, and I’ve recently rebuilt my sim racing setup around a new AM5 PC and Moza R3 bundle. While preparing to start live streaming my races and product reviews on TikTok, I learned about your products from the person I bought my rig from—he used the Pro X and had plenty good things to say. I’d love the opportunity to partner with Simsonn and feature the Plus X Hydraulic pedals as a launch piece for my livestream series and first video review. My TikTok page (@sir_rouzan) got over 2,000 views within 24 hours on my first post, and I understand how to build momentum with high-quality, authentic sim-racing content. I bring six years of experience as a PR coordinator, so I understand marketing strategy, audience engagement, and brand positioning. I know how to communicate value in ways that resonate with viewers. I’ve also helped others build PC rigs and previously used Heusinkveld Sprints, so I can speak credibly about build quality and performance when comparing hardware. If you’re open to collaboration, I’d love to discuss ways I can authentically spotlight your products through TikTok reviews, livestream shout-outs, and long-form setup videos. I believe Simsonn deserves to be in the conversation among racers entering the space, particularly those turned off by the astronomical prices for quality pedals most people can’t afford. Thank you for considering this opportunity. -Joseph “Theo” Rouzan IV Instagram",
  "status": 3,
  "priority": 3,
  "created_at": "2025-10-14T07:44:34Z",
  "updated_at": "2025-10-24T03:11:45Z",
  "requester_id": 158005674505,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158010389479,
      "body_text": "Hi J R,    We are very sorry, but we may not be able to provide you with full sponsorship. However, if you require it, we can offer you a 30% discount. Would you be willing to accept this?",
      "user_id": 158001343601,
      "created_at": "2025-10-14T08:32:16Z",
      "updated_at": "2025-10-14T08:32:16Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158010459416,
      "body_text": "Thanks for your consideration! I accept your offer. I'm looking forward to\r\nseeing how the pedals perform and showcasing quality gear that deserves to\r\nbe seen.\r\n\r\n-Theo\r\n\r\nOn Tue, Oct 14, 2025 at 1:32 AM service@simsonn.com ",
      "user_id": 158005674505,
      "created_at": "2025-10-14T23:37:55Z",
      "updated_at": "2025-10-14T23:37:55Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158010478354,
      "body_text": "Thank you for your understanding. This is your exclusive discount, valid for one-time use only: Theo30",
      "user_id": 158001343601,
      "created_at": "2025-10-15T09:05:00Z",
      "updated_at": "2025-10-15T09:05:00Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158010972513,
      "body_text": "Greetings,\r\n\r\nI have the pedals and I’m currently producing the review video. I’d like to include an affiliate link for viewers who want to purchase your product from your site.\r\n\r\nCould you share the process in setting up an affiliate partnership?\r\n\r\n\r\n-Theo\r\n\r\n> ",
      "user_id": 158005674505,
      "created_at": "2025-10-23T18:52:09Z",
      "updated_at": "2025-10-23T18:52:09Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158010986662,
      "body_text": "Hi J R,    You can click this link to register and receive your exclusive discount and affiliate link.",
      "user_id": 158001343601,
      "created_at": "2025-10-24T03:11:34Z",
      "updated_at": "2025-10-24T03:11:34Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158010986664,
      "body_text": "https://www.simsonn.com/pages/affiliate-program",
      "user_id": 158001343601,
      "created_at": "2025-10-24T03:11:45Z",
      "updated_at": "2025-10-24T03:11:45Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}