{
  "id": 4866,
  "subject": "Welcome to Ready Set Sim",
  "description_text": "** WELCOME\r\n------------------------------------------------------------\r\n\r\n\r\n** TO THE CLUB\r\n------------------------------------------------------------\r\n\r\nWe are excited that you are joining Ready Set Sim’s community of Sim Racers who are looking to SIMplify Sim Racing! RSS started as an idea, but thanks to people like you, we’ve been able to evolve, grow, and race to complete our mission; make Sim Racing easy and accessible for racers around the world.\r\n\r\n\r\n** About RSS\r\n------------------------------------------------------------\r\n\r\nMy name is Ian Strommen, founder of Ready Set Sim. I’m like you; I wanted to get into Sim Racing but was quickly met with an overwhelming multitude of choices and questions. What wheel is compatible with what wheel base? What chassis is right for me? Which pedals should I pick for formula type racing? The list goes on and on.\r\n\r\n\r\n** I just want to race!\r\n------------------------------------------------------------\r\n\r\nI knew there had to be a better way for people like me, people who want to shorten the research time but still feel confident in their decision, to start Sim Racing. Then, after 100+ hours of sim equipment research, the idea of Ready Set Sim was born.\r\n\r\n\r\n** Our Services\r\n------------------------------------------------------------\r\n\r\nAt RSS, we are taking a different approach to supporting new and seasoned Sim Racers than is typical in the industry. Our tools provide a variety of options for you to start your journey:\r\n\r\n* Sim Rig Builder: This is our bread and butter. One tool with 325+ components that allows you to easily filter down what component is right for you\r\n* SIMFigurator: A unique tool that gets to know you and your needs. In turn, it will provide you with a personalized configuration.\r\n* SimStillation: It can take 20 hours + for the average person to assemble their Sim Rig with a high probability of having configuration issues. Our professional installers will assemble your rig, set up your software, and even provide coaching to SIMplify your start to Sim Racing!\r\n* Free Consultations: Not sure where to start? Set up a free consultation with one of our experts to help get your Sim Racing Journey started!\r\n\r\nBuild Now (https://build.readysetsim.com/simrigbuilder)\r\n\r\n\r\n** Let’s Connect!\r\n------------------------------------------------------------\r\n\r\nWe’d love to connect to learn about your Sim Racing Journey, or if you have any questions, improvement opportunities, or want someone to race with!\r\nContact us! (https://www.readysetsim.com/contact-us)\r\nhttps://facebook.com/readysetsim\r\nhttps://instagram.com/readysetsim\r\nhttps://discord.gg/\r\nhttps://Ready Set Sim\r\n\r\nCopyright (C) 2025 Ready Set Sim. All rights reserved.\r\nYou are receiving this email because you opted in via our website.\r\n\r\nOur mailing address is:\r\nReady Set Sim\r\n400 S 4th St\r\nSte 410\r\nMinneapolis, MN 55415-1419\r\nUSA\r\nWant to change how you receive these emails?\r\n\r\nYou can update your preferences (https://readysetsim.us13.list-manage.com/profile?u=766a680b13224445d69f26e54&id=25872c8ac9&e=b7cf6fc6d7&c=147f5a3e6b) or unsubscribe (https://readysetsim.us13.list-manage.com/unsubscribe?u=766a680b13224445d69f26e54&id=25872c8ac9&t=b&e=b7cf6fc6d7&c=147f5a3e6b)\r\n\r\nView in browser (https://us13.campaign-archive.com/?e=b7cf6fc6d7&i=*|ITERATION_UNIQUE_ID|*&u=766a680b13224445d69f26e54&id=147f5a3e6b)\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-10-14T10:07:10Z",
  "updated_at": "2025-10-14T10:08:11Z",
  "requester_id": 158005678259,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158010394855,
      "body_text": "Hello, we have taken note of your website and are very impressed with it. Perhaps we could explore the possibility of any form of collaboration.",
      "user_id": 158001343601,
      "created_at": "2025-10-14T10:08:11Z",
      "updated_at": "2025-10-14T10:08:11Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}