{
  "id": 4868,
  "subject": "Aliexpress order number 3061063112100511 - not received",
  "description_text": "Hello,\r\n\r\nA month ago, I placed an order for Simsonn VAM haptic motors on AliExpress\r\nthrough the Simsonn official store, but to this date, I have not received\r\nthem.\r\n\r\nWhen I check the tracking, it looks like the package still hasn't even left\r\nthe origin country, which you can see in the attached photo.\r\nAll orders that I make through Aliexpress are delivered to my address\r\nwithin a time period of up to 14 days of the order date, so at this point,\r\nI'm pretty sure that I won't receive this one.\r\n\r\nI have tried to contact Simsonn through Aliexpress, but I did not receive\r\nany answer, so I decided to contact you this way, as I already use some of\r\nyour products and you helped me in the past through this contact email.\r\n\r\nTo shorten the communication, in case if you can help me, I would be open\r\nto two solutions.\r\n1) I would be willing to wait for another package to arrive if Simsonn\r\nwould be willing to upgrade my order to VAM Pro motors (set of two,\r\nincluding power supply and attachment plates), which would be a fair call\r\nin my opinion as I have already waited for some time, and I would need to\r\nwait for a new package to arrive.\r\n2) Or if the first option is not possible, I would go for a full refund.\r\n\r\n\r\nThank you in advance and best regards!\r\nVlado Vrlika\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-10-14T10:21:49Z",
  "updated_at": "2025-10-15T09:41:32Z",
  "requester_id": 158002820193,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158010478478,
      "body_text": "Hello,\r\n\r\nFirst, thank you for your answer.\r\nTracking has not updated for more than 20 days, which seems a bit off.\r\nAlso, when I was making the order, the latest expected delivery date was\r\nOctober 5 (which you can see in the photo I attached in my first email),\r\nand now it is October 15, so 10 days late, and I still have to wait longer\r\nto see if it will even arrive at some point.\r\nIf I knew it would be this late (even questionably, will it even arrive),\r\nI'm not sure that I would place the order, as I was able to go for another\r\nbrand which I knew I would receive till now.\r\n\r\nI went with Simsonn as I have had a really good experience till now, but I\r\nthink regarding this order, we are at the point where something needs to be\r\ndone, so please check my two proposals from the first email..\r\n\r\nBest regards!\r\n\r\nOn Wed, Oct 15, 2025 at 5:24 AM General and sales enquiries <\r\nservice@simsonn.com> wrote:\r\n\r\n> Hello, sorry for the long wait. The platform customer service checked that\r\n> the package is in transit. The logistics does not show the track. It is\r\n> usually due to system update delays and will not affect normal\r\n> transportation. It is already being expedited. Please wait patiently for\r\n> the logistics update. Thank you for your understanding.\r\n>\r\n> ------------------------------\r\n> support@simsonn.com\r\n>\r\n>\r\n> *",
      "user_id": 158002820193,
      "created_at": "2025-10-15T09:15:19Z",
      "updated_at": "2025-10-15T09:15:19Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}