{
  "id": 5025,
  "subject": "Action required: You're invited to join the To activate the refund program: Refund-Advertising-Meta...",
  "description_text": "Hi,\r\n\r\n \r\n\r\n   You're invited to join To activate the refund program:  Refund-Advertising-Meta.surge.sh/accountMeta for Business invited you to join the To activate the refund program:  Refund-Advertising-Meta.surge.sh/account business portfolio. Portfolios connect a business’s Facebook Pages and other business assets so you can manage them all in one place.Depending on the access you're given, you can do things like help manage Pages, Instagram accounts, ad accounts and people's assignments.This invitation will expire on November 17, 2025. You won’t be able to accept the invitation after this date.You may need to log in with your managed Meta account if it's required by your organization.View invitationLearn moreMeta Business Suite is a one-stop shop where you can manage all of your marketing and advertising on Facebook and Instagram.Save timePlan, edit and schedule posts and stories ahead of time.Connect with customersRead and reply to messages and comments using a single inbox.Get resultsTrack what’s working best with performance insights across Meta technologies.   \r\n\r\n \r\n\r\nThanks,\r\nThe Facebook team\r\n\r\n\r\n\r\n========================================\r\nThis message was sent to service@simsonn.com. If you don't want to receive these emails from Meta in the future, please follow the link below to unsubscribe.\r\nhttps://www.facebook.com/o.php?k=AS3I_tVjv4wFO5gFors&e=service%40simsonn.com&mid=HMTc2MDgxNjE2Mjg2NjI1MTpzZXJ2aWNlQHNpbXNvbm4uY29tOjY3MA&ee=Af8lRhcNIftVCY5E2lxHRlfaoFxAR1j0amNTG6Bb9L1gMn6NwVrdwCqavyZaHSIWX3ebZPCZMe5NKwL6gg\r\nMeta Platforms, Inc., Attention: Community Support, 1 Meta Way, Menlo Park, CA 94025\r\n\r\n\r\n",
  "status": 5,
  "priority": 1,
  "created_at": "2025-10-18T19:56:50Z",
  "updated_at": "2025-10-20T01:24:28Z",
  "requester_id": 158005825308,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158010713641,
      "body_text": "此工单已关闭并合并到工单 5026 中",
      "user_id": 158000445778,
      "created_at": "2025-10-20T01:24:28Z",
      "updated_at": "2025-10-20T01:24:28Z",
      "incoming": false,
      "private": true,
      "source": 2
    }
  ]
}