{
  "id": 5090,
  "subject": "RE: Re: Desktop Fixed (Shifters) and Carbon Fiber Heel Plate informations.",
  "description_text": "\r\n\r\n\r\n \r\n Hello dear customer service, i join a picture, the setup bas is a : GT Omega DD-X Wheel Stand. You can find it there : https://www.gtomega.co.uk/en-eu/collections/wheel-stands/products/dd-x-wheel-stand Best regards Michael. ---------------- De : \"service@simsonn.com\" <service@simsonn.com> Envoyé : lundi 20 octobre 2025 03:54 À : michael.84@wanadoo.fr Objet : Re: Desktop Fixed (Shifters) and Carbon Fiber Heel Plate informations. Hi Michael BUET, Please let me know the model of your rig and send me a photo of it. I can help you confirm whether it supports the elevated pedal base installation — in most cases, it should not be a problem. On\r\n\r\n Sun, 19 Oct at 5:53 AM , Michael BUET <michael.84@wanadoo.fr> wrote: Dear Support Service, I just bought a 7+R shifter and an X plus Pedals (with clutch). - The pedals are a bit to high for me and unreachable for my daughter, even when I down them at max. So I would like to add the Carbon Fiber Heel Plate. But I need to know its dimensions especially the position and size of the screw holes : I need to know if it's compatible with my pedals base. Are the screws provides with the Carbon Fiber Heel Plate, if yes what kind of screws please ? - The 7+R shifter is too far away for my daughter, so I think about the Desktop Fixed (Shifters), it seems to fix the shifter from the side, but is it possible with a shifter build in a cylinder ? Best regards. Michael Buet 5044:4206036",
  "status": 3,
  "priority": 1,
  "created_at": "2025-10-20T18:27:08Z",
  "updated_at": "2025-10-22T05:41:32Z",
  "requester_id": 158005854319,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158010851152,
      "body_text": "Hi Michael BUET,   ​​",
      "user_id": 158000445778,
      "created_at": "2025-10-22T05:41:32Z",
      "updated_at": "2025-10-22T05:41:32Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}