{
  "id": 5173,
  "subject": "Just got my pedals I love them however there is an issue",
  "description_text": "Hey guys I just got my pedals yesterday I have them all hooked up and\r\neverything but one thing  is working great,  the throttle is the issue when\r\nI depress and throttle pedal it makes a sloshing sound like there is air\r\ninside the damper you can literally hear the hydraulic fluid sloshing\r\naround inside, which isn’t normal as I have background with this stuff and\r\n4 of my friend have these exact same pedals…. Just wondering what the\r\ncourse of action is here, I certainly do not want to package this all pack\r\nup and return it, is it possible to have a new damper sent that isn’t\r\ndefective? Another question or inquiry I have is do you guys have any\r\nsofter elastomers than 60HA I know a few guys with earlier versions that\r\nhave 30HA elastomer, as I am finding the 60 too hard…. Thank you kindly\r\n\r\nShane J Bennett\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-10-22T11:30:01Z",
  "updated_at": "2025-10-23T01:45:26Z",
  "requester_id": 158005514463,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158010917688,
      "body_text": "Hi Shane Bennett,     You’re referring to the throttle hydraulic damper making noise, correct? Are your friends also using the latest PlusX pedals? If the sound from your unit is noticeably different from theirs, it could indeed indicate an issue.  Please note that our dampers use real hydraulic oil, not inexpensive gas springs, so hearing fluid movement inside the damper is normal during operation. Differences in sound can also result from variations in installation height or angle, which affect when and how the damping engages.  That said, if you still believe the damper may be defective, we can certainly send you a replacement. However, please be aware that every damper is individually tested before shipping, so actual failures are quite rare.  Regarding the 60HA elastomer feeling too stiff — you can remove the 10 mm spacer inside the black brake spring, which will slightly increase the pedal travel and make it feel softer. This is part of our standard factory setup. We also offer a 30HA white elastomer if you prefer a softer feel — I can send you the link if you’d like.    https://www.simsonn.com/products/elastomer",
      "user_id": 158000445778,
      "created_at": "2025-10-23T01:45:26Z",
      "updated_at": "2025-10-23T01:45:26Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}