{
  "id": 5272,
  "subject": "Problemas botonera simsonn",
  "description_text": "Buenos dias, necesito ayuda con uno de sus componentes. Hace algo de 1 año\r\ncompre una botonera de volante en su tienda oficial de aliexpress (adjunto\r\nfactura de compra), desde el primer momento dio problemas de conexion que\r\nahora detallare por lo que nunca he llegado a usarlo ademas de gastos de\r\naduanas no especificados ( 70$ adicionales al precio de compra) con lo que\r\nla compra no fue muy satisfactoria.\r\nIntentare definir el problema lo mas claro posible aunque puede ser\r\ncomplicado por la barrera del idioma, asique este texto lo enviare en\r\nidioma original español y traducido mediante google en ingles.\r\nSi yo estoy jugando a un juego de conduccion con otro volante que suelo\r\nusar normalmente y decido cambiar a su volante con el pc encendido, cuando\r\nconecto el usb el volante no es detectado. Necesito reiniciar el pc con el\r\nusb de su volante conectado y ya si lo detecta, o encender directamente el\r\npc con el usb de su botonera conectada para que no de problemas de\r\nconexion. He probado todos los puertos usb disponibles tanto de pc como de\r\nusb adicionales y el problema persiste. Solo tengo este problema con su\r\nbotonera, el resto de mis accesorios funcionan perfectamente siempre. (base\r\nsimagic, pedales sim jack mini, palanca de cambios fanatec, volante\r\nleoxz... todo perfecto siempre)\r\nContacte con ustedes mediante aliexpress y me comentaron que instalara su\r\napp de simsonn, la he instalado pero no me da ninguna opcion de volante,\r\nparece solo preparada para pedales. Aportare videos de todo.\r\npor favor, necesito alguna solucion o activar la garantia, el volante NUNCA\r\nha sido usado debido a este problema y como puede ver en los videos que\r\nenviare el estado es totalmente impoluto, perfecto.\r\nNecesito alguna solucion ya que lo necesito para el proximo asseto corsa\r\nrally, por favor ayudenme, estoy muy descontento y espero que su marca\r\nresponda a la altura de las circustancias. Mi cuenta de aliexprees esta\r\nasociada a este correo electronico por si desean comprobar el historial de\r\nmensajes y veran que desde el primer momento tuve problemas tanto con\r\naduanas, como con qr y con la conexion del volante.\r\n\r\nEspero su respuesta.\r\nAlexis Jeronimo\r\nGranada - España\r\n\r\n\r\nGood morning, I need help with one of your components. About a year ago, I\r\npurchased a steering wheel button panel from your official AliExpress store\r\n(I attach the purchase receipt). From the very beginning, it had connection\r\nproblems, which I'll detail later, so I've never used it. I also incurred\r\nunspecified customs charges ($70 additional to the purchase price), making\r\nthe purchase unsatisfactory.\r\nI'll try to define the problem as clearly as possible, although it may be\r\ncomplicated due to the language barrier. So, I'll send this text in its\r\noriginal Spanish and translate it into English using Google.\r\nIf I'm playing a driving game with another steering wheel that I normally\r\nuse and decide to switch to your steering wheel with the PC on, when I\r\nconnect the USB, the steering wheel isn't detected. I need to restart the\r\nPC with the steering wheel's USB connected and then it will detect it, or\r\nturn on the PC directly with the button panel's USB connected to avoid\r\nconnection issues. I've tried all available USB ports, both on the PC and\r\nadditional USB ports, and the problem persists. I only have this problem\r\nwith the buttons. The rest of my accessories always work perfectly.\r\n(Simagic base, mini SIM jack pedals, Fanatec shifter, Leoxz steering\r\nwheel... everything is always perfect.)\r\nI contacted you through AliExpress and you told me to install your Simson\r\napp. I installed it, but it doesn't give me any steering wheel options; it\r\nonly seems to be set up for pedals. I will provide videos of everything.\r\nPlease, I need a solution or to activate the warranty. The steering wheel\r\nhas NEVER been used due to this problem, and as you can see in the videos I\r\nwill send, it is in absolutely pristine, perfect condition.\r\nI need a solution since I need it for the next Asseto Corsa Rally. Please\r\nhelp me. I am very unhappy and I hope your brand delivers as expected. My\r\nAliExpress account is associated with this email address. If you'd like to\r\ncheck the message history, you'll see that I had issues with customs, QR\r\ncodes, and the steering wheel connection from the very beginning.\r\n\r\nI look forward to your response.\r\nAlexis Jeronimo\r\nGranada - Spain\r\n\r\n",
  "status": 2,
  "priority": 1,
  "created_at": "2025-10-25T11:13:19Z",
  "updated_at": "2025-12-25T04:24:36Z",
  "requester_id": 158006092266,
  "responder_id": 158007774664,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158011073961,
      "body_text": "Hi A. j.,    We have received your message. We will carefully review your email, analyze the issue you described, and provide you with a solution as soon as possible.",
      "user_id": 158000445778,
      "created_at": "2025-10-25T12:54:20Z",
      "updated_at": "2025-10-25T12:54:20Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158011113977,
      "body_text": "Hi A. j.,    Please plug the USB cable directly into one of the rear USB 3.0 ports on your computer,  without using a USB hub, and check whether the issue still occurs.",
      "user_id": 158000445778,
      "created_at": "2025-10-26T14:47:06Z",
      "updated_at": "2025-10-26T14:47:06Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158011114349,
      "body_text": "Esa solucion ya la probe, probe absolutamente todos los usb del pc. El\r\nproblema persiste.\r\n\r\n\r\nEl dom, 26 oct 2025, 15:47, service@simsonn.com ",
      "user_id": 158006092266,
      "created_at": "2025-10-26T15:28:49Z",
      "updated_at": "2025-10-26T15:28:49Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158011127156,
      "body_text": "Hi A. j.,    Please check whether your computer is using a three-prong plug and is connected to a grounded three-prong wall socket. This ensures a proper connection to the household ground and helps prevent the base from interfering with other devices, such as the pedal.",
      "user_id": 158000445778,
      "created_at": "2025-10-26T23:51:23Z",
      "updated_at": "2025-10-26T23:51:23Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158011149859,
      "body_text": "Hola. La toma de tierra es correcta, como le comento anteriormente, no\r\ntengo ningun problema con el resto de mis componentes, nunca tuve problemas\r\nde conexiones etc. El unico producto que me da problemas de conexion es\r\nesta botonera ?\r\n\r\nEl lun, 27 oct 2025, 0:51, service@simsonn.com ",
      "user_id": 158006092266,
      "created_at": "2025-10-27T10:17:52Z",
      "updated_at": "2025-10-27T10:17:52Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158011152682,
      "body_text": "Hi A. j.,     Please refer to the EMI (Electromagnetic Interference) solution in the link below. I’ll also have our engineer review and analyze your issue again. Additionally, please take a photo showing your computer’s power plug connected to the wall socket, so we can verify whether it’s a three-prong plug and ensure that the grounding is reliable.   https://github.com/SHWotever/SimHub/wiki/USB-Issues-Troubleshooting https://support.gomezsimindustries.com/portal/en/kb/articles/understanding-emi-and-grounding",
      "user_id": 158000445778,
      "created_at": "2025-10-27T11:01:02Z",
      "updated_at": "2025-10-27T11:01:02Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158011156858,
      "body_text": "No es problema se alimentacion, les vuelvo a repetir que absolutamente\r\nTODOS mis componentes funcuonan sin dar absolutamente ningun fallo. Lo\r\nunico 1u3 causa fallos desde el primer dia que la recibi es la botonoera\r\nsimsonn.\r\nComo puede ver tengo gran cantidad de accesorios, todos conectados a la\r\nmisma alimentación sin ningun problema.\r\nGracias.\r\n\r\nEl lun, 27 oct 2025, 12:01, service@simsonn.com ",
      "user_id": 158006092266,
      "created_at": "2025-10-27T11:52:57Z",
      "updated_at": "2025-10-27T11:52:57Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158011257654,
      "body_text": "Hi A. j.,  My suggestion is to avoid connecting too many devices to a single USB hub, especially if it does not have its own power supply. Based on our internal tests and customer feedback, most issues are caused by USB hubs, such as insufficient power or data transfer interruptions. We recommend connecting your devices directly to the USB 3.0 ports on your PC, or using a more stable USB 3.0 hub with its own power supply. A USB hub without independent power can provide a maximum of 500mA. If the connected devices exceed this limit, some devices may fail to be recognized randomly. ",
      "user_id": 158000445778,
      "created_at": "2025-10-29T03:10:05Z",
      "updated_at": "2025-10-29T03:10:05Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158011268171,
      "body_text": "En primer lugar, mi dispositivo multi usb tiene su propia alinentacion a\r\ncorriente, en segundo lugar, ya comente anteriormente que el volante fue\r\nusado en puerto usb 3.0 generando el mismo problema.\r\nYa os he comentado hace varios mensajes que ese no es el problema. No me\r\nsirve de nada que me envieis el mismo mensaje del puerto usb una y otra y\r\notra vez ignorando mis respuestas de que el puerto usb YA FUE PROBADO ANTES\r\nDE CONTACTAR CON USTEDES, LA BOTONERA SE HA COMPROBADO EN TODOS LOS USB DEL\r\nMULTI USB, DONDE TENGO CONECTADO MI OTRO VOLANTE SIN NINGUN PROBLEMA Y MIS\r\nPEDALES SIMJACK PRO TAMBIEN SIN PROBLEMAS Y TAMBIEN SE HA PROBADO EN TODOS\r\nLOS PUERTOS USB DEL ORDENADOR CENTRAL INCLUYENDO LOS 3.0\r\nAporto video donde se ve la alimentacion de mi multi usb y vuelvo a\r\nrepetir, la botonera se ha probado en puertos 3.0 usb del ordenador\r\npersistiendo el problema de conexion!\r\n\r\nEl mié, 29 oct 2025, 4:10, service@simsonn.com ",
      "user_id": 158006092266,
      "created_at": "2025-10-29T07:56:34Z",
      "updated_at": "2025-10-29T07:56:34Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158011268304,
      "body_text": "Hi A. j., Please check whether your data cable is loose or disconnected, and inspect the connection points. You can send me a few photos, and I’ll help you check it. ",
      "user_id": 158000445778,
      "created_at": "2025-10-29T08:09:26Z",
      "updated_at": "2025-10-29T08:09:26Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158011268379,
      "body_text": "Dios mio... esta todo bien conectado, TODOS MIS PERIFERICOS FUNCIONAN SIN\r\nPROBLEMA. No es problema de los usb del pc ni del multi usb, con otros\r\ncomponentes si funcionan los usb y con su botonera no.\r\n\r\nEl mié, 29 oct 2025, 9:09, service@simsonn.com ",
      "user_id": 158006092266,
      "created_at": "2025-10-29T08:13:43Z",
      "updated_at": "2025-10-29T08:13:43Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158011268433,
      "body_text": "Hi A. j.,  You might have misunderstood me. I was referring to the aviation connector on the steering wheel — please check if it’s loose, broken, or has a poor connection, as any of these could cause disconnection issues. ",
      "user_id": 158000445778,
      "created_at": "2025-10-29T08:16:49Z",
      "updated_at": "2025-10-29T08:16:49Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158011272920,
      "body_text": "Se refiere a este conector?\r\n\r\nEl mié, 29 oct 2025, 9:17, service@simsonn.com ",
      "user_id": 158006092266,
      "created_at": "2025-10-29T09:30:09Z",
      "updated_at": "2025-10-29T09:30:09Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158011603862,
      "body_text": "Hi A. j.,     Could you unscrew the small screw at this location and take a photo showing the wiring order of the four wires? I will then send you a new USB data cable to try, to check if the issue is caused by a poor connection. Since it has been a year since your purchase, we may have changed the original wiring method. If we send the cable directly, incorrect wiring could prevent it from working or even damage the mainboard. ",
      "user_id": 158000445778,
      "created_at": "2025-11-02T02:30:45Z",
      "updated_at": "2025-11-02T02:30:45Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158011605385,
      "body_text": "Ok, en cuanto pueda lo hago y le envio fotos. Pero cuando realizo este\r\norden; enchufo la botonera al pc, con el pc apagado, y seguidamente\r\nenciendo el pc si lo detecta. El problema es cuando esta el pc encendido y\r\nconecto la botonera con el pc encendido, no lo detecta y tengo que\r\nreiniciar el pc para que lo detecte.\r\nSi fuese un mal posicionamiento de cables nunca deberia detectarlo si no me\r\nequivoco? Igualmente buscare una herramienta para poder enviar foto y lo\r\nenviare, es un tornillo muy pequeño y ahora no dispongo de herramienta.\r\nGracias .\r\n\r\nEl dom, 2 nov 2025, 3:30, service@simsonn.com ",
      "user_id": 158006092266,
      "created_at": "2025-11-02T07:15:34Z",
      "updated_at": "2025-11-02T07:15:34Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158013147621,
      "body_text": "Hola. Revise el cable y definitivamente es el problema, dos cables estaban\r\nhaciendo contacto, pude aislarlos y ahora parece funcionar correctamente\r\npero la solucion que pude dar al cable es momentanea.\r\n\r\nEl dom, 2 nov 2025, 8:15, A. j. <alglass92@gmail.com> escribió:\r\n\r\n> Ok, en cuanto pueda lo hago y le envio fotos. Pero cuando realizo este\r\n> orden; enchufo la botonera al pc, con el pc apagado, y seguidamente\r\n> enciendo el pc si lo detecta. El problema es cuando esta el pc encendido y\r\n> conecto la botonera con el pc encendido, no lo detecta y tengo que\r\n> reiniciar el pc para que lo detecte.\r\n> Si fuese un mal posicionamiento de cables nunca deberia detectarlo si no\r\n> me equivoco? Igualmente buscare una herramienta para poder enviar foto y lo\r\n> enviare, es un tornillo muy pequeño y ahora no dispongo de herramienta.\r\n> Gracias .\r\n>\r\n> El dom, 2 nov 2025, 3:30, service@simsonn.com ",
      "user_id": 158006092266,
      "created_at": "2025-11-30T17:55:37Z",
      "updated_at": "2025-11-30T17:55:37Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158013155523,
      "body_text": "Hi A. j.,  Please provide your order number, contact name, phone number, and address. We will send you a replacement USB cable free of charge. ",
      "user_id": 158000445778,
      "created_at": "2025-12-01T02:54:22Z",
      "updated_at": "2025-12-01T02:54:22Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158013163437,
      "body_text": "Aqui les envio foto se mi factura con todos los datos de compra.\r\nHay posibilidad de enviar un cable que sea mas largo de distancia? Quizas\r\nhaya dado fallos por estar muy tenso y corto? Gracias.\r\n\r\n\r\n\r\nEl lun, 1 dic 2025, 3:54, service@simsonn.com ",
      "user_id": 158006092266,
      "created_at": "2025-12-01T07:33:25Z",
      "updated_at": "2025-12-01T07:33:25Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158013901067,
      "body_text": "Hola. Aqui estan todos los datos de pedido y factura. Necesitan algo mas\r\npara el envio? Existe un cable mas largo? El problema puede ser por estar\r\nmuy tenso? Gracias\r\n\r\n\r\n\r\n\r\n\r\n\r\nEl lun, 1 dic 2025, 8:32, A. j. <alglass92@gmail.com> escribió:\r\n\r\n> Aqui les envio foto se mi factura con todos los datos de compra.\r\n> Hay posibilidad de enviar un cable que sea mas largo de distancia? Quizas\r\n> haya dado fallos por estar muy tenso y corto? Gracias.\r\n>\r\n>\r\n>\r\n> El lun, 1 dic 2025, 3:54, service@simsonn.com ",
      "user_id": 158006092266,
      "created_at": "2025-12-06T14:05:56Z",
      "updated_at": "2025-12-06T14:05:56Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014116660,
      "body_text": "Hi A. j.,     Could you please loosen these two screws? I need to check the soldering positions of the four wires with different colors. We recently adjusted the wiring order, so it may not fit correctly on your side. If you can provide the wiring sequence, we can remake a matching cable and send it to you. ",
      "user_id": 158000445778,
      "created_at": "2025-12-08T08:50:59Z",
      "updated_at": "2025-12-08T08:50:59Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158014717519,
      "body_text": "No consigo sacar el cable y no quiero romperlo del todo, no se si estas\r\nfotos pueden valeros. Es posible un cable mas largo? Gracias.\r\n\r\nEl lun, 8 dic 2025, 9:51, service@simsonn.com ",
      "user_id": 158006092266,
      "created_at": "2025-12-18T19:36:30Z",
      "updated_at": "2025-12-18T19:36:30Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014871925,
      "body_text": "Son validas esas fotos?\r\n\r\nEl jue, 18 dic 2025, 20:35, A. j. <alglass92@gmail.com> escribió:\r\n\r\n> No consigo sacar el cable y no quiero romperlo del todo, no se si estas\r\n> fotos pueden valeros. Es posible un cable mas largo? Gracias.\r\n>\r\n> El lun, 8 dic 2025, 9:51, service@simsonn.com ",
      "user_id": 158006092266,
      "created_at": "2025-12-22T10:35:15Z",
      "updated_at": "2025-12-22T10:35:15Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}