{
  "id": 5311,
  "subject": "Ask Haptic module",
  "description_text": "\r\nHello, I already wrote to you this week with a few questions about the Pro X Ultra pedal set, and now I have one last question before ordering this week, it's about the Haptic Reactor module. I'm looking for both feel, but without it being too much and ESPECIALLY not being too noisy. Which model do you recommend? I think that for my needs, the Haptic VAM Rumble are the best for me? Can you confirm?\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-10-27T02:54:30Z",
  "updated_at": "2025-10-29T07:43:44Z",
  "requester_id": 158006017338,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158011130107,
      "body_text": "Hi Mattéo Perrin,    You may opt for the VAM Rumble, which produces less noise and is perfectly adequate. However, the VAM Pro, when mounted horizontally, also generates minimal noise while offering superior build quality and feedback. You may select the model that best suits your requirements.  Additionally, you may avail yourself of our shop discount to enjoy a $35 reduction on the $199 price: CNFRCS  https://www.simsonn.com/products/simsonn-pro-x-ultra-pedal-with-haptics",
      "user_id": 158001343601,
      "created_at": "2025-10-27T03:24:11Z",
      "updated_at": "2025-10-27T03:24:11Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158011130153,
      "body_text": "\r\nWell, that's too much, I'm going to take the time to think about it, I'm going to order on Wednesday normally so I have 2 short days to think about it ahah, and to mount them horizontally we have to make supports ourselves in 3D printing, is that it for the VAM pro?\r\n\r\n> Le 27 oct. 2025 à 04:24, support@simsonn.com a écrit :\r\n> \r\n> ﻿\r\n> Hi Mattéo Perrin,\r\n> \r\n> You may opt for the VAM Rumble, which produces less noise and is perfectly adequate. However, the VAM Pro, when mounted horizontally, also generates minimal noise while offering superior build quality and feedback. You may select the model that best suits your requirements.\r\n> Additionally, you may avail yourself of our shop discount to enjoy a $35 reduction on the $199 price: CNFRCS\r\n> https://www.simsonn.com/products/simsonn-pro-x-ultra-pedal-with-haptics\r\n> \r\n> \r\n> ",
      "user_id": 158006017338,
      "created_at": "2025-10-27T03:29:19Z",
      "updated_at": "2025-10-27T03:29:19Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158011134762,
      "body_text": "Hi Mattéo Perrin,    You may use three clutch mounting brackets, like this.  https://www.instagram.com/p/DPD85OejLMn/",
      "user_id": 158001343601,
      "created_at": "2025-10-27T07:01:39Z",
      "updated_at": "2025-10-27T07:01:39Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158011250102,
      "body_text": "and there you have it, the order was placed as promised, again a big thank you to you and your professionalism for guiding me from start to finish for my choice, it's the first, but certainly not the last order that I will place with you! ??\r\n\r\n> \r\n> Le 27 oct. 2025 à 08:01, support@simsonn.com a écrit :\r\n> ﻿\r\n> Hi Mattéo Perrin,\r\n> \r\n> You may use three clutch mounting brackets, like this.\r\n> https://www.instagram.com/p/DPD85OejLMn/\r\n> ",
      "user_id": 158006017338,
      "created_at": "2025-10-28T20:57:17Z",
      "updated_at": "2025-10-28T20:57:17Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158011268065,
      "body_text": "Hi Mattéo Perrin,    We're glad to we can help you. Your order has been shipped, but the Pro X Ultra baseplate is currently out of stock at our German warehouse. We'll ship it to you once it's restocked next Monday.",
      "user_id": 158001343601,
      "created_at": "2025-10-29T07:43:44Z",
      "updated_at": "2025-10-29T07:43:44Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}