{
  "id": 5434,
  "subject": "affiliates, lost money?",
  "description_text": "Hey Simsonn Team,\n\nI noticed you work with MpowR and Sim Racing Corner quite a lot. Getting affiliates who publicize your gear is huge for growing your audience.\n\nThe only issue was that I couldn't find that many YouTube reviews on your products. They were either poorly made or didn't get the full point across. Matter of fact, there were about 11 reviews with a total average view count of 12k this past year. This could negatively affect sales and, most importantly, product reputation.\n\nThis is why at Trijeto, we help brands that wish to get their premium racing products out to the right audience by elevating their product reviews via social media content. Whether it be YouTube, Instagram, TikTok, etc.\n\nIf interested, would you like me to send you an outline of potential outcomes and how they could benefit the overall brand?\n\nBest,\nAbdullah\nTrijeto\r\n",
  "status": 2,
  "priority": 1,
  "created_at": "2025-10-30T07:47:06Z",
  "updated_at": "2025-11-28T16:58:11Z",
  "requester_id": 158006218929,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158011329185,
      "body_text": "May I ask what kind of assistance you can provide?",
      "user_id": 158001343601,
      "created_at": "2025-10-30T07:49:53Z",
      "updated_at": "2025-10-30T07:49:53Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158011377020,
      "body_text": "Hi,\n\nWe at Trijeto connect sim racing brands with high-performing creators. This is how we do it.\n\nWe will first need to know what your requirements would be in terms of the creator's follower count, niche, and average views required, along with your budget. Once this is established, we present you with some potential creators that we feel could be a good fit.\n\nWhenever possible, send us a list regarding the brand's requirements, as well as your budget.\n\nBest,\nAbdullah\nTrijeto\n",
      "user_id": 158006218929,
      "created_at": "2025-10-31T05:17:20Z",
      "updated_at": "2025-10-31T05:17:20Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158011387471,
      "body_text": "Hi Abdullah Mohamedali,    Each recent video has garnered over 10,000 views, with at least four videos posted per month.  Budget is unlimited. Please send us a list of eligible creators for evaluation, after which we can discuss pricing.",
      "user_id": 158001343601,
      "created_at": "2025-10-31T08:23:44Z",
      "updated_at": "2025-10-31T08:23:44Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158011589038,
      "body_text": "Hey,\n\nThanks for your patience. Please give us a few days while we see which creators are open for collaboration.\n\nBest,\nAbdullah\nTrijeto\n\n-------- Original Message --------\n",
      "user_id": 158006218929,
      "created_at": "2025-11-01T15:59:30Z",
      "updated_at": "2025-11-01T15:59:30Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158012736105,
      "body_text": "Hey Simsonn Team,\n\nThank you for your patience. Here is a proposal for a creator we are currently in touch with.\n\nCreator Overview\nPlatform: YouTube\nAverage Views Per Video This Past Month: 47,000\nContent Type: Racing Compilation Videos\nUpload Rate: Weekly, Every Wednesday, 4 Videos Uploaded This Past Month\n\nDeliverables\n1x YouTube Video (Ad Integrate Into The Middle Of The Video, 15-45 Seconds)\n\nTimeline\nFilming Completion: To Be Determined\nDraft Review: To Be Determined\nPublishing Date: To Be Determined\n\nPricing\nTotal Cost: To Be Determined\n\nIf all the above checks out, reply \"Approved\" and I'll finalise everything.\n\nAlso, could you kindly answer the following:\n\n- Regarding the ad, would you like it to talk about the Simsonn website, a specific product, or something else?\n- Would you like to provide an affiliate link so that we could track clicks, conversions, and revenue?\n- The creator does not speak or show their face in videos. Could you provide video footage/photos of what you would like promoted?\n\nLooking forward to hearing from you. If you have any questions, please feel free to reach out.\n\nBest\nAbdullah\nTrijeto\n\n-------- Original Message --------\n",
      "user_id": 158006218929,
      "created_at": "2025-11-22T00:16:19Z",
      "updated_at": "2025-11-22T00:16:19Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158012869331,
      "body_text": "Hey Simsonn Team,\n\nWasn't sure if my email reached your inbox, so this is a follow-up. Just a heads up, our creator is ready to go. Just need that green light from you.\n\nBest,\nAbdullah\nTrijeto\n",
      "user_id": 158006218929,
      "created_at": "2025-11-25T09:00:32Z",
      "updated_at": "2025-11-25T09:00:32Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158013072188,
      "body_text": "Hey Simsonn Team,\n\nWe have found a creator that fits the requirements you provided. Kindly review the outline sent previously. If all looks good, reply with \"approved\" so we may advance.\n\nIf now isn’t the right time, just let us know.\n\nBest,\nAbdullah\nTrijeto\n",
      "user_id": 158006218929,
      "created_at": "2025-11-28T16:58:11Z",
      "updated_at": "2025-11-28T16:58:11Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}