{
  "id": 5450,
  "subject": "Partnership Purple Sector x Simsonn",
  "description_text": "Dear SimSonn Team\r\n\r\nI’m Sadin, team lead of Purple Sector (Switzerland). We compete in Gran\r\nTurismo 7 and Le Mans Ultimate (soon more Simulators). We’re a small but\r\nambitious team with a good reputation in our leagues, and we really like\r\nyour brand and braking solutions.\r\n\r\n\r\nWe’d love to explore a starter partnership:\r\n\r\n\r\n   -\r\n\r\n   Preferred: support toward a brake setup we can run on our main rigs and\r\n   feature in racing content.\r\n   -\r\n\r\n   If that’s too much right now: a simple affiliate/discount arrangement\r\n   also works.\r\n\r\nIn return:\r\n\r\n\r\n   -\r\n\r\n   Logo placement on our livery and team assets\r\n   -\r\n\r\n   Consistent tags/mentions and posts on our social media\r\n   (TikTok/Instagram/X) with regular race highlights/POVs\r\n   -\r\n\r\n   Short setup notes & honest long-term feedback you can reference\r\n   -\r\n\r\n   Promotion in the leagues we race (where permitted) and within our team\r\n   channels (Discord/internal)\r\n\r\nWe’re genuinely giving it our best and focused on growing partnering with\r\nus means investing in a small team on its way up.\r\n\r\nIf the timing isn’t right, no worries—we appreciate your time and hope to\r\nrun your gear soon.\r\n\r\n\r\nBest regards,\r\n\r\nSadin Konuk\r\n\r\nTeam Lead — Purple Sector\r\n\r\nSwitzerland\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-10-30T16:25:16Z",
  "updated_at": "2025-11-18T11:37:28Z",
  "requester_id": 158006226346,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158011386792,
      "body_text": "Dear Sadin,  Thank you very much for reaching out and for your interest in Simsonn — we truly appreciate your kind words about our products and your enthusiasm for sim racing. It’s great to hear about Purple Sector and your growing presence in the community.  We’d be happy to collaborate with you. If you’d like to equip your team with our gear, we can offer you an exclusive 30% discount on your order.  Additionally, you’re welcome to join our Affiliate Program, where you can earn commission for every successful referral or sale generated through your unique link: ? https://www.simsonn.com/pages/affiliate-program  We look forward to seeing Purple Sector continue to grow and would be glad to support your journey in the sim racing world.  Best regards, The Simsonn Team",
      "user_id": 158001343601,
      "created_at": "2025-10-31T07:37:56Z",
      "updated_at": "2025-10-31T07:37:56Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158011824784,
      "body_text": "Hi SimSonn Team,\r\n\r\nthank you for the generous offer — we’re happy to collaborate.\r\n\r\nWe’d like to accept the 30% discount for our team and join the affiliate\r\nprogram.\r\n\r\nTo make this practical for us: our drivers are spread worldwide and pay\r\nindividually. Could you issue a team code (e.g., PURPLESECTOR30) that each\r\ndriver can use for their own checkout within a short window (e.g., 30\r\ndays)? Since our drivers self-finance, we can’t guarantee how many will\r\norder in that window, but we will actively push the affiliate link and the\r\ndiscount across our channels.\r\n\r\nA few quick points to confirm:\r\n\r\n\r\n   -\r\n\r\n   Non-exclusive: we may work with other brands in parallel — is that fine?\r\n   -\r\n\r\n   Brand usage: may we place your logo on our livery and use it on\r\n   socials/Discord to promote the partnership? If yes, please share a logo\r\n   pack/brand guidelines.\r\n   -\r\n\r\n   Logistics: any product exclusions or limits for the code? Shipping to\r\n   Switzerland/EU/US, VAT/customs handling, typical lead times?\r\n   -\r\n\r\n   Warranty/returns: coverage and RMA process?\r\n   -\r\n\r\n   Affiliate: commission %, cookie window, payout method/threshold.\r\n\r\nThanks again — excited to run SimSonn on our rigs and grow together.\r\n\r\n\r\nBest regards,\r\n\r\nSadin Konuk\r\n\r\nTeam Lead — Purplesector\r\n\r\n\r\nservice@simsonn.com ",
      "user_id": 158006226346,
      "created_at": "2025-11-05T17:16:14Z",
      "updated_at": "2025-11-05T17:16:14Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158011855490,
      "body_text": "ChatGPT said:    Hi Sadin,  Thank you for your message — we’re really happy to move forward with this collaboration!  Could you please let us know how many members are currently in your team? This will help us better manage the discount usage. You can use the code PURPLE30 to enjoy a 30% discount on all purchases. Please note that the code is for your team’s internal use only and should not be publicly shared or promoted, as we’ll be limiting the number of uses.  You’re absolutely welcome to collaborate with other brands in parallel — we have no issue with that. You can also feature our logo on your liveries and promote the partnership on social media or Discord.  Logistics: Shipments to Switzerland, the EU, and the US are typically tax-free in 99% of cases, but if any import duties or VAT do occur, they will need to be covered by the recipient.  Warranty & Returns: All Simsonn products include a full 2-year warranty, and returns/replacements are fully covered under our policy.  Affiliate Program: You can join our Affiliate Program via this link: Affiliate Program Signup There you’ll find detailed information about our commission structure, which increases with sales volume, as well as your unique affiliate links and discount tools.  We’re excited to have Purple Sector onboard and look forward to seeing Simsonn gear on your rigs soon!  Best regards, The Simsonn Team",
      "user_id": 158001343601,
      "created_at": "2025-11-06T10:06:19Z",
      "updated_at": "2025-11-06T10:06:19Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158011943873,
      "body_text": "Thanks again for setting up PURPLE30 and the affiliate link—appreciated.\r\n\r\n\r\nQuick one on numbers: we’re 55 people total, but not everyone will switch\r\nimmediately. How many users/uses can you allocate to PURPLE30 so we can\r\nplan the roll-out?\r\n\r\n\r\nBranding: could you send a small logo/asset pack (SVG/AI/EPS + PNG,\r\ndark/light/mono) and your preferred tags/hashtags? If you have 2–3\r\nproduct/hero images we can use in posts, that’d help as well.\r\n\r\n\r\nWe’ll keep PURPLE30 strictly internal and use the affiliate link publicly.\r\n\r\n\r\nThanks,\r\n\r\nSadin\r\n\r\nTeam Lead — Purple Sector\r\n\r\n\r\n\r\nservice@simsonn.com ",
      "user_id": 158006226346,
      "created_at": "2025-11-07T17:54:10Z",
      "updated_at": "2025-11-07T17:54:10Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158012043613,
      "body_text": "Hi Sadin,     Thank you for your message and for your professionalism — we really appreciate it.  Unfortunately, we’re unable to offer a 30% discount for such a large group. However, we can provide a 15% team discount, which will still apply under the same code for your members.  We truly appreciate your understanding and look forward to continuing our collaboration!     Best regards, The Simsonn Team",
      "user_id": 158001343601,
      "created_at": "2025-11-10T10:49:50Z",
      "updated_at": "2025-11-10T10:49:50Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158012066293,
      "body_text": "Hey sorry i think you got me wrong. We have 55 members but i think 2-5\r\npeople will buy max. So we would still like to have the 30% discount.\r\n\r\nSadin, Team Lead Purplesector\r\n\r\n\r\nservice@simsonn.com ",
      "user_id": 158006226346,
      "created_at": "2025-11-10T16:53:48Z",
      "updated_at": "2025-11-10T16:53:48Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158012114192,
      "body_text": "Hi Purplesector,    We apologize for any inconvenience this may cause, but we are unable to offer such a significant discount to large groups as it could potentially lead to unnecessary risks. Thank you for your understanding.",
      "user_id": 158001343601,
      "created_at": "2025-11-11T11:18:18Z",
      "updated_at": "2025-11-11T11:18:18Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158012279804,
      "body_text": "Hi\r\n\r\nI understand that i have an idea, give me the maximum of use of the 30%\r\ncode and then we can order like that.\r\n\r\nSadin, Team Lead Purplesector\r\n\r\n\r\nservice@simsonn.com ",
      "user_id": 158006226346,
      "created_at": "2025-11-13T19:26:49Z",
      "updated_at": "2025-11-13T19:26:49Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}