{
  "id": 5565,
  "subject": "Business Inquiry - Distribution Partnership Opportunity for SIMSONN Pedals",
  "description_text": "Dear SIMSONN Team, I hope this email finds you well. My name is Dimas Yuwono, and I am the owner/operator of ProjectNexus Sim Racing Center , a dedicated sim racing rental focused on delivering premium racing simulation experiences to our customers in Indonesia. I am reaching out to express our strong interest in your sim racing pedals, particularly the SIMSONN Plus X. I've also have SIMSONN PRO X Ultra for my personal use have been impressed by the quality and innovation of your products, and I believe they would be an excellent addition to our business offerings. We are interested in exploring two potential opportunities: Direct Procurement - Purchasing your pedals with wholesale pricing and re-sell it on MSRP Distribution Partnership - Becoming an authorized distributor of SIMSONN products in our region ProjectNexus Sim Racing Center is committed to offering our customers the highest quality equipment, and SIMSONN's reputation for performance and reliability aligns perfectly with our standards. I believe there is significant market potential for your products in our area, and I would be well-positioned to represent your brand effectively. I would welcome the opportunity to discuss these possibilities further. Please let me know your thoughts and the best way to proceed. I am happy to provide additional information about our business and our vision for this partnership. Thank you for considering this inquiry. I look forward to hearing from you. Best regards, Dimas Yuwono Owner ProjectNexus Sim Racing Center +62 818 0492 4230 https://projectnexus.id\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-11-03T02:19:22Z",
  "updated_at": "2025-11-03T08:47:45Z",
  "requester_id": 158006330480,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158011647394,
      "body_text": "Hi Dimas,     Thank you for reaching out and for your kind words about our products — we truly appreciate your support and enthusiasm for SIMSONN.  We’re excited about the possibility of working together and believe there’s great potential in your market. For now, we’d prefer to start with a Direct Procurement partnership.  Please find attached a wholesale price list for your reference. You can let us know which products and quantities you’re interested in, and we’ll prepare a detailed quotation for you.  Please note that the listed prices do not include shipping. If you’d like us to handle the shipment, kindly provide your full delivery address, and we’ll update the quote with shipping costs accordingly.  We look forward to hearing your thoughts and starting a successful cooperation with ProjectNexus Sim Racing Center.     Best regards, SIMSONN Team",
      "user_id": 158001343601,
      "created_at": "2025-11-03T08:47:45Z",
      "updated_at": "2025-11-03T08:47:45Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}