{
  "id": 5595,
  "subject": "Small proposal from a sim-racing enthusiast",
  "description_text": "Hi Simsonn team,\r\nI’m a sim-racing driver using your pedals, and I’ve been really impressed by their quality and feel. I’m currently racing in an online MX-5 league on iRacing (https://mx5united.com), which usually gets around 500–1000 views per race, with seven races this season.\r\nI wanted to ask if it would be alright to feature your logo on my car’s livery — purely as a gesture of appreciation, with no sponsorship or obligations involved.\r\nThanks for your time, and keep up the amazing work your pedals have been a game changer for my setup.\r\nBest,\r\n\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-11-03T22:56:53Z",
  "updated_at": "2025-11-18T11:41:57Z",
  "requester_id": 158004604301,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158011700484,
      "body_text": "Hi Adrien Lugnot,         Thank you so much for your kind words and for sharing your experience with our pedals — we’re really glad to hear they’ve made a difference in your setup!  Of course, we’d be more than happy for you to feature the Simsonn logo on your car’s livery. We truly appreciate your support and enthusiasm for our brand.  Thank you again for representing Simsonn in the sim-racing community, and we wish you the best of luck in your MX-5 league races!     Best regards, The Simsonn Team",
      "user_id": 158001343601,
      "created_at": "2025-11-04T02:56:45Z",
      "updated_at": "2025-11-04T02:56:45Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158012059750,
      "body_text": "Hello Simsonn,\r\nIt took me a bit more time than I expected, but the livery is now finished with your logo included.\r\nAttached are several pictures of the car from all angles. I hope you’ll like how it turned out.\r\nI’m still new to livery design, so if you have any feedback or improvement suggestions, I’d be glad to hear them.\r\nWishing you a great day,\r\nAdrien Lugnot\r\n? 0695204443\r\n✉️ adrien082002@hotmail.fr\r\n\r\n________________________________\r\nDe : service@simsonn.com ",
      "user_id": 158004604301,
      "created_at": "2025-11-10T14:51:58Z",
      "updated_at": "2025-11-10T14:51:58Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}