{
  "id": 5602,
  "subject": "BIG PROMLEM!!! URGENT!!! Order #SSN3012",
  "description_text": "This is what I wrote yesterday, didn't receive a response yet:\r\n\r\nHello, I have just received pedals from my order. The order is missing the\r\nbase-plate, which I ordered.\r\nSeriously, what is wrong with you? How can you send me the wrong product\r\nwhen there is even a picture that this one has no baseplate on the front? I\r\nam expecting you to propose a serious compensation on top of sending me the\r\nbaseplate first class express shipping of course. So I can have it here in\r\nfew days.\r\nI am the founder of very well known simracing community and this mistake\r\nwill cost us a lot in damages, as this product was supposed to be used for\r\nmarketing purposes!!!\r\n\r\nWe have sent out a person to SEMA show to make contact with automotive\r\nbrands, getting sponsorships for us and had planned to make POV marketing\r\ncontent using the pedals, to continue the momentum on social media (we\r\nreceived over 150k views in past 3 days). On top of that, we have meetings\r\nwith investors willing to invest tens of thousands of dollars into our\r\nproject, as we aim to become the biggest simracing community in the next\r\nyear. Your failure to deliver the correct version of product thus has\r\nmassive implications and is timed in the worst possible way. We demand this\r\ncase to be treated with the highest priority, as it is possibly costing us\r\na fortune in missed opportunities. Let me know ASAP on how this will be\r\nhandled in a way that we can continue with our plan and minimize damages.We\r\ncertainly need the missing part of the order to be delivered by express\r\nmail within days of receiving this complaint and are also asking for some\r\nform of compensation that we are willing to discuss.\r\n\r\nWe ordered pedals with baseplate, this is what came in the mail (just the\r\npedals):\r\n[image: unnamed (1).jpg][image: unnamed.jpg]\r\nwithout the baseplate our marketing plan is ruined, as there is no way to\r\nmount the hardware to the sim-rig, thus no way to make the content that was\r\nalready supposed to be made, edited and posted. We invested quite a lot of\r\nresources to position our guy at SEMA autoshow, and also to get in touch\r\nwith investment companies, etc. . We will seek ways to compensate, but I am\r\nconfident you can make this right so we do not have to.\r\n\r\nLet me know ASAP on the course of action.\r\n\r\nThank you,\r\n\r\nregards,\r\n\r\n-Mgr. Lukas Horvath\r\n\r\n",
  "status": 3,
  "priority": 4,
  "created_at": "2025-11-04T06:48:14Z",
  "updated_at": "2025-11-06T08:40:42Z",
  "requester_id": 158005855097,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158011709782,
      "body_text": "Hi Lukáš Horváth,    We sincerely apologize for the inconvenience caused. Our German warehouse is currently out of stock for the base plates, and restocking has been severely delayed due to customs clearance backlogs. We will ship your base plates via DHL Express within the next couple of days. We deeply regret the delay.",
      "user_id": 158001343601,
      "created_at": "2025-11-04T06:58:53Z",
      "updated_at": "2025-11-04T06:58:53Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158011710487,
      "body_text": "Hi, well calling it an inconvenience is quite an understatement, as per the\r\nreasons I stated in my previous messages. Moreso that based on your\r\nmessage, it will take at least another week until we are able to execute on\r\nour plan, which will be too late, thus we need to spend extra resources for\r\nan emergency solution.\r\n\r\nTime is money, so I was expecting some proposal on your side on\r\ncompensation for this problem. We would accept either product (sending the\r\nhaptic reactors with the baseplate for example), or working out some\r\nmarketing cooperation between our community and Simsonn - i am the founder\r\nof INITIAL G - www.initialg.gg . I can discuss further with your narketing\r\ndepartment if needed\r\n\r\nDňa ut 4. 11. 2025, 7:59 service@simsonn.com ",
      "user_id": 158005855097,
      "created_at": "2025-11-04T07:14:59Z",
      "updated_at": "2025-11-04T07:14:59Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}