{
  "id": 5663,
  "subject": "Action required: You're invited to join the Meta Media Agency at affiliate.digital-partner-portal.co...",
  "description_text": "Xin chào,\r\n\r\n \r\n\r\n   You're invited to join the Meta Media Agency at affiliate.digital-partner-portal.com business portfolioMeta Media Agency at affiliate.digital-partner-portal.com is not part of or affiliated with Meta. Only approve requests and invitations from people and businesses you know and trust. Meta will never ask for passwords, payment information or personal details in an email.Meta Agency Support invited you to join the Meta Media Agency at affiliate.digital-partner-portal.com business portfolio on Meta Business Suite. Depending on your access, you can do things like help manage Pages, Instagram accounts, ad accounts and people’s assignments.Portfolios connect a business’s Facebook Pages and other business assets so you can manage them all in one place.You may need to log in with your managed Meta account if it's required by your organization.This invitation will expire on December 05, 2025. After this date, you won’t be able to accept the invitation.View invitationGet started with business tools from MetaYou can access business tools like Meta Business Suite and Ads Manager to help you connect with your customers and get better business results.Our business tools can help you:Save timeAccess everything you need to manage your business across Facebook, Instagram and Messenger all in one place.Connect with customersRead and reply to messages and comments from a single inbox.Get resultsTrack what’s working best with performance insights across Meta technologies.About Meta Business Suite   \r\n\r\n \r\n\r\nTrân trọng cảm ơn!\r\nĐội ngũ Facebook\r\n\r\n\r\n\r\n========================================\r\nThư này đã được gửi đến service@simsonn.com. Vui lòng nhấp vào liên kết bên dưới để hủy đăng ký nếu bạn không muốn nhận những email như thế này từ Meta trong tương lai.\r\nhttps://www.facebook.com/o.php?k=AS14XB3OHdvS6a08K68&e=service%40simsonn.com&mid=HMTc2MjMzMTM3MzI1NTE1NjpzZXJ2aWNlQHNpbXNvbm4uY29tOjY3MA&ee=Af9sKhJUsSBk3iFZ2l5DdmXdcVP6TVqqPmSwqDx7KZ3jJ4s8tTqnmH_uP1tbMF7sICUsvKpe_ZADYpC-ag\r\nMeta Platforms, Inc., Attention: Community Support, 1 Meta Way, Menlo Park, CA 94025\r\n\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-11-05T08:50:22Z",
  "updated_at": "2025-11-05T08:50:32Z",
  "requester_id": 158006304049,
  "responder_id": null,
  "cc_emails": [],
  "conversations": []
}