{
  "id": 5696,
  "subject": "Pedals not working",
  "description_text": "Hey guys i was hopping to get some kind of help with your pedals i recently bought them and the throwl it’s not working for the pro x dual pedals it’s getting the led but if i press there’s is no input \r\n\r\nCan you guys help me please \r\n\r\n\r\nRegards \r\n\r\n Dan Castro\r\n\r\nContent creator.\r\n\r\nEnviado desde mi iPhone\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-11-05T23:30:56Z",
  "updated_at": "2025-11-10T10:41:18Z",
  "requester_id": 158006660815,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158011914672,
      "body_text": "Hi [EUS]steven umaña,    Please provide a video of this issue, and we'll have our engineers help you diagnose the problem.",
      "user_id": 158001343601,
      "created_at": "2025-11-07T09:09:39Z",
      "updated_at": "2025-11-07T09:09:39Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158011951287,
      "body_text": "Hey guys, thank you for the prompt response. Yeah, I actually just realized that it wasn’t a sprint that it was missing on the throttle battle and I just went ahead and bought a replacement here at the closest hardware store. Thank you for it for the for the response guys I was wondering as well, if by any chance you guys have any country creator program for your products since you know since Racing in general is growing a lot here in Latin America and there’s no like accessibility, I said to this kind of good quality products as yours so I was wondering if you guys had any plans do you wanna move or or grow a little bit over the spot of the sea and if you guys had any any content creator program I’ll be super happy to join them have more information I can actually give you guys aa plan for a sponsorship or a you know, collaboration or whatever we can do for sure guys let me know. I’ll be happy to review your products and you know help you with the growing out here in this part of they were . \r\nEnviado desde mi iPhone\r\n\r\n> El 7 nov 2025, a la(s) 3:09 a. m., service@simsonn.com escribió:\r\n> \r\n> ﻿\r\n> Hi [EUS]steven umaña,\r\n> \r\n> Please provide a video of this issue, and we'll have our engineers help you diagnose the problem.\r\n> \r\n> \r\n> \r\n> ",
      "user_id": 158006660815,
      "created_at": "2025-11-07T20:35:10Z",
      "updated_at": "2025-11-07T20:35:10Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158012043456,
      "body_text": "Hi [EUS]steven umaña,    Thank you for your support. We haven't actively promoted our services in Latin America yet because we haven't resolved shipping issues—both delivery times and shipping costs are currently suboptimal. We're actively working on this, and once we've addressed these challenges, we'll be ready to continue our partnership! Have fun!",
      "user_id": 158001343601,
      "created_at": "2025-11-10T10:41:17Z",
      "updated_at": "2025-11-10T10:41:17Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}