{
  "id": 5778,
  "subject": "Re: Air in gas pedal damper",
  "description_text": "Hello, thank you for responding. I don't quite understand your instructions. My Pedal was in the samw orientation as your picture shows. Just to confirm, i recorded a new video, which is attached. If i did it wrong, please send more descriptive instructions/images. Thank you Am 03.11.2025 04:40 schrieb General and sales enquiries <service@simsonn.com>: We have already contacted you on the AliExpress platform.When testing the pedal, if air needs to be released, the cylinder must be positioned on top with the piston head facing downward to avoid air noise. Please refer to the attached picture for the correct testing angle.If it still doesn't work after debugging, we will send you a replacement hydraulic rod. service@simsonn.com From: Jascha Wallmeier Date: 2025-10-31 17:39 To: service Subject: Air in gas pedal damper Hello, i recently bought a PlusX 3 Pedal Set from you (ordered no 3061648848014112). During my first tests, i noticed the damper in the gas pedal has air trapped inside. I can hear it pumping air and it has a deadzone before it starts damping. Attached is a video where you can hear the \"pumping sound\". Could you send a replacement part please?",
  "status": 3,
  "priority": 1,
  "created_at": "2025-11-07T12:46:00Z",
  "updated_at": "2025-11-09T03:58:14Z",
  "requester_id": 158006237211,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158011984657,
      "body_text": "Hi Jascha Wallmeier,  Please provide your order number, along with your contact name, phone number, and address, and we will send you a replacement. In fact, the water-like sound from the pedals is a characteristic of the pure hydraulic rod, unlike cheap Gas Sprint compressed gas springs. ",
      "user_id": 158000445778,
      "created_at": "2025-11-09T03:58:14Z",
      "updated_at": "2025-11-09T03:58:14Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}