{
  "id": 6134,
  "subject": "Re: No grounding cable",
  "description_text": "12004 Penn Trace Drive Louisville KY 40229 While I have you, they’re actually not working! So they’re hooked direct to the PC via usb. I have changed ports. I calibrate them in the Simsonn software, but it seems to reset even after saving it. Sometimes they show disconnected even if they’re not. Firmware is updated I can calibrate them, start iRacing and it will say telemetry is connected in the attached image. But iRacing never sees them. Thoughts? Sent from my iPhone On Nov 14, 2025, at 2:35 AM, General and sales enquiries <service@simsonn.com> wrote: ﻿ \r\n Hi Roman, Could you please provide us your order ID adn your shipping address? We will ship a grounding cable to you. \r\n \r\n service@simsonn.com \r\n From: romac1314 Date: 2025-11-12 19:39 To: service Subject: No grounding cable I go around to installing my pro plus pedal set finally from Amazon and realized there is no grounding cable anywhere in the box. \r\n \r\n Can you tell me what specifically the cable is or provide a link to a similar one so I can get these working correctly? \r\n \r\n Roman \r\n \r\n \r\n Sent from my iPhone \r\n \r\n",
  "status": 5,
  "priority": 1,
  "created_at": "2025-11-14T11:52:30Z",
  "updated_at": "2025-12-18T10:05:13Z",
  "requester_id": 158006960705,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158012400425,
      "body_text": "Hi romac1314，    First, a grounding wire is not required unless your computer is not using a three-prong plug and cannot reliably connect to the household ground.  When testing the vibration motor in SIMSONN Manager 2.1.2, the motor not vibrating still indicates that the hardware is functioning normally.  SIMSONN Manager 2.1.2 supports the telemetry effects listed below. If you need more telemetry options, you can close our software and use the latest version of SimHub.  Additionally, you can use any wire to connect the computer case to a screw on the controller box, and also connect any metal screw on the controller box to the pedal. Please note that paint may affect the connection quality.          https://github.com/SHWotever/SimHub/wiki/USB-Issues-Troubleshooting https://support.gomezsimindustries.com/portal/en/kb/articles/understanding-emi-and-grounding",
      "user_id": 158000445778,
      "created_at": "2025-11-16T03:18:43Z",
      "updated_at": "2025-11-16T03:18:43Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}