{
  "id": 6143,
  "subject": "Re: Order no SSN3328",
  "description_text": "Hi, I seem to have a problem, it seems that this pedal set is incompatible with my existing setup. I have a ps5 pro and a fanatec dsl dd wheelbase. But from what I am now being told the pedal set is only PC compatible. Can you please confirm that this is the case, and that they will not work with my equipment. And if unfortunately that this is the case I shall need to make arrangements to return the equipment for a refund.\r\nAlso the vibration modules have not yet arrived, I assume they are coming in a separate package, which would also need to be returned upon arrival.\r\nMany thanks for your assistance.\r\nBest regards,\r\nDale Coleman\r\n\r\n\r\nSent from Outlook for iOS<https://aka.ms/o0ukef>\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-11-14T14:36:20Z",
  "updated_at": "2025-12-05T11:48:52Z",
  "requester_id": 158007064109,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158012523525,
      "body_text": "Hi,\r\nI have not heard back from you by email as yet, is this normal?\r\nAlso I have no way of signing in to view the ticket as I do not have a password.\r\nPlease help me with this.\r\nI look forward to hearing from you soon.\r\nMay thanks,\r\nDale Coleman\r\n\r\nSent from Outlook for iOS<https://aka.ms/o0ukef>\r\n________________________________\r\n",
      "user_id": 158007064109,
      "created_at": "2025-11-18T15:21:32Z",
      "updated_at": "2025-11-18T15:21:32Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158012575119,
      "body_text": "Hi Dale Coleman,    I'm sorry I didn't receive your message. Did you encounter any issues with the product you received?",
      "user_id": 158001343601,
      "created_at": "2025-11-19T11:57:26Z",
      "updated_at": "2025-11-19T11:57:26Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158012577099,
      "body_text": "Re order: SSN3328\r\nHi,\r\nThanks for getting back to me.\r\nThe problem that I have is it seems that this pedal set is incompatible with my existing setup. I have a ps5 pro and a fanatec dsl dd wheelbase. But from what I am now being told the pedal set is only PC compatible. Can you please confirm that this is the case, and that they will not work with my equipment. And if unfortunately that this is the case I shall need to make arrangements to return the equipment for a refund.\r\nThis also includes the vibration modules that arrived in a separate package, which would also need to be returned.\r\nMany thanks for your assistance with this, and apologies for any inconvenience that I may have caused.\r\nBest regards\r\nDale Coleman\r\n\r\n\r\nSent from Outlook for iOS<https://aka.ms/o0ukef>\r\n________________________________\r\n",
      "user_id": 158007064109,
      "created_at": "2025-11-19T12:21:27Z",
      "updated_at": "2025-11-19T12:21:27Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158012768670,
      "body_text": " Hi, Could you please respond as this lack of communication is starting to concern me. All details are contained in this email conversation. As far as I can find out the pedal set is incompatible with the PS5 pro, so could you please make arrangements or information available for me to return them to you.Many thanks,Dale Coleman\r\n    ",
      "user_id": 158007064109,
      "created_at": "2025-11-23T00:13:50Z",
      "updated_at": "2025-11-23T00:13:50Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158013498223,
      "body_text": "Hi Dale Coleman,    We apologize for the delayed response. Since we do not yet have a warehouse in the UK, you may return the package to our German warehouse. We will process your refund once we receive and inspect the item.  Gubitz GmbH(LeiXuan A211) Hüttenkamp 12 Neumünster,Schleswig-Holstein   24536 +49 17622233089",
      "user_id": 158001343601,
      "created_at": "2025-12-05T11:48:52Z",
      "updated_at": "2025-12-05T11:48:52Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}