{
  "id": 6314,
  "subject": "UPS shipment 1ZJ455510407912791 20-11",
  "description_text": "UPS Canada is attempting to clear shipment tracking # 1ZJ455510407912791 that you are sending to RENATO THE GREAT. We need to contact your customer for clearance information. Please provide their alternate phone number and email address. Please email broker@ups.com<mailto:broker@ups.com>.\r\n\r\nThank you for using UPS,\r\n\r\nMelissa Carver\r\nUPS Canada\r\nbroker@ups.com<mailto:broker@ups.com>\r\n1-888-520-9090\r\n\r\n\r\n[cid:image001.png@01DC58AF.5F5A8080]ATTENTION IMPORTERS!\r\nRelease Prior to Payment (RPP) Transition Period ended May 20, 2025\r\nTo obtain RPP privileges please post your financial security on CBSA's CARM Client Portal.  Visit Memoranda D17-1-8<https://www.cbsa-asfc.gc.ca/publications/dm-md/d17/d17-1-8-eng.html> and D17-5-2<https://www.cbsa-asfc.gc.ca/publications/dm-md/d17/d17-5-2-eng.html> for more information.\r\n\r\nNeed a financial security provider? Please reach out to carm@ups.com<mailto:carm@ups.com> for more information on obtaining a surety bond.\r\n\r\nIf your business is not yet registered on the CARM Client Portal, you must do so to continue importing into Canada.  Failure to be registered on the portal and have your brokers delegated may cause delays in your shipments being processed.\r\n\r\nRefer to CBSA Onboarding User Guide<https://solutions.ups.com/rs/935-KKE-240/images/CA_EN_CARM-R1-User-Guide.pdf> for registration instructions.  To learn more on your role under CARM or access CARM resources, visit CARM<https://solutions.ups.com/carm-en.html>.  Contact carm@ups.com<mailto:carm@ups.com> for any questions.\r\n\r\n[cid:image001.png@01DC58AF.5F5A8080]AVIS AUX IMPORTATEURS\r\nLa période de transition concernant la mainlevée avant paiement (MAP) a pris fin le 20 mai 2025.\r\nPour obtenir les privilèges en vertu de la MAP, veuillez  publier votre garantie financière sur le Portail client du système GCRA de l'ASFC.  Consultez les Mémorandums D17-1-8<https://www.cbsa-asfc.gc.ca/publications/dm-md/d17/d17-1-8-fra.html> et D17-5-2<https://www.cbsa-asfc.gc.ca/publications/dm-md/d17/d17-5-2-fra.html> pour de plus amples renseignements.\r\n\r\nBesoin d'un fournisseur de garanties financières? Veuillez envoyer un courriel à carm@ups.com<mailto:carm@ups.com> pour vous renseigner sur l'obtention d'une garantie financière.\r\n\r\nSi votre entreprise n'est toujours pas inscrite sur le Portail client de la GCRA, ne tardez pas à le faire, car vous ne pourrez pas continuer à importer des marchandises au Canada. Ne pas être inscrit sur le portail et ne pas avoir délégué de courtiers en douane pourrait entraîner des retards dans le traitement de vos envois.\r\n\r\nConsultez le Guide de l'utilisateur sur l'intégration au portail client de la GCRA<https://solutions.ups.com/rs/935-KKE-240/images/CA_fr_CARM-R1-User-Guide.pdf> pour obtenir des instructions sur l'inscription. Pour en savoir plus sur votre rôle dans le cadre de la GCRA et accéder à des ressources, consultez la page GCRA<file://svrp000cc109/Users/Translations/_%20En%20cours/To%20learn%20more%20on%20your%20role%20under%20CARM%20or%20access%20CARM%20resources,%20visit%20CARM>.\r\n\r\nDes questions? Écrivez-nous à carm@ups.com<mailto:carm@ups.com>.\r\n\r\n[cid:image002.png@01DC58AF.5F5A8080]\r\n\r\n\r\n\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-11-18T21:19:27Z",
  "updated_at": "2025-11-19T05:45:26Z",
  "requester_id": 158007168136,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158012559976,
      "body_text": "﻿\r\n﻿\r\nLa version française du message suit la version anglaise.\r\n\r\nThank you for your message and using UPS.\r\nYou have reached the UPS international Consignment team.  Our responsibility is to assign import shipments to the desired broker.  UPS is a fully licensed broker and can clear shipments on your behalf.  If additional information is required to process your shipment, UPS will contact you.\r\nIf you are looking for addition assistance, please contact our UPS helpdesk or use the resources UPS provides.\r\nUPS Website  UPS Global Shipping & Logistics Solutions<https://www.ups.com/us/en/global.page>\r\nSelect your preferred language and location.\r\nHelp Desk\r\nOur helpdesk will be able to provide assistance on any issue\r\nFrom the link above click “SUPPORT” and “CONTACT US” or call 1-800-742-5877 or by email at custsvccaen@ups.com<mailto:custsvccaen@ups.com>\r\nUPS Tracking\r\nTo track your package visit UPS website.\r\nFrom the link above click “TRACKING”\r\nBrokerage Charges\r\nYour import charges will only appear on the UPS website after your goods have entered Canada and CBSA has accepted the entry UPS submitted on your behalf.\r\nFrom the link above click “TRACKING” and there will be a link to “PAY NOW” in the box once the conditions above are met.\r\nUPS My Choice\r\nIf you sign up for a free UPS My Choice account, you can decide how, where and when home deliveries occur. Online or by mobile, with UPS My Choice you can put your plans ahead of the package.\r\nFrom the link above click the “GET HELP” link below the box provided for your Tracking Number\r\nUPS Billing Centre\r\nExisting customers may contact the Billing Centre to manage all of your UPS invoices from a single location.\r\nFrom the link above click “Billing”\r\n________________________________________\r\n\r\nMerci pour votre message et de faire appel à UPS.\r\nL’équipe de consignation internationale d’UPS s’occupe d’attribuer les envois importés au courtier en douane désigné. Saviez-vous qu’UPS est un courtier en douane pleinement autorisé qui peut dédouaner vos envois en votre nom? Nous communiquerons avec vous si d’autres renseignements sont requis pour traiter votre envoi.\r\nSi vous avez besoin d’un soutien additionnel, veuillez communiquer avec le Service d’assistance d’UPS ou consultez les ressources mises à votre disposition.\r\nSite Web d’UPS – Solutions d'expédition et de logistique mondiales<https://www.ups.com/us/en/global.page>\r\nSélectionnez votre langue et emplacement préférés.\r\n\r\nService d’assistance\r\nNotre Service d’assistance pourra vous aider avec tout problème.\r\nÀ partir du lien ci-dessus, cliquez sur ASSISTANCE, puis sur COMMUNIQUER AVEC NOUS. Vous pouvez aussi nous joindre par téléphone au 1‑800‑742‑5877 ou par courriel à custsvccaen@ups.com<mailto:custsvccaen@ups.com>.\r\nSuivi UPS\r\nPour faire le suivi de votre envoi, rendez-vous sur le site Web d’UPS.\r\nÀ partir du lien ci-dessus, cliquez sur SUIVI.\r\nFrais de courtage en douane\r\nVos frais d’importation s’afficheront sur le site Web d’UPS une fois que vos marchandises seront entrées au Canada et que l’ASFC aura accepté la déclaration qu’UPS a soumise en votre nom.\r\nÀ partir du lien ci-dessous, cliquez sur SUIVI. Un lien PAYER MAINTENANT s’affichera dans la case une fois que les exigences susmentionnées auront été remplies.\r\nUPS My Choice\r\nInscrivez-vous gratuitement à UPS My Choice pour décider de la date et du lieu de vos livraisons résidentielles. Accessible en ligne ou sur votre appareil mobile, UPS My Choice vous permet de faire passer vos plans avant vos colis.\r\nÀ partir du lien ci-dessus, cliquez sur le lien OBTENIR DE L’AIDE sous la case prévue pour votre numéro de suivi.\r\nCentre de facturation UPS\r\nSi vous êtes un client d’UPS, vous pouvez utiliser le Centre de facturation pour gérer toutes vos factures UPS à partir d’un guichet unique.\r\nÀ partir du lien ci-dessus, cliquez sur Facturation.\r\n\r\n\r\n",
      "user_id": 158007168136,
      "created_at": "2025-11-19T05:45:26Z",
      "updated_at": "2025-11-19T05:45:26Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}