{
  "id": 6345,
  "subject": "Raceteam Sponsorship Mazda MaX-5",
  "description_text": "Dear Simsonn,\r\n\r\nMy name is Brandon Oosterink, a motivated and ambitious racing driver\r\ndetermined to make my dream in motorsport a reality. It would be an honor\r\nif you would consider supporting me on my journey toward competing in the\r\nMazda MaX-5 Cup.\r\n\r\nFor the past six years, I have also been actively involved in sim racing,\r\nwhich has become an essential part of my development as a driver. I train\r\nalmost daily using advanced simulators to refine my racecraft, improve\r\nconsistency, and study tracks in great detail. This dedication has helped\r\nme build strong fundamentals that translate directly to real-world racing.\r\nBecause of this background, I believe that collaborating with Simsonn known\r\nfor its innovation and commitment to performance would be a meaningful and\r\nnatural fit.\r\n\r\nI am now ready to take the next step, transitioning into car racing with\r\nthe goal of making my debut in the Mazda MaX-5 Cup. This championship is\r\none of the most competitive and popular entry-level racing series in the\r\nNetherlands, attracting significant media coverage through RTL GP,\r\nAutosport.nl, and various social media channels. This creates excellent\r\nexposure opportunities for all involved partners, providing a powerful\r\nplatform to showcase the Simsonn brand in a positive and dynamic way.\r\n\r\nIn addition, my personal online reach has grown substantially over the past\r\nmonths. In the last five months alone, my videos have accumulated over 30\r\nmillion views across multiple platforms. This allows me to present your\r\nbrand in a fresh, authentic, and effective manner to a young and highly\r\nengaged audience.\r\n\r\nMoreover, my participation in the Mazda MaX-5 Cup will be followed by a\r\nfilm crew producing a documentary about my journey toward professional\r\nracing. This series will be published on YouTube and shared across various\r\nsocial media platforms. The goal is to show what it truly takes to build a\r\nmotorsport career that it’s not as easy as it may seem, but above all, a\r\nstory of passion, perseverance, and growth. Naturally, this documentary\r\nwill also provide additional exposure for your brand, which will be visible\r\non-screen and integrated into the inspiring narrative of this racing\r\njourney.\r\n\r\nI would love to involve Simsonn in this adventure by featuring your brand\r\non my racing suit, helmet, and car. To achieve a strong and professional\r\nappearance together, I would like to request your support as a sponsorship\r\ncontribution. Your brand will receive prominent visibility during every\r\nrace and throughout the documentary both on the circuit and across online\r\nmedia.\r\n\r\nFurthermore, you are warmly invited to attend any of the races to meet the\r\nteam, experience the atmosphere firsthand, and see how your brand comes to\r\nlife during official championship events. This not only offers a unique\r\nexperience but also strengthens the personal connection between Simsonn and\r\nthe world of motorsport.\r\n\r\nI would be delighted to further discuss my plans and the potential\r\ncollaboration in a meeting or call at your convenience.\r\n\r\nThank you very much for your time and consideration.\r\n\r\nKind regards,\r\nBrandon Oosterink\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-11-19T08:34:07Z",
  "updated_at": "2025-11-21T11:33:44Z",
  "requester_id": 158007172324,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158012567652,
      "body_text": "Hi brandon,    May I view your channel? I shall submit it to our manager for approval.",
      "user_id": 158001343601,
      "created_at": "2025-11-19T09:34:31Z",
      "updated_at": "2025-11-19T09:34:31Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158012568018,
      "body_text": "Hi Simsonn,\r\n\r\nThank you for your reply!\r\n\r\nHere’s an overview of the social media channels I currently manage. YouTube\r\nwill be added soon, but that channel is still in development. All the\r\ncontent you’ll find there such as edits and highlights from Formula 1 has\r\nbeen created by me. I mainly do this to learn what engages people and how\r\nto capture their attention. That’s why you’ll see a variety of topics and\r\nniches in my content.\r\n\r\nHere are the links to my channels:\r\n\r\nTikTok: https://www.tiktok.com/@brandonf1contend\r\nTikTok: https://www.tiktok.com/@bralav.ae?lang=nl-NL\r\nInstagram: https://www.instagram.com/bralav.07/\r\nInstagram: https://www.instagram.com/brandonf1contend/\r\n\r\nIn addition, I’m considering documenting my karting career in the form of a\r\nYouTube documentary. I want to show everything that comes with it, both the\r\nhighs and the challenges of the sport. For inspiration, I’ve been looking\r\nat productions like these:\r\n\r\nhttps://www.youtube.com/watch?v=pfTbl52yVPg\r\nhttps://www.youtube.com/watch?v=kbzCTYZ9A1s&t=137s\r\n\r\nSince I’m currently studying Media Design, I already have solid experience\r\nin filming and editing. However, I’m considering bringing someone along or\r\nhiring someone to handle the filming so I can fully focus on racing and\r\nperforming on track.\r\n\r\nI have put the screenshots of the last month here down below from Instagram\r\nand the White screenshots are those from tiktok but longer ago.\r\n\r\nI’d love to hear what you think about this and if you might have any tips\r\nor ideas!\r\n\r\nBest regards,\r\nBrandon Oosterink\r\n\r\n\r\n\r\nOp wo 19 nov 2025 om 10:34 schreef service@simsonn.com <service@simsonn.com\r\n>:\r\n\r\n> Hi brandon,\r\n>\r\n> May I view your channel? I shall submit it to our manager for approval.\r\n>\r\n>\r\n>\r\n> ",
      "user_id": 158007172324,
      "created_at": "2025-11-19T09:51:15Z",
      "updated_at": "2025-11-19T09:51:15Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158012572355,
      "body_text": "Hi brandon,    We would be pleased to learn more about your plans and potential collaboration opportunities.",
      "user_id": 158001343601,
      "created_at": "2025-11-19T11:01:35Z",
      "updated_at": "2025-11-19T11:01:35Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158012572933,
      "body_text": "Hi Simsonn,\r\n\r\nI would like to share my plans for the upcoming racing season and explain\r\nhow a collaboration between us could create strong visibility and value for\r\nboth sides.\r\n\r\nThe new season will begin in March/April, and my goal is to have everything\r\nfully prepared by then. To get ready, I will be training extensively on my\r\nhome simulator. I believe that using your equipment would significantly\r\nimprove the quality of my training, and it would also allow us to showcase\r\nyour products in a very authentic and professional way.\r\n\r\nAs part of the documentary being filmed about my journey into motorsport,\r\nwe will capture a lot of footage at my home specifically focusing on\r\ntraining sessions, behind-the-scenes preparation, and the tools that help\r\nme progress. This gives us an excellent opportunity to feature Simsonn\r\nprominently. We plan to produce additional videos dedicated entirely to\r\nreviewing, showing, and experiencing your products.\r\n\r\nIn real racing, the car will be fully stickered for the season, and your\r\nlogo would be placed on the car, my suit, and included visibly throughout\r\nthe documentary. This guarantees that Simsonn will be represented both\r\non-track and online to a growing audience.\r\n\r\nLooking ahead to 2026, my goal is to achieve the same or even greater reach\r\nand online visibility as in 2025, continuing the growth of my channels and\r\npresence in motorsport. I would be very happy to continue working with\r\nSimsonn as a season sponsor as my career develops further.\r\n\r\nIn order to participate in the Mazda MaX-5 Cup at a competitive level, I am\r\nrequired to cover essential costs such as the race car, team support,\r\nmaintenance, and race entries. Therefore, part of the sponsorship\r\ncontribution would help fund these key elements that make it possible for\r\nme to compete throughout the season. Your support would directly enable me\r\nto take this important step in my racing career while representing the\r\nSimsonn brand with professionalism and dedication.\r\n\r\nIf this aligns with your vision, I would love to discuss the possibilities\r\nwith you.\r\n\r\nKind regards,\r\nBrandon Oosterink\r\n\r\nOp wo 19 nov 2025 om 12:01 schreef service@simsonn.com <service@simsonn.com\r\n>:\r\n\r\n> Hi brandon,\r\n>\r\n> We would be pleased to learn more about your plans and potential\r\n> collaboration opportunities.\r\n>\r\n> ",
      "user_id": 158007172324,
      "created_at": "2025-11-19T11:22:42Z",
      "updated_at": "2025-11-19T11:22:42Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}