{
  "id": 6379,
  "subject": "Sim racing equipment",
  "description_text": "﻿ To whom it may concern, I found on ali express your simracing equipment, and I found them very interesting, but I have a couple of questions about the Xpro ultra pedals and the hexagonal shifter.\r\n\r\nAre they compatible with simagic environment (wheel and wheelbase)?\r\n\r\nHave they their own power source or is the computer?\r\n\r\nIs it possible to use the shifter as sequential shifter?\r\n\r\nShould I connect the shifter to the controller or to the pc?\r\n\r\nThanks and Best Regards\r\n\r\n\r\n\r\n\r\n\r\n\r\nInviato da iPhone\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-11-19T21:27:00Z",
  "updated_at": "2025-12-05T11:34:21Z",
  "requester_id": 158007180526,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158012738667,
      "body_text": "Hi Andrea Sartirana,  Our devices are compatible with Simagic and only need to be connected to the computer via USB 3.0. We will soon discontinue the dual-function shifters with sequential and H-pattern modes. ",
      "user_id": 158000445778,
      "created_at": "2025-11-22T03:13:45Z",
      "updated_at": "2025-11-22T03:13:45Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158012762773,
      "body_text": "Thank you for the answer. I would like also to ask the difference between the PRO X ultra and the PLUS X\r\n\r\nThanks and Best Regards\r\nInviato da iPhone\r\n\r\n> Il giorno 22 nov 2025, alle ore 04:13, service@simsonn.com ha scritto:\r\n> \r\n> ﻿\r\n> Hi Andrea Sartirana,\r\n> \r\n> Our devices are compatible with Simagic and only need to be connected to the computer via USB 3.0. We will soon discontinue the dual-function shifters with sequential and H-pattern modes. \r\n> \r\n> \r\n> ",
      "user_id": 158007180526,
      "created_at": "2025-11-22T17:15:14Z",
      "updated_at": "2025-11-22T17:15:14Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158013495457,
      "body_text": "Hi Andrea Sartirana,      I apologize for not getting back to you sooner.      Pro X Ultra and Plus X are our two latest pedals. The Pro X Ultra pedal is Simsonn's flagship product, featuring an adjustable hydraulic damper and more advanced electronic components within the control unit. It delivers precise control, making it ideal for experienced players seeking fine-tuned adjustments. Equipped with an RGB system that provides feedback based on in-game telemetry data, it boasts a more aesthetically pleasing lighting design and form factor to enhance the overall atmosphere. However, should these features be unnecessary, the Plus X pedal offers superior value for money – employing the same high-quality elastomer, a 200kg sensor, and equally robust construction.",
      "user_id": 158001343601,
      "created_at": "2025-12-05T11:34:20Z",
      "updated_at": "2025-12-05T11:34:20Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}