{
  "id": 6494,
  "subject": "Pedals / SQ Shifter",
  "description_text": "Hello,\r\n\r\nI recently purchased your Pro X pedals and SQ shifter for my new sim rig through Amazon. I think the Simsonn brand makes amazing products especially at these price points.\r\n\r\nI've been racing with the pedals and shifter for a couple months now with no issues and then my clutch stopped working during a race. The acrylic mounting bracket cracked around the mounting screw for the load cell were the spring sits. The load cell also goes to 100% when static. When pushing on the LC the opposite direction it goes back to zero. Like its reversed. I plug the throttle in its place and work fine.\r\nSo I have no clutch but can still race.\r\n\r\na week later the screws on the SQ shifter backed out during a race, one coming completely out ( upper screws on the spring axle ) and the 2 below on the lower pivot axle were both half way. So just loose. I had another screw in my junk and even added spring washers to all 4 screws. If I tighten them snug not even tight, the shift lever binds up. The reason I used the spring washers. But after a short race the still loosen back up. Also I can no longer get the detent right on the lever anymore so I am throwing in the towel. I am reaching out to you before I mess around anymore or completely take it apart.\r\n\r\nAny suggestions or should I send them to you guys?  I am in the US.\r\n\r\nSincerely,\r\n\r\nScott Cole\r\n\r\n\r\n",
  "status": 4,
  "priority": 4,
  "created_at": "2025-11-21T16:02:39Z",
  "updated_at": "2026-01-12T09:56:46Z",
  "requester_id": 158007229872,
  "responder_id": 158007774607,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158012738199,
      "body_text": "Hi Scott Cole,  You can send us a photo to show which part is damaged or missing. We will confirm the required parts with you and send the replacement immediately. Please don’t worry ",
      "user_id": 158000445778,
      "created_at": "2025-11-22T02:35:26Z",
      "updated_at": "2025-11-22T02:35:26Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158012919490,
      "body_text": "First let me say what amazing customer service this far. I will for sure spread the news how fast Simsonn responded back to my needs. ( with in hours ) First class service  for sure!\r\n\r\nSQ Shifter = I believe I figured it out. Down inside I found a broken spring end as seen in the photos and fairly certain all I will need. ( spring )\r\n\r\nPedal = the acrylic load cell piece like the one in the photo. ( the one in the photo I took off another pedal to show you ).\r\n\r\n1kg load cell = when I plug it in it goes right to 100%. If I plug in the other 1kg lc its normal.\r\n\r\nI hope this helps. You can reach me any time.\r\nAgain, thank you so much for the great customer service and products.\r\n\r\nScott Cole\r\n949-701-5758 cell\r\n10289 West Achillea St.\r\nStar, Idaho 83669\r\nUnited States\r\n________________________________\r\n",
      "user_id": 158007229872,
      "created_at": "2025-11-26T01:42:13Z",
      "updated_at": "2025-11-26T01:42:13Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158012943818,
      "body_text": "Hi Scott Cole,  We are sorry that your Plus X clutch and SQ Pro experienced component damage. Please provide your contact name, phone number, and address. Tomorrow, we will send you a reinforced version of the clutch spring support and the gear sequence spring for replacement. ",
      "user_id": 158000445778,
      "created_at": "2025-11-26T12:01:46Z",
      "updated_at": "2025-11-26T12:01:46Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158012946576,
      "body_text": "You guys are amazing!\r\n\r\n10289 West Achillea St.\r\nStar, Idaho 83669\r\n949-701-5758 cell\r\n________________________________\r\n",
      "user_id": 158007229872,
      "created_at": "2025-11-26T13:30:51Z",
      "updated_at": "2025-11-26T13:30:51Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158013038157,
      "body_text": "Hi Scott Cole,    Please provide your order number, name, phone number, and address. I will forward it to our operations team to send you the replacement parts. Thank you!",
      "user_id": 158000445778,
      "created_at": "2025-11-28T04:16:21Z",
      "updated_at": "2025-11-28T04:16:21Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158013078094,
      "body_text": "Order #111-5862684-8283438 ( Shifter )\r\nOrder #112-4838023-878905 ( Pedals )\r\n\r\nScott Cole\r\n949-701-5758 cell\r\n\r\n10289 West Achillea St.\r\nStar, Idaho 83669\r\n________________________________\r\n",
      "user_id": 158007229872,
      "created_at": "2025-11-28T18:42:29Z",
      "updated_at": "2025-11-28T18:42:29Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014101412,
      "body_text": "Hello Simsonn\r\n\r\nI'm just following up on this request and wondering if I will get a heads up notice when the parts are shipped.\r\n\r\nSincerely,\r\n\r\nScott\r\n\r\n\r\n________________________________\r\n",
      "user_id": 158007229872,
      "created_at": "2025-12-08T03:53:48Z",
      "updated_at": "2025-12-08T03:53:48Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014119301,
      "body_text": "Hi Scott Cole,    Our operations team will send the replacement to you as soon as possible. We apologize for the delayed response due to the large backlog of emails during Black Friday.",
      "user_id": 158000445778,
      "created_at": "2025-12-08T10:30:58Z",
      "updated_at": "2025-12-08T10:30:58Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158015008979,
      "body_text": "Hello\r\n\r\nSo I have tracked this order with the provided tracking number from JS Express. That company shows that it was delievered yesterday @ 5.23am to Star Idaho. No address. I recieved a text from another company calling themselves UniUni with a different tracking number. That also showes delivered to Star Idaho. No address. Looking online, peaple are saying it to be a scam, horrible and nothing good. I have full security cameras around my entire home and no deliveries have been made.\r\n\r\nWhat is my next step? Can you provide any more info from your shipping companies? Of course I can't get a hold of any of these 2 shipping companies.\r\n\r\nThx\r\n________________________________\r\n",
      "user_id": 158007229872,
      "created_at": "2025-12-23T22:38:17Z",
      "updated_at": "2025-12-23T22:38:17Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158015013469,
      "body_text": "Hello again. I just returned home and went searching for my package. I found it at a different door. Thank You very much. I did receive 2 of the 3 parts needed plus a few spares. This is great and I appreciate it, but I do still need a 1kg load cell as the one I have Peggs out past 100% soon as I plug it in to the module. I had this listed a long with the photos.\r\n\r\nPlease let me know,\r\n\r\nScott\r\n\r\n________________________________\r\n",
      "user_id": 158007229872,
      "created_at": "2025-12-24T00:48:57Z",
      "updated_at": "2025-12-24T00:48:57Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158015182850,
      "body_text": "Hi Scott Cole,  as per your case, please try this:  Please click “Offset” in the software and then recalibrate the pedals. After calibration, the blue signal bar should reach 100%. You can then proceed to bind the controls in the game. Detailed instructions can be found in the user manual. ",
      "user_id": 158007774607,
      "created_at": "2025-12-29T08:09:22Z",
      "updated_at": "2025-12-29T08:09:22Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158016577143,
      "body_text": "I just wanted to say Thank You guys for all your help and the spare parts. Great customer service!\r\n________________________________\r\n",
      "user_id": 158007229872,
      "created_at": "2026-01-09T16:30:22Z",
      "updated_at": "2026-01-09T16:30:22Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}