{
  "id": 6560,
  "subject": "New Pedals with Deep Scratch on Pedal Plate",
  "description_text": "Hey, I just received my pedals. I haven't set them up yet, but I noticed straight out of the box that the pedal plate has a pretty deep scratch on it. [image: image.png]",
  "status": 4,
  "priority": 4,
  "created_at": "2025-11-22T18:45:41Z",
  "updated_at": "2025-12-08T10:24:51Z",
  "requester_id": 158007258807,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158012764715,
      "body_text": "I can't view the ticket; whenever I log in with Google, it says I need to create a new ticket. On Sat, Nov 22, 2025 at 1:50 PM service @simsonn.com",
      "user_id": 158007258807,
      "created_at": "2025-11-22T19:03:07Z",
      "updated_at": "2025-11-22T19:03:07Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158012769268,
      "body_text": "Able to finally see the ticket. I'm waiting on a couple of parts to mount the pedals to my rig since it's not compatible (my fault, my pedal tray is small), so I'm waiting to put them fully together at the moment.",
      "user_id": 158007258807,
      "created_at": "2025-11-23T01:20:56Z",
      "updated_at": "2025-11-23T01:20:56Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012799412,
      "body_text": "Hi there, Please provide your order number and clearer photos. We'll handle it for you—no worries.",
      "user_id": 158001343601,
      "created_at": "2025-11-24T07:52:11Z",
      "updated_at": "2025-11-24T07:52:11Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158012801845,
      "body_text": "I'm pretty new to simracing, and just today I put the pedals and the plate together (not mounted in my rig or set up yet). This scratch is on the heel plate part, and it was there as soon as I opened the box. I ordered from your store on AliExpress, so I hope that doesn't complicate things, but I made sure it was your store. My AliExpress order ID is 8207023274918643. Everything in the box was a little unorganized, such as some of the items not being in the foam but under it. I'm not sure if it was just shuffled in shipping or not; I hope that's the case and someone didn't return them already, which is why they didn't look exactly brand new, with little specks and smudges on the black, if you get what I'm saying. I could definitely just be paranoid because of the big scratch I saw right as I opened the first box, haha. Thanks in advance! I haven't tried them out yet functionality-wise; I've only put them on that plate so far, but they seem like they should work great, and it looks like a fantastic pedal. It's really just it not looking brand new that's my only concern, but it could be AliExpress things more than you guys. Thanks again, hope to use your pedals for years to come <3",
      "user_id": 158007258807,
      "created_at": "2025-11-24T08:18:20Z",
      "updated_at": "2025-11-24T08:18:20Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012801922,
      "body_text": "Worth noting, the scratched plate's box was organized. I was talking more about the cables and smaller items in the bigger box when I said some were under the foam.",
      "user_id": 158007258807,
      "created_at": "2025-11-24T08:22:08Z",
      "updated_at": "2025-11-24T08:22:08Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012802631,
      "body_text": "Now that I'm talking to you and thinking about it, I'm remembering a lot. The pedals had previously been bolted in before because there was circular grooving/silver marks where the pedal would be bolted in. At the time, I also just assumed you guys test them before sending them out, but I really have no clue. Another thing, all the washers in the mounting bag were bent like crazy; I don't know if that's by design to strengthen it or not. I'm very new to all this, and this hobby has been testing my building ability. After looking back at the pictures now to send them to you, I think I might just have been too excited to get them and should have been more wary of them being returned already, unless you guys test them first, because they were definitely mounted before with those bent washers, based on the pedal marks, 100% before I touched them, or I hope it's pre-designed/tested.",
      "user_id": 158007258807,
      "created_at": "2025-11-24T08:46:56Z",
      "updated_at": "2025-11-24T08:46:56Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012802960,
      "body_text": "And you can see what I mean, I think, in the picture of the zoomed-in brake pedal plate, what I mean by all the little particle stuff just leading it to not look brand new out of the box.",
      "user_id": 158007258807,
      "created_at": "2025-11-24T08:48:34Z",
      "updated_at": "2025-11-24T08:48:34Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012803480,
      "body_text": "After watching someone else's unboxing and watching closely, they did not have the silver circles where someone bolted them already, so I think these were definitely returned now unless I'm mistaken, which sucks.",
      "user_id": 158007258807,
      "created_at": "2025-11-24T09:00:16Z",
      "updated_at": "2025-11-24T09:00:16Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012803533,
      "body_text": "Here's a screenshot from the video that I just referenced to confirm mine have been bolted into a pedal plate before.",
      "user_id": 158007258807,
      "created_at": "2025-11-24T09:02:35Z",
      "updated_at": "2025-11-24T09:02:35Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012803724,
      "body_text": "I promise you, I haven't gotten far enough to even think about putting a middle nut in a pedal yet because I'm trying to figure out how to fit them on my rig currently, so they haven't been mounted yet, just moved on the plate to get an idea so far.",
      "user_id": 158007258807,
      "created_at": "2025-11-24T09:10:34Z",
      "updated_at": "2025-11-24T09:10:34Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012849813,
      "body_text": "I finally thought of a way to mount them without using your baseplate, going to give it a shot soon to see if they at least function properly. The shipping came late, and they've just been sitting in my room for days, so I'm dreading the idea of returning them and just want to get my rig going. I just hope they work at this point and they weren't returned previously due to performance issues, but I'm still disappointed in the appearance.",
      "user_id": 158007258807,
      "created_at": "2025-11-24T22:19:33Z",
      "updated_at": "2025-11-24T22:19:33Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012858428,
      "body_text": "From AliExpress",
      "user_id": 158001343601,
      "created_at": "2025-11-25T04:04:28Z",
      "updated_at": "2025-11-25T04:04:28Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158013148289,
      "body_text": "HANDLE THIS PLEASE FOR THE LOVE OF GOD, YOUR REPRESENTATIVE TOLD ME TO THROW THEM AWAY AND THEY'LL REFUND ME, AND I'M NOT GETTING AN ANSWER AFTER DESTROYING THEM EVEN MORE. THEY'RE IN THE DUMP AND I HAVE NOTHING.",
      "user_id": 158007258807,
      "created_at": "2025-11-30T18:41:04Z",
      "updated_at": "2025-11-30T18:41:04Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158013158447,
      "body_text": "Hi there, Could you provide more complete photos? I will assist you in resolving this. We are investigating to see which warehouse had an issue that caused the wrong product to be shipped.",
      "user_id": 158000445778,
      "created_at": "2025-12-01T06:01:20Z",
      "updated_at": "2025-12-01T06:01:20Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158013158813,
      "body_text": "What would you like images of? I can send everything I have. I no longer have the pedals, so I can't take more. The pedals were clearly used; I thought it was just the scratch at first.",
      "user_id": 158007258807,
      "created_at": "2025-12-01T06:13:44Z",
      "updated_at": "2025-12-01T06:13:44Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158013249008,
      "body_text": "Investigate making up for this! What about your customer? I ordered this 3 weeks ago, and I'm still fighting for my refund on an item your representative told me to throw away. [image: image.png] HE ONLY RESPONDS WHEN I OPEN A DISPUTE. THIS IS FOUL PLAY. The dispute was canceled for 4 days while my pedals are sitting in the dump somewhere. On Mon, Dec 1, 2025 at 1:01 AM service @simsonn.com",
      "user_id": 158007258807,
      "created_at": "2025-12-02T07:13:36Z",
      "updated_at": "2025-12-02T07:13:36Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ],
  "available_langs": []
}