{
  "id": 6560,
  "subject": "",
  "description_text": "hey i just got my pedals, havent set them up yet but noticed straight out\r\nof the box the pedal plate has a pretty deep scratch on it. [image:\r\nimage.png]\r\n\r\n",
  "status": 4,
  "priority": 4,
  "created_at": "2025-11-22T18:45:41Z",
  "updated_at": "2025-12-08T10:24:51Z",
  "requester_id": 158007258807,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158012764715,
      "body_text": "i cant view the ticket, whenever i log in with google it says i need to\r\ncreate a new ticket\r\n\r\n\r\nOn Sat, Nov 22, 2025 at 1:50 PM service@simsonn.com ",
      "user_id": 158007258807,
      "created_at": "2025-11-22T19:03:07Z",
      "updated_at": "2025-11-22T19:03:07Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158012769268,
      "body_text": "able to finally see the ticket. im waiting on a couple parts to mount the pedals to my rig since its not compatible (my fault my pedal tray is small) so im waiting to put them fully together at the moment ",
      "user_id": 158007258807,
      "created_at": "2025-11-23T01:20:56Z",
      "updated_at": "2025-11-23T01:20:56Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012799412,
      "body_text": "Hi yuh ight,    Please provide your order number and clearer photos. We'll handle it for you—no worries.",
      "user_id": 158001343601,
      "created_at": "2025-11-24T07:52:11Z",
      "updated_at": "2025-11-24T07:52:11Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158012801845,
      "body_text": "im pretty new to simracing and i just today put the pedals and the plate together (not mounted in my rig or setup yet)  this is on the heelplate part from as soon as i opened the box. i ordered from your store on aliexpress so i hope that doesnt complicate things but i made sure it was your store. my aliexpress order ID is 8207023274918643 . everything in the box was a little unorganized such as some of the things being not in the foam but under it in the box. im not sure if it was just shuffled in shipping or not, i hope thats the case and someone didnt return them already which is why they just didnt look exactly new new with like specs of things and smudges on the black if you get what im saying. i could definitely just be being paranoid because of the big ole scratch i saw right as i opened the first box as well haha thanks in advanced! i havent tried them out yet functionality wise, only put them on that plate so far but they seem like they should work great and it looks like a fantastic pedal its really just it not looking brand new is my only concern but could be aliexpress things more than you guys. thanks again hope to use your pedals for years to come <3",
      "user_id": 158007258807,
      "created_at": "2025-11-24T08:18:20Z",
      "updated_at": "2025-11-24T08:18:20Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012801922,
      "body_text": "worth noting the scratched plates box was organized, i was talking more the cables, smaller items in the bigger box when i said some were under the foam",
      "user_id": 158007258807,
      "created_at": "2025-11-24T08:22:08Z",
      "updated_at": "2025-11-24T08:22:08Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012802631,
      "body_text": "now that im talking to you and thinking about it im remembering a lot, so the pedals had previously been bolted in before because there was circle grooving/silver where the pedal would be bolted in. at the time i also just assumed you guys test them before sending them out but i really have no clue. another thing all the washers in the mounting bag were bent like crazy idk if thats by design to strengthen it or not im very new to all this and this hobby has been testing my building ability. after looking back at the pictures now to send them to you i think i might just have been too excited to get them and should have been more weary of them being returned already, unless you guys test them first because they were definitely mounted before with those bent washers based on the pedal marks 100% before i touched them or i hope its predesigned/tested",
      "user_id": 158007258807,
      "created_at": "2025-11-24T08:46:56Z",
      "updated_at": "2025-11-24T08:46:56Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012802960,
      "body_text": "and you can see what i mean i think in the picture of the zoomed in brake pedal plate what i mean by all the little particle stuff just leading it to not look new new out of the box",
      "user_id": 158007258807,
      "created_at": "2025-11-24T08:48:34Z",
      "updated_at": "2025-11-24T08:48:34Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012803480,
      "body_text": "after watching someone elses unboxing and watching closely they did not have the silver circles where someone bolted them already so i think these were definetly returned now unless im mistaken which sucks",
      "user_id": 158007258807,
      "created_at": "2025-11-24T09:00:16Z",
      "updated_at": "2025-11-24T09:00:16Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012803533,
      "body_text": "heres a screenshot from the video that i just referenced to confirm mine have been bolted into a pedal plate before",
      "user_id": 158007258807,
      "created_at": "2025-11-24T09:02:35Z",
      "updated_at": "2025-11-24T09:02:35Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012803724,
      "body_text": "i promise you i havent gotten far enough to even think about putting a middle nut in a pedal yet because im trying to figure out how to fit them on my rig currently so they havent been mounted yet just moved on the plate to get an idea so far",
      "user_id": 158007258807,
      "created_at": "2025-11-24T09:10:34Z",
      "updated_at": "2025-11-24T09:10:34Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012849813,
      "body_text": " i finally thought of a way to mount them without using your baseplate, going to give it a shot soon to see if they at least function properly. the shipping came late and theyve just been sitting in my room for days so im dreading the idea of returning them and just want to get my rig going. i just hope they work at this point and they werent returned previously due to performance issues but im still disappointed in the appearance  ",
      "user_id": 158007258807,
      "created_at": "2025-11-24T22:19:33Z",
      "updated_at": "2025-11-24T22:19:33Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158012858428,
      "body_text": "速卖通的",
      "user_id": 158001343601,
      "created_at": "2025-11-25T04:04:28Z",
      "updated_at": "2025-11-25T04:04:28Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158013148289,
      "body_text": "HANDLE THIS PLEASE FOR THE LOVE OF GOD, YOUR REPRESENTITIVE TOLD ME TO THROW THEM AWAY AND THEYLL REFUND ME AND IM NOT GETTING AN ANSWER AFTER DESTROYING THEM EVEN MORE. THEYRE IN THE DUMP AND I HAVE NOTH8GN",
      "user_id": 158007258807,
      "created_at": "2025-11-30T18:41:04Z",
      "updated_at": "2025-11-30T18:41:04Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158013158447,
      "body_text": "Hi yuh ight,  Could you provide more complete photos? I will assist you in resolving this. We are investigating to see which warehouse had an issue that caused the wrong product to be shipped. ",
      "user_id": 158000445778,
      "created_at": "2025-12-01T06:01:20Z",
      "updated_at": "2025-12-01T06:01:20Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158013158813,
      "body_text": "what would you like images of, i can send everything i have. i no longer have the pedals anymore so i cant take more. the pedals were clearly used, i thought it was just the scratch at first.",
      "user_id": 158007258807,
      "created_at": "2025-12-01T06:13:44Z",
      "updated_at": "2025-12-01T06:13:44Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158013249008,
      "body_text": "investigate making up for this! what about your customer? i ordered this 3\r\nweeks ago and im still fighting for my refund on an item your\r\nrepresentative told me to throw away.[image: image.png]HE ONLY RESPONDS\r\nWHEN I OPEN A DISPUTE THIS IS FOUL PLAY, the dispute was cancelled for 4\r\ndays while my pedals are sitting in the dump somewhere\r\n\r\nOn Mon, Dec 1, 2025 at 1:01 AM service@simsonn.com ",
      "user_id": 158007258807,
      "created_at": "2025-12-02T07:13:36Z",
      "updated_at": "2025-12-02T07:13:36Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}