{
  "id": 670,
  "subject": "Order JSEXS0376372782YQ missing items",
  "description_text": "Hello, I have received the pedals from this order but the Haptic motors are\r\nmissing. I only received a single box. Should I await second shipment with\r\nthe Haptic motors or there has been an issue? Please advise what to do next\r\n\r\nThank you!\r\n\r\n",
  "status": 2,
  "priority": 4,
  "created_at": "2025-06-21T08:05:14Z",
  "updated_at": "2025-07-31T05:40:51Z",
  "requester_id": 158001510355,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158003080994,
      "body_text": "Hi Ivaylo Grigorov,  Due to delays in the surface finishing of the VAM Pro housing, the first batch of orders is expected to begin shipping between June 16th and 18th. International express shipping will be used, ensuring fast delivery.",
      "user_id": 158000445778,
      "created_at": "2025-06-14T08:34:47Z",
      "updated_at": "2025-06-14T08:34:47Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158003677569,
      "body_text": "ID 为 438 的工单已合并到此工单。",
      "user_id": 158000445778,
      "created_at": "2025-06-21T15:37:12Z",
      "updated_at": "2025-06-21T15:37:12Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158003677570,
      "body_text": "合并来自工单438  \n      主题: Order: JSEXS0376372782YQ  \n      描述:  Hi, I only received the pedals. Haptic motors are missing. Delivery came as single box. Please advice what to do next. Thank you",
      "user_id": 158000445778,
      "created_at": "2025-06-21T15:37:12Z",
      "updated_at": "2025-06-21T15:37:12Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158003677575,
      "body_text": "Hi Ivaylo Grigorov,     The motor has already been shipped. Below is the latest tracking information for your reference. ",
      "user_id": 158000445778,
      "created_at": "2025-06-21T15:39:29Z",
      "updated_at": "2025-06-21T15:39:29Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158003677717,
      "body_text": "Thank you for the update. Much appreciated\r\n\r\n",
      "user_id": 158001510355,
      "created_at": "2025-06-21T16:48:34Z",
      "updated_at": "2025-06-21T16:48:34Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158003835520,
      "body_text": "Hello again, I have received the haptic motors set but there is an issue\r\nwith one of the mounting plates. I have the Plus X (which I ordered few\r\nweeks ago) and my throttle and clutch pedal use the narrower frame.\r\nTherefore the wide plate provided with the motors only fits the brake. In\r\nthe package I received 2 wide motor plates and 1 thinner plate that mounts\r\nat a 90 degree angle. In the configuration I have received (2 wide and 1\r\nthin plates) I can only install 2 of the three motors. In order to\r\nsuccessfully mount the third motor, I will need another one of the thinner\r\nplates (same as the one clutch plate provided). Only then I will be able to\r\nmount all three motors. In the installation booklet provided, the pedals\r\nare shown to be wide frame on the brake and pedal.\r\n\r\nI assume there will be other customers with similar problem, is it possible\r\nto send me just one more narrow clutch plate? This would save us both\r\nresources as the motors are otherwise fully functional. Also for the future\r\nyou may need to send an extra narrow clutch mounting plate in case other\r\ncustomers have similar narrow frame pedals. Thank you in advance!\r\n\r\n\r\nOn Sat, Jun 21, 2025 at 4:39 PM service@simsonn.com ",
      "user_id": 158001510355,
      "created_at": "2025-06-25T09:28:23Z",
      "updated_at": "2025-06-25T09:28:23Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158003922819,
      "body_text": "Hi I have received the set of motors but the throttle pedal uses thinner\r\nframe than pictured. One of the provided plates doesn't fit. I could use\r\nthe clutch plate to fit the throttle but then I can't mount the clutch\r\nmotor... Please advice what to do.\r\n\r\n",
      "user_id": 158001510355,
      "created_at": "2025-06-26T16:04:21Z",
      "updated_at": "2025-06-26T16:04:21Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158004046204,
      "body_text": "Hi Ivaylo Grigorov,    Is the motor bracket not fitting onto the throttle pedal? You can try loosening the screws on both sides of the throttle pedal arm, then install the motor bracket, and tighten the screws afterward. If I’ve misunderstood the issue, please share a photo so we can better understand and assist you.",
      "user_id": 158000445778,
      "created_at": "2025-06-27T00:03:41Z",
      "updated_at": "2025-06-27T00:03:41Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004146747,
      "body_text": "The throttle plate doesn't fit the pedal frame because my throttle pedal\r\nseems to be the same width as the clutch. Unlike the instructions booklet,\r\nwhere the brake and throttle are shown to be the same width.\r\n\r\nI've included some pictures of me mounting one of the motors on the\r\nthrottle using the clutch plate (you can see by the orientation of the\r\nmotor.\r\n\r\nTo be able to successfully mount all three motors I will need another\r\nclutch mounting plate.\r\n\r\nThank you in advance!\r\n\r\n",
      "user_id": 158001510355,
      "created_at": "2025-06-27T08:14:57Z",
      "updated_at": "2025-06-27T08:14:57Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158004222545,
      "body_text": "Hi, I have spent past few days tinkering and apart from the mounting issue\r\n(which can be easily resolved with another clutch mounting plate), I have\r\nrun into another issue which is brake pedal activation while brake haptic\r\nmotor is active. The one on the throttle is fine. I have swapped the spare\r\nmotor which I couldn't mount on the clutch to the brake just to eliminate a\r\nmotor failure. Same issue occurs with the second motor. I have tried\r\nreducing the gain all the way down to 1% where the motor vibrations are not\r\nperceptible but the same issue occurs. While I'm at 50% brake pressure it\r\nsuddenly spikes to 100% precisely on abs activation. I have tried other\r\neffects also on the special Simsonn edition of the Simhub provided by your\r\nFacebook customer relations team.\r\n\r\nPlease advice what to do next.\r\n\r\nPlease advice\r\n\r\n",
      "user_id": 158001510355,
      "created_at": "2025-06-29T10:25:57Z",
      "updated_at": "2025-06-29T10:25:57Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158004364517,
      "body_text": "Hi Ivaylo Grigorov,    Have you downloaded the latest 2.0.8DE version of the software? Please make sure all pedals are properly connected, then unplug and replug the USB. In the software, click the “Offset” button at the top right corner to perform a zero-point calibration. After that, recalibrate the pedals and make sure to set a 5% deadzone for each one.  As for SIMHUB, they have released version 9.9.3, which includes full support for vibration feedback on our pedals. You can download the latest version directly from their official website.         If you're unsure how to proceed, you can download the Todesk tool (no registration required). Once installed, please provide your ID and temporary password, and I’ll assist you remotely. ",
      "user_id": 158000445778,
      "created_at": "2025-07-02T07:41:33Z",
      "updated_at": "2025-07-02T07:41:33Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004365040,
      "body_text": "I checked yesterday and it was 2.08 version on your website. I will try new\r\nSimhub as well.\r\n\r\nWhat are we doing with the mounting plate though? I cannot mount all my\r\nthree pedals and I have provided pictures. I need another clutch plate to\r\nbe able to mount all three pedals, please help.\r\n\r\n",
      "user_id": 158001510355,
      "created_at": "2025-07-02T07:55:08Z",
      "updated_at": "2025-07-02T07:55:08Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158004365570,
      "body_text": "Hi Ivaylo Grigorov,    Is your controller a PlusX, ProX, or ProX Ultra?",
      "user_id": 158000445778,
      "created_at": "2025-07-02T08:04:18Z",
      "updated_at": "2025-07-02T08:04:18Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004369381,
      "body_text": "Hi, my model is Plus X with the VAM Pro haptic motor set of 3.\r\n\r\nI have updated to the new Simhub but I can't seem to find any updated\r\nversion of the Simsonn Manager. Still 2.0.8 on your website as of now.\r\n\r\nThank you for your support\r\n\r\n",
      "user_id": 158001510355,
      "created_at": "2025-07-02T09:22:32Z",
      "updated_at": "2025-07-02T09:22:32Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158004375127,
      "body_text": "Hi Ivaylo Grigorov,  Currently, version 2.0.8 supports telemetry for 8 games, and version 2.0.9 will expand support to over 10 mainstream titles. However, SimHub has already released version 9.9.3, which includes compatibility with our pedals, so they are now fully functional in supported games. Also, could you please send photos of the motor and all the brackets you received? I’ll begin arranging the reshipment for you starting tomorrow. ",
      "user_id": 158000445778,
      "created_at": "2025-07-02T14:35:01Z",
      "updated_at": "2025-07-02T14:35:01Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004376955,
      "body_text": "Here are photos of the spare unmounted motor with the bracket. I have\r\nincluded included photos of the brake and throttle motors already mounted\r\nearlier in the conversation where I am using the clutch plate to mount it\r\non the throttle at 90 degrees. Can provide more if requested.\r\n\r\nSecond, I have already updated to 2.0.8 (latest available version on your\r\nwebsite as of this morning), also Simhub is up to date and the title I am\r\ninterested in (Lemans Ultimate) is already supported and motors are working\r\nin game. I have given each pedal 10% deadzone but the issue with brake\r\npedal activation still persists. I have spent the past few days testing\r\ndifferent frequencies and gain levels but it seems that the load cell\r\nitself activates. This means that even if the pedal adjacent to it rumbles,\r\nthe brake still activates (usually around 10-20% increase). Which means\r\nduring braking then the ABS activated, you get artifacts in the pedal\r\nforce, jumping from 50% to 70% for example. Similar thing happens on\r\ntraction loss if the throttle vibrates - slight brake activation.\r\n\r\nThank you for your support.\r\n\r\n\r\n\r\n",
      "user_id": 158001510355,
      "created_at": "2025-07-02T15:44:18Z",
      "updated_at": "2025-07-02T15:44:18Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158004502247,
      "body_text": "Hi Ivaylo Grigorov,    We apologize for the delayed response — our company has been in the process of relocating to a new address over the past few days, and we may have missed your message.  Regarding your question: is the VAM Pro vibration affecting the motor performance? If the issue is still present, please install the Todesk tool. If prompted to register, simply click the close button in the top-right corner to access the main interface. Then, provide your ID and temporary password, and we’ll arrange a remote session to help you troubleshoot the issue.",
      "user_id": 158000445778,
      "created_at": "2025-07-10T11:20:00Z",
      "updated_at": "2025-07-10T11:20:00Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004502274,
      "body_text": "Hi Ivaylo Grigorov,  If there’s any issue with the accessories, we can send you a replacement free of charge. ",
      "user_id": 158000445778,
      "created_at": "2025-07-10T11:24:09Z",
      "updated_at": "2025-07-10T11:24:09Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004502439,
      "body_text": "Hi there, I had previously arranged with one of your advisors to get a\r\nclutch plate sent so I can mount all my motors. As you can read earlier in\r\nthis thread, I had to use the clutch plate to mount the throttle motor due\r\nto the width of the throttle pedal. (please view photos earlier in the\r\nconversation).\r\n\r\nSecond, there is brake pedal activation whenever there's a signal to one of\r\nthe motors, almost like the load cell itself is picking up the voltage. It\r\nhappens even if the gain is at 1% only, so it is not a physical vibration.\r\nIssue persist also when another pedal is being activated (for example when\r\nthe TC activated on the throttle pedal, there's brake activation also).\r\nThis can also be observed in the Simsonn pedal software.\r\n\r\nThank you for your help.\r\n\r\n",
      "user_id": 158001510355,
      "created_at": "2025-07-10T11:54:48Z",
      "updated_at": "2025-07-10T11:54:48Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158004502472,
      "body_text": "Hi Ivaylo Grigorov,    You can set a 5% dead zone for each pedal and then test again to see if the issue improves.",
      "user_id": 158000445778,
      "created_at": "2025-07-10T12:01:37Z",
      "updated_at": "2025-07-10T12:01:37Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004502541,
      "body_text": "I have already done that as I've been simracing for almost 20 years.\r\n\r\nThe deadzone does help when you're not pressing the pedal. However, when\r\ntrail braking, drivers hold the brakes at 20-60% and that is when the issue\r\nis the most annoying. As you're braking with 60%, the ABS kick in and sends\r\nthe signal down 70 or even 80%.\r\n\r\nA deadzone in this situation will not help. I have been advised to do that\r\nnumerous times and it does not fix the issue, just mask it in certain cases\r\n(when you're not pressing the pedal).\r\n\r\nSimilar thing can be achieved in Simhub by not allowing vibration unless\r\nthe pedal is pressed. Still doesn't fix the issue because of the nature of\r\nit.\r\n\r\nAs mentioned previously, issue persists even at 1% gain, where there's no\r\nvibrations at all.\r\n\r\nI'm not sure if this is electrical cross-talk or anything of the sort as it\r\nhappens at very low gain levels.\r\n\r\nThanks for your advice.\r\n\r\n",
      "user_id": 158001510355,
      "created_at": "2025-07-10T12:14:06Z",
      "updated_at": "2025-07-10T12:14:06Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158004943006,
      "body_text": "Hi Ivaylo Grigorov,     I just carefully reviewed all our previous conversations and would like to confirm—are you using a Fanatec or Moza wheelbase? These devices are known to emit EMI (electromagnetic interference) under certain conditions.  Please check the following:    Ensure that the control box and pedals are connected via a green grounding wire, attached to any metal screw on both sides.    Verify that your PC uses a three-prong power plug, which indicates it’s properly grounded through your home’s electrical system.    Once both conditions are met, please refer to the link we provided. It’s an official solution recommended by SIMHUB: Connect the metal housing of your wheelbase to your PC case using a wire. Since your PC is grounded, this creates a path for EMI to discharge safely, helping to prevent interference-related issues.             https://github.com/SHWotever/SimHub/wiki/USB-Issues-Troubleshooting     https://support.gomezsimindustries.com/portal/en/kb/articles/understanding-emi-and-grounding",
      "user_id": 158000445778,
      "created_at": "2025-07-16T06:03:10Z",
      "updated_at": "2025-07-16T06:03:10Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004966307,
      "body_text": "Hi, thank you for your communication. I have attached the wire to one of\r\nthe screws on the wheel stand. However, I did not think of connecting the\r\nstand to the PC case, since USB cables are already running between the two\r\nbut I will try that as well.\r\n\r\nOn the second issue, what is happening with the clutch plate for the VAM\r\nPro haptics? I am not sure if I have been speaking to the same person, but\r\nI got notified that I will be sent another clutch plate so I can\r\nsuccessfully attach all three motors, as you can see in the attached\r\npictures from our previous conversation.\r\n\r\nThank you again for your help and I will try the grounding suggestions.\r\n\r\n",
      "user_id": 158001510355,
      "created_at": "2025-07-16T12:59:17Z",
      "updated_at": "2025-07-16T12:59:17Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158004989839,
      "body_text": "Hi, I forgot to add that my wheelbase is the Cammus C12 (12 Nm direct drive\r\naxial motor), I often static electric shocks around the house after using\r\nit, so it definitely has some sort of electromagnetic footprint. Thank you\r\nagain for the proposal for grounding the wheel stand to the PC case.\r\n\r\nPlease update me on the motor plate when you can. Thank you!\r\n\r\n\r\n",
      "user_id": 158001510355,
      "created_at": "2025-07-16T18:34:01Z",
      "updated_at": "2025-07-16T18:34:01Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005134597,
      "body_text": "Hi Ivaylo Grigorov,     If your computer uses a two-prong plug (without a ground pin), grounding will be ineffective. We recommend connecting your computer to a properly grounded three-prong outlet to ensure reliable anti-interference performance.  In practice, after playing for a while, touching metal parts again may cause static discharge — in mild cases, you may feel a small shock; in more serious cases, static buildup in the base can interfere with other USB devices.  Please refer to the grounding instructions below to enhance stability and reduce interference.     Anti-interference Solutions: 1. Ensure your PC is properly grounded through a functional household ground line Some wall outlets only have two wires and lack a ground wire. This not only poses a safety risk but also prevents devices like Fanatec from discharging electromagnetic interference (EMI) effectively. 2. Use a wire to connect the metal housing of your wheel stand or base to the metal case of your PC This creates a shielding path that significantly improves the overall EMI resistance. 3. Connect a green shielded wire from the metal casing of the pedal control box to any metal screw on the pedal This ensures a solid electrical connection between the control box and the pedal to reduce signal drift and noise. 4. Use a USB isolator If interference persists, consider using a USB isolator to further block EMI transmission paths. ⚠ Note: Make sure all connection points are on bare metal surfaces. Painted or oxidized areas can result in poor grounding, reducing the effectiveness of the shielding.",
      "user_id": 158000445778,
      "created_at": "2025-07-17T10:47:11Z",
      "updated_at": "2025-07-17T10:47:11Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005490304,
      "body_text": "Hi, may I please have an update on the clutch plate? It has been over a\r\nweek since our last communication.\r\n\r\nThank you again.\r\n\r\n",
      "user_id": 158001510355,
      "created_at": "2025-07-24T10:06:58Z",
      "updated_at": "2025-07-24T10:06:58Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158005551224,
      "body_text": "Hi Ivaylo Grigorov,  Once I have the replacement tracking number, I will reply to you immediately. ",
      "user_id": 158000445778,
      "created_at": "2025-07-26T04:38:36Z",
      "updated_at": "2025-07-26T04:38:36Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158005831651,
      "body_text": "Hi,\r\n\r\nI confirm that I have received the spare VAM motor clutch plate along with\r\ntwo redundant normal plates. Thank you very much.\r\n\r\nI will update you on the EM interference issue once I have properly coupled\r\nthe frame with the PC case.\r\n\r\nThank you again\r\n\r\n",
      "user_id": 158001510355,
      "created_at": "2025-07-30T14:26:03Z",
      "updated_at": "2025-07-30T14:26:03Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}