{
  "id": 6750,
  "subject": "Games are not picking up Plus X pedals as an input",
  "description_text": "Hello! I just received my Simsonn Plus X pedals and Simsonn VAM today and I got them all setup with the app and all that. But my problem is that none of my games (e.x. Forza Horizon 5, Assetto Corsa Competitzone, etc.) will recognize the pedals in rebinding. The software (Simsonn Manager) recognizes both pedals and VAM and the VAM seem to vibrate with the game so those seem to work it’s just when I try to rebind the pedal and I press down on the pedal, the game itself doesn’t recognize it. I’ve recalibrated my pedals, and updated them to the latest firmware. I am also using the latest software (2.1.2). Could I get some help? Thanks.\r\n\r\nIf it’s relevant- I’m using a Logitech G920 along side these, which requires the Logitech GHUB app to be open for it to be used. I do have the pedals plugged in straight to a Motherboard USB 3.2 port too. These seem like great pedals, except this issue I’m having.\r\nSent from my iPhone\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-11-26T02:21:49Z",
  "updated_at": "2025-11-26T11:03:42Z",
  "requester_id": 158007334783,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158012930026,
      "body_text": "I figured it out! I pressed the “update” button on the controller box and now the games are picking them up! They work, awesome pedals!\r\nSent from my iPhone\r\n\r\n> ",
      "user_id": 158007334783,
      "created_at": "2025-11-26T06:50:17Z",
      "updated_at": "2025-11-26T06:50:17Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158012941683,
      "body_text": "Hi Liam Drechsel,  I'm glad to hear that your issue has been resolved. ",
      "user_id": 158000445778,
      "created_at": "2025-11-26T11:03:42Z",
      "updated_at": "2025-11-26T11:03:42Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}