{
  "id": 6813,
  "subject": "Way to track order?",
  "description_text": "I ordered the 3 haptics with the power box that goes with it from the\r\nwebsite but i guess my email that the confirmation would’ve been sent to\r\nwas full it’s my old email that’s attached to my PayPal. Is there a way to\r\nget tracking info from you guys if i provided information about the order?\r\nIt was placed the 24th of November at night and it was placed under the\r\nname “George Lee”  with the email “official8thentitymusic@gmail.com” and is\r\nbeing shipped to “11621 sunset knolls road, Lakeside, CA, 92040”\r\n\r\nThanks so much if you are able to provide any tracking/shipping\r\ninformation, happy holidays!\r\n-- \r\n\r\n*1x Grammy Award Winning Producer*\r\n*Contact: *\r\n*  Phone:* *(619)-733- <619%29-988-2716>1398*\r\n*  Email: georgedavidlee@gmail.com <officialskitzobeatz@gmail.com>*\r\n  *Instagram: @dontbeangrywithgeorge*\r\n\r\n*Production credit must be issued to \"Curious George\" - (BMI)*\r\n\r\n   *This e-mail and any files or data transmitted with it are confidential\r\nand intended solely for the use of the individual named above. If you have\r\nreceived this email in error and are not the intended recipient, please\r\nnotify the sender by e-mail and immediately delete the message and all\r\nmaterials without reading them.  If you are not the intended recipient,\r\ncopying, forwarding or otherwise disseminating or distributing this\r\ninformation is prohibited.*\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-11-26T18:37:57Z",
  "updated_at": "2025-11-27T06:49:14Z",
  "requester_id": 158007277095,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158012994336,
      "body_text": "Hi Curious George,    We have updated your email address and sent you a shipping notification.",
      "user_id": 158001343601,
      "created_at": "2025-11-27T06:49:14Z",
      "updated_at": "2025-11-27T06:49:14Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}