{
  "id": 6862,
  "subject": "Request Info collaboration",
  "description_text": "Good morning, I'm writing from Italy. I run a large gaming community called\r\nBlack Lion Italia. I have a well-followed YouTube and Facebook channel\r\ncalled Black Lion Italia. You can do a Google search and see.\r\n\r\nI have a PC sim racing team in the Assetto Corsa and iRacing games with 53\r\nactive drivers.\r\n\r\nI'd like to promote your products and accessories and make videos and\r\nreviews to encourage purchases.\r\n\r\nI'd like to receive one of your products as a sample and test it at a 50%\r\ndiscount. In exchange, I can create a video review and promote it on my\r\nchannels. I can use your logo or company name to advertise.\r\n\r\nIs it possible? Would you be interested in this opportunity? I'm waiting.\r\n\r\nLuca P.\r\n\r\nblacklionitalia\r\n\r\n\r\n<http://www.blacklionitalia.it>\r\n\r\nGaming Community Since 2002\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-11-27T09:10:19Z",
  "updated_at": "2025-12-22T11:32:08Z",
  "requester_id": 158007360613,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158013002913,
      "body_text": "Hi Luca,  Good morning, and thank you for reaching out! We truly appreciate your interest in collaborating with us, and it’s great to hear about your Black Lion Italia community — 53 active sim-racing drivers is impressive, and we’re glad you’re considering featuring our products.  At the moment, we’re unable to offer a 50% sponsorship discount, but we can provide a special 25% exclusive discount code: BLI25, which you and your team can use for purchasing and testing our products.  If you decide to create review or promotion content, we would be very happy to see it — and you’re welcome to display our logo or brand name in your videos and posts.  Thank you again for the opportunity. If you have any questions or need support during your testing or setup, feel free to contact us anytime.  Best regards, The Simsonn Team",
      "user_id": 158001343601,
      "created_at": "2025-11-27T10:47:21Z",
      "updated_at": "2025-11-27T10:47:21Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158013046268,
      "body_text": "Thank you for your reply. I understand your difficulty, but unfortunately\r\n25% is really not enough. I'll offer you constant advertising on YouTube\r\nand Facebook for three months. Every week, a new video (I'll send you\r\nvideos you've watched) where I promote your website's product and your\r\nbrand. It's a lot of work that will surely yield important results for you.\r\nIf we can raise 40%, I'll proceed with the purchase.\r\nPlease evaluate and research my business.\r\nBest regards,\r\nLuca\r\nblacklionitalia <http://www.blacklionitalia.it>\r\nYouTube\r\nFacebook\r\n\r\nGaming Community Since 2002\r\n\r\nIl gio 27 nov 2025, 11:47 support@simsonn.com ",
      "user_id": 158007360613,
      "created_at": "2025-11-28T08:29:32Z",
      "updated_at": "2025-11-28T08:29:32Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}