{
  "id": 6924,
  "subject": "Help with purchasing",
  "description_text": "Hi there,\r\n\r\nI am currently in between deciding which pedals to get for my rig. I was initially looking at getting the Simnet SP Pro pedals, but then I came across your Black Friday offer which has made me curious about your brand.\r\n\r\nI’d like to ask what the difference is between the Plus X and Pro X Ultra pedals? I am reading online that the Plus X are newer? However I see the Pro X Ultra are more expensive which leads me to believe they are the better pedals?\r\n\r\nAlso I would like to know regarding Shipping where you ship your pedals from? One of the reasons I wanted to buy the Simnet Pedals is because a lot of EU dealers have them and ship them from inside the EU, so I don’t have to pay any additional customs fees. Do you guys also have an EU warehouse that you ship from or does everything come from China?\r\n\r\nI’m hoping to get a prompt response as I want to take advantage of your Black Friday deal.\r\n\r\n\r\nThank you and best regards,\r\n- Hrvoje Bazina, ASBH\r\n",
  "status": 2,
  "priority": 1,
  "created_at": "2025-11-28T06:54:28Z",
  "updated_at": "2026-01-19T23:28:33Z",
  "requester_id": 158007388764,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158013044708,
      "body_text": "Hi Hrvoje Bazina,    Pro X Ultra and Plus X are our two latest pedals. The Pro X Ultra pedal is Simsonn's flagship product, featuring an adjustable hydraulic damper and more advanced electronic components within the control unit. It delivers precise control, making it ideal for experienced players seeking fine-tuned adjustments. Equipped with an RGB system that provides feedback based on in-game telemetry data, it boasts a more aesthetically pleasing lighting design and form factor to enhance the overall atmosphere. However, should these features be unnecessary, the Plus X pedal offers superior value for money – employing the same high-quality elastomer, a 200kg sensor, and equally robust construction.  We ship from our German warehouse. You can use this discount code on our official website: Black45 to get $45 off and an additional one-year warranty.  https://www.simsonn.com/collections/pedals",
      "user_id": 158001343601,
      "created_at": "2025-11-28T07:14:30Z",
      "updated_at": "2025-11-28T07:14:30Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158013045120,
      "body_text": "That’s great!\r\n\r\nI have watched some reviews and have seen that Simnet Pedals have better QC compared to yours? There was a video from the YouTube channel “Sim Racing Corner” specifically that stood out and talked about some of the manufacturing issues mentioned.\r\n\r\nHow do these compare in quality to the Simnet pedals?\r\n\r\n- Hrvoje Bazina, ASBH\r\n\r\n> ",
      "user_id": 158007388764,
      "created_at": "2025-11-28T07:33:24Z",
      "updated_at": "2025-11-28T07:33:24Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158013046712,
      "body_text": "Hi Hrvoje Bazina,    It's definitely worth every penny, and we take customer and reviewer feedback seriously. We've now added inspection procedures, so quality control is assured. You can check out the buyer reviews on our website.",
      "user_id": 158001343601,
      "created_at": "2025-11-28T08:47:31Z",
      "updated_at": "2025-11-28T08:47:31Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158013049541,
      "body_text": "I also see you have these springs available on your website\r\nhttps://www.simsonn.com/products/sprung?variant=50549032517946\r\n\r\nAre these compatible with the Pro X Ultra? And how do they compare to the\r\nelastomers? When would I use one over the other or how would I combine them?\r\n\r\nOn Fri, Nov 28, 2025 at 9:47 AM support@simsonn.com ",
      "user_id": 158007388764,
      "created_at": "2025-11-28T09:14:55Z",
      "updated_at": "2025-11-28T09:14:55Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158013059547,
      "body_text": "Hi Hrvoje Bazina,    You can replace the spring to achieve a longer stroke.",
      "user_id": 158001343601,
      "created_at": "2025-11-28T13:46:13Z",
      "updated_at": "2025-11-28T13:46:13Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158013532660,
      "body_text": "﻿ Hi there, I’ve received my Simsonn Pro X Ultra pedals with the base plate. However I have found a major design flaw with the base plate. When I mount the pedals to it, the nuts of the screws are protruding at the bottom of the plate. Therefore when I tried mounting them on my Track Racer Hybrid pedal plate, I just ended up scratching the Trak Racer plate and I’m unable to mount it to the rig because the screws aren’t long enough. The whole pedal plate just doesn’t sit flush with the mounting plate on the cockpit. This seems like a really big design flaw that’s been overlooked… - Hrvoje Bazina, ASBH ",
      "user_id": 158007388764,
      "created_at": "2025-12-05T14:39:05Z",
      "updated_at": "2025-12-05T14:39:05Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158013756526,
      "body_text": "Hi Hrvoje Bazina,  Could you provide a picture? We need to confirm the exact situation. It’s possible that adding a few screw standoffs could resolve the interference with the bracket. ",
      "user_id": 158000445778,
      "created_at": "2025-12-06T04:53:01Z",
      "updated_at": "2025-12-06T04:53:01Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158013889060,
      "body_text": "The screws holding the pedals down on the pedal plate are scratching the pedal plate of my rig. This YouTuber here also talks about this issue at 9:45 AliExpress Delivers again? WHAT! - SimSonn PRO X Sim Racing Pedals!!! youtu.be - Hrvoje Bazina, ASBH ",
      "user_id": 158007388764,
      "created_at": "2025-12-06T13:19:26Z",
      "updated_at": "2025-12-06T13:19:26Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014309584,
      "body_text": "Hi Hrvoje Bazina,  We apologize for this issue. We will look into how to improve the bracket design, possibly by adding a stud. We need to conduct further testing. ",
      "user_id": 158000445778,
      "created_at": "2025-12-11T09:07:51Z",
      "updated_at": "2025-12-11T09:07:51Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158014311474,
      "body_text": "I think the whole plate needs to be thicker because it also flexes a lot the way it’s currently setup. There needs to be channels for the screws to slot into so that it can sit flush with the base plate on the rig. I’d really like to get a replacement for this, as it’s making the pedals almost impossible to use.\r\n\r\nFurthermore, I tried using the pedals for a little and I have noticed that the throttle pedal isn’t very smooth but quite sticky. It’s hard to get smooth acceleration and deceleration with it, as I can feel it cogging on my foot\r\n\r\n\r\n- Hrvoje Bazina, ASBH\r\n\r\n> ",
      "user_id": 158007388764,
      "created_at": "2025-12-11T10:17:16Z",
      "updated_at": "2025-12-11T10:17:16Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014472309,
      "body_text": "Hi Hrvoje Bazina,  Our throttle pedal is equipped with a custom one-way hydraulic rod. The rod contains fluid, so it is normal to hear a water-like sound during movement. If you notice other unusual noises, you can apply silicone-based lubricant to the key parts of the pedal according to the manual. Make sure the silver rod of the hydraulic unit is clean and free of dust particles before lubrication. If the problem persists, please record a video and send it to us via Google Drive, ensuring that the viewing permissions are set.      Regarding the base plate, we aim to increase its thickness. Currently, it is made of 3mm stainless steel, but increasing it to 4mm would significantly add weight, resulting in much higher international shipping costs. We are redesigning the base plate to increase its thickness while using countersunk screws to address the installation. ",
      "user_id": 158000445778,
      "created_at": "2025-12-14T03:39:31Z",
      "updated_at": "2025-12-14T03:39:31Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158015170068,
      "body_text": "Hi there,\r\n\r\nI’m not talking about the fluids inside, I’m saying the pedal travel is sticky and not smooth. I tried recording a video of it but you can’t really see it on the video, it’s more of a feeling in my foot when I press down on the throttle or when I release it that it has jerky movements instead of being a smooth continuous movement. This makes precise acceleration and deceleration very hard using the pedals.\r\n\r\nFurthermore it seems like the throttle pedal is sagging to the right, which I imagine could also be due to the baseplate not sitting flush with the rig due to the issues I mentioned before and therefore  it bending or something.\r\n\r\nThis has been a really frustrating experience and I’m on the verge of considering if I should return these pedals to you guys because it just seems like they have issues after issues.\r\n\r\n\r\n- Hrvoje Bazina, ASBH\r\n\r\n> ",
      "user_id": 158007388764,
      "created_at": "2025-12-28T19:42:42Z",
      "updated_at": "2025-12-28T19:42:42Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158015245777,
      "body_text": "Hi Hrvoje Bazina,  You can remove the throttle’s hydraulic rod to check if the pedal functions normally. If it still feels stiff, the moving parts need to be lubricated. ",
      "user_id": 158000445778,
      "created_at": "2025-12-30T10:11:52Z",
      "updated_at": "2025-12-30T10:11:52Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158015333290,
      "body_text": "Would lubricating the Hydraulic rod help at all?\r\n\r\n\r\n- Hrvoje Bazina, ASBH\r\n\r\n> ",
      "user_id": 158007388764,
      "created_at": "2025-12-31T19:47:05Z",
      "updated_at": "2025-12-31T19:47:05Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158015366918,
      "body_text": "Hi Hrvoje Bazina,  This is highly recommended, as the metal rod of the hydraulic lever easily attracts dust, which can cause issues. Proper lubrication can help, or we can also send you a replacement hydraulic lever. ",
      "user_id": 158000445778,
      "created_at": "2026-01-01T15:42:05Z",
      "updated_at": "2026-01-01T15:42:05Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158015461693,
      "body_text": "What do you recommend for lubrication?\r\n\r\n\r\n- Hrvoje Bazina, ASBH\r\n\r\n> ",
      "user_id": 158007388764,
      "created_at": "2026-01-03T03:57:23Z",
      "updated_at": "2026-01-03T03:57:23Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158016159168,
      "body_text": "Hi Hrvoje Bazina,  Silicone-based lubricant is sufficient. ",
      "user_id": 158000445778,
      "created_at": "2026-01-07T15:39:37Z",
      "updated_at": "2026-01-07T15:39:37Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158016821580,
      "body_text": "I’ve tried lubricating it but it didn’t really help. It still feels sticky. Also like I mentioned before, the whole throttle pedal is bent to the side. I finally took a photo of it\r\n\r\n- Hrvoje Bazina, ASBH\r\n\r\n> ",
      "user_id": 158007388764,
      "created_at": "2026-01-11T15:26:53Z",
      "updated_at": "2026-01-11T15:26:53Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158016821628,
      "body_text": "Hi Hrvoje Bazina,     Please provide your order number, contact name, shipping address, and phone number. We will arrange to send you a replacement one-way hydraulic damper for the throttle pedal.  Additionally, we noticed that the screws on the top panel are not properly installed and may be misaligned. Please check this as well, as it could affect normal operation.",
      "user_id": 158000445778,
      "created_at": "2026-01-11T15:31:38Z",
      "updated_at": "2026-01-11T15:31:38Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158016829842,
      "body_text": "I'm sorry, but what are you guys even talking about anymore? This is\r\nbecoming a really frustrating experience for me, especially since I was\r\nassured by you that the quality control has gotten much better than the\r\nreviews were talking about, meanwhile it's just issue after issue. What\r\nscrews are misaligned? Everything is how it came from the factory, the only\r\nmodification I did was add the VAM motors. I am talking about the fact that\r\nthe entire throttle pedal is bent to the right as you can see in the\r\npicture. It is not standing straight. Also not to mention that I still\r\nhaven't been offered a solution for the pedal plate that doesn't work on my\r\nrig and I have it mounted right now in a way that has a lot of flex and is\r\nalmost unusable. I have had the pedals for almost a month now and I still\r\nhaven't received any solutions from your support team on how to get these\r\npedals to work properly\r\n\r\nOn Sun, Jan 11, 2026 at 4:31 PM support@simsonn.com ",
      "user_id": 158007388764,
      "created_at": "2026-01-11T21:00:16Z",
      "updated_at": "2026-01-11T21:00:16Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158016832407,
      "body_text": "Hi Hrvoje Bazina,     Regarding the bracket interference issue, this is not a design defect of our baseplate itself. As there are many different types of rigs and brackets available on the market, it is not possible for us to guarantee perfect compatibility with every setup.  If the issue is limited to the throttle’s one-way hydraulic damper, you may first try increasing the preload of the throttle mounting screws to enhance the return force and then test again. Alternatively, we can arrange to send you a new one-way hydraulic damper for the throttle. Please note that a pure hydraulic damper is designed to provide hydraulic damping to stabilize pedal input data and travel characteristics, rather than relying on a spring-based return force like low-cost gas struts.  As for the throttle pedal tilting to the right, we have not encountered this issue before. Please check whether the baseplate is securely mounted, or provide a clear side-view photo of the throttle pedal so we can review it and involve our production team to further analyze and resolve the issue.",
      "user_id": 158000445778,
      "created_at": "2026-01-12T00:05:06Z",
      "updated_at": "2026-01-12T00:05:06Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158016846783,
      "body_text": "As per my last email - The base plate is not mounted properly because of the design flaw we discussed before. The screws are protruding at the bottom of the plate which is absolutely a design flaw as every other pedal base plate I’ve ever seen has channels for the screws to go into. This reviewer talks about this exact issue at 9:45 https://youtu.be/ijCsNwTB85Q This reviewer has a different pedal plate though so they made it work, but everyone else who has a flat pedal plate (including myself) won’t be able to properly mount it to their rig. I was under the impression that you were aware of this issue and are designing a new pedal plate that I would receive so I can use the pedals properly. But if you don’t see this as a design flaw and aren’t willing to offer a solution, then I’d like to be issued a refund and return the pedals as I am unable to use them properly as you can see. Regarding the sticky throttle, I have had the preload maxed out, as well as in the middle and also at the weakest setting, and the issue still remained. You can try sending a new Hydraulic damper if you think this will solve the problem. Here is the shipping info: Hrvoje Bazina Lašćinska Cesta 19/1 Zagreb, 10000 Croatia +385 97 6074-003 - Hrvoje Bazina, ASBH ",
      "user_id": 158007388764,
      "created_at": "2026-01-12T08:51:40Z",
      "updated_at": "2026-01-12T08:51:40Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158016927349,
      "body_text": "Hi Hrvoje Bazina,  We will send you a replacement one-way hydraulic rod for the throttle pedal. Please provide your order number, contact name, phone number, and address. ",
      "user_id": 158000445778,
      "created_at": "2026-01-13T03:29:25Z",
      "updated_at": "2026-01-13T03:29:25Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158017424319,
      "body_text": "Order Number: #SSN4000\r\n\r\nShipping details:\r\nHrvoje Bazina\r\nLascinska Cesta 19/1\r\nZagreb, 10000\r\nCroatia\r\n+385 97 6074-003\r\n\r\nAlso you didn't answer me when can I expect a solution for my bent throttle\r\npedal and base plate that can't be mounted properly?\r\n\r\nOn Tue, Jan 13, 2026 at 4:29 AM support@simsonn.com ",
      "user_id": 158007388764,
      "created_at": "2026-01-19T15:26:37Z",
      "updated_at": "2026-01-19T15:26:37Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ],
  "available_langs": []
}