{
  "id": 7001,
  "subject": "Firmware update VAM pro and bug",
  "description_text": "Hello, I've finally set un my pro pedal X ultra and wow, it's fantastic!\r\nbut I have a problem/bug on the VAM pro motors and software;\r\nI've installed latest software and latest firmware, but for some reason,\r\nafter some hours the motors (every one of the three) start to lose/ignore\r\nthe input and \"freeze\" randomly for some seconds;\r\nit's annoying during the game, and I have to manually re-upload the\r\nfirmware to have some hours of correct play again (of course it loses all\r\ncalibration, light setup and so on, so I've to do it again from the\r\nbeginning every time..)\r\nIt's a known issue, as you can see here (middle of page):\r\nhttps://www.reddit.com/r/simracing/comments/1myejke/simsonn_vam_pros_ask_me_anything/\r\nmaybe a new firmware update is on the way?\r\nthanks a lot!\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-11-29T01:32:37Z",
  "updated_at": "2025-12-01T01:50:05Z",
  "requester_id": 158005882886,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158013134896,
      "body_text": "Update: after the manual reset of the latest firmware, I found that just calibating the pedals and set up the basic feature it seems that firmware settings for the VAM won't go away lost; maybe it's something related to the light function of the Pro X ultra or some other settings that causes the problem, don't know, but just to inform you, since the problem is surely software related...Please check Simsonn manager 2.1.2 fot this bug, since I'm sure it's in there.",
      "user_id": 158005882886,
      "created_at": "2025-11-30T11:37:39Z",
      "updated_at": "2025-11-30T11:37:39Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158013154458,
      "body_text": "Hi Cristian,    If this issue occurs, we recommend first checking whether there is any electrical interference affecting the USB data transmission. Please ensure that your PC is properly grounded—some users may not be using a three-prong plug connected to a grounded wall outlet, which can cause abnormal device behavior.  You may refer to the method described in the post below: connect the PC case to the rig frame, and connect the main control box to the metal screws of the pedals. Establishing proper grounding can effectively resolve disconnection issues or momentary motor freezing.  Additionally, there is a possibility that the problem is related to a configuration conflict in the lighting system or another software error. I have already reported this to our software team, and they will address it in the upcoming firmware update.         https://github.com/SHWotever/SimHub/wiki/USB-Issues-Troubleshooting https://support.gomezsimindustries.com/portal/en/kb/articles/understanding-emi-and-grounding",
      "user_id": 158000445778,
      "created_at": "2025-12-01T01:50:05Z",
      "updated_at": "2025-12-01T01:50:05Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}