{
  "id": 7051,
  "subject": "Need assistance and an Exchange",
  "description_text": "Hello Simsonn Team,\r\nI am a new customer of yours and have made several very recent purchases on Amazon, as I was unaware that you sold direct..We own & operate a Simulator Arcade here in Georgia with different types of sims and we need help. \r\n\r\nThe 1st is the purchase of the SIMSONN Plus X Pedals Sim Racing Pedals PC Racing Simulator Pressure Sensor Load Cell HE Hydraulic Pedal Support Haptic Reactor (Plus X-P2-H2-Plate) Order#114-2563076-8315440 delivered Nov 26th. \r\n\r\n2nd is the purchase of SIMSONN Plus X Pedals Sim Racing Pedals Clutch Pedal (Plus X Clutch Pedal) Order#114-0509314-3226600  \r\nWhich is in transit\r\n\r\nI thought that I purchased these in the color Black because all of our cockpits were provided by Next Level Racing and they are all Black & Carbon. The setup person in our store was not aware & installed the throttle and pedal set on the NLR F-GT Elite. When I got to the store, I was immediately upset to see that these are Silver in color and do NOT look good on these rigs. \r\n\r\nWe have laid out close to $300 for 2 separate orders that should have been purchased as the: SIMSONN Plus X Pedals Sim Racing Pedals PC Racing Simulator Load Cell HE Hydraulic Pedal Support VAM and VAM Pro Haptic Pedals Reactor (Black-P3-H3-Plate) at a cost of $255.00 for the correct & complete set.\r\n\r\n***We do NOT want to return these to Amazon and wait for the refund from you, just to purchase the the product we need***\r\n\r\n***We are NOT asking for any price adjustments***. We are asking for you to Exchange what we have for the item listed above in Black. The set has been mounted and very lightly used.I am hoping that you can help us with our issue, so we can continue to purchase your products direct to build the new rigs.\r\n\r\nYour assistance would be greatly appreciated & we’d like to keep showing off your high quality components.\r\n\r\nThank you for your time & we look forward to your reply.\r\nRegards,\r\nSim World of Hartwell\r\n\r\n\r\n\r\nGary Lederman\r\nSim World of Hartwell\r\nFamily Fun & Serious Sims \r\n@Hidden Lake Farm\r\n\r\n￼ \r\nHartwell, GA 30643\r\nMobile 732-319-2835\r\ngary@hiddenlake.farm <mailto:gary@hiddenlake.farm>\r\n\r\nHave this ￼ and Need This ￼\r\n\r\n \r\n\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-11-29T18:57:13Z",
  "updated_at": "2025-12-04T12:22:48Z",
  "requester_id": 158007423624,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": []
}