{
  "id": 7098,
  "subject": "Review od simsonn hs pro",
  "description_text": "Hello my name is Michał I am from Poland and I would love to ask if you\r\nguys are sending the new simsonn hs pro shifters for reviews? I am trying\r\nto find any information about it online or at least one video of how it\r\nworks and sound’s but theres nothing other than your website description\r\nand its so frustrating because it looks awesome! and I just saw it randomly\r\non your facebook page and im super stoked about it since i believe theres a\r\nbig hole to fill when it comes to shifter market currently. You got really\r\ncheap stuff that feels like toys, then in medium price you pretty much only\r\nhave moza hgp since its the only one worth the price (cause thrustmasters\r\nshifters pretty much feel the same as the cheap ones lol) so I am more than\r\nexcited to get that bad boy of yours connected to my rig! Please let me\r\nknow about our partner possibilities and keep up creating great gear.\r\n\r\nKind regards, Michał.\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-11-30T15:12:24Z",
  "updated_at": "2025-12-04T12:13:18Z",
  "requester_id": 158007444043,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158013387155,
      "body_text": "Hi Michał,    Thank you so much for reaching out — and for your enthusiasm! We’re really happy to hear that the new Simsonn HS Pro Shifter caught your attention. You’re absolutely right: the shifter market does have a big gap between “toy-like budget gear” and very expensive high-end options, and that’s exactly the gap we’re trying to fill with HS Pro.  At the moment, we’re not sending free review units for this product, but we are open to cooperation. If you’d like to review the HS Pro Shifter, we can offer you a special 15% reviewer discount to support your content creation.  If you can share:    Your YouTube / TikTok / social links    Recent content examples    Typical views on hardware-related videos    we’ll be happy to evaluate the possibility of future collaboration once your review content grows.  Thank you again for the kind words — we truly appreciate your support and we hope the HS Pro Shifter becomes a great addition to your rig!  Best regards, The Simsonn Team",
      "user_id": 158001343601,
      "created_at": "2025-12-04T12:13:18Z",
      "updated_at": "2025-12-04T12:13:18Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}