{
  "id": 7147,
  "subject": "Order (plus x pedals)",
  "description_text": "\r\nHi\r\n\r\nI ordered some plus x pedals on Friday just gone and for some reason I never received any emails (even in my junk folder). The money has gone out of my bank with your company’s name so I’m guessing it has gone through, I just wanted to double check.\r\n\r\nMy name is Danny Thompson and the delivery address would be 1 elm avenue, penyffordd Chester, CH4 0FN.\r\nThe email address may be under: dannyt_85@hotmail.co.uk which I also have access too and I paid though Apple Pay.\r\n\r\nI have added a picture of the bank payment with the transaction code.\r\n\r\nKind regards\r\nDanny [image0.jpeg]\r\n\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-12-01T10:20:29Z",
  "updated_at": "2025-12-04T11:43:15Z",
  "requester_id": 158007468368,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158013378060,
      "body_text": "Hi Danny thompson,  We will ship your items separately because their packaging cannot be combined. Additionally, the processing of your order has been affected by a delay in the latest restocking at our warehouse. We are expediting your shipment, and we kindly ask for a little more patience. Thank you very much for your understanding and support.",
      "user_id": 158000445778,
      "created_at": "2025-12-04T08:23:10Z",
      "updated_at": "2025-12-04T08:23:10Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158013386408,
      "body_text": "Hi Danny thompson,    As you did not provide an email address, you did not receive the order confirmation and dispatch notification. We have added this email address for you to receive subsequent notifications. Here is your logistics tracking link.  https://t.17track.net/en#nums=SF6047095995538",
      "user_id": 158001343601,
      "created_at": "2025-12-04T11:43:15Z",
      "updated_at": "2025-12-04T11:43:15Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}