{
  "id": 7209,
  "subject": "[PLEASE HELP ME] [Rewrite] My SIMSONN PRO pedal isn't working.",
  "description_text": "I wrote the ticket last time, but it didn't open again, so I'm rewriting\r\nit. I'll explain the order number, model name, and the shape of the control\r\nbox you will ask first.\r\n\r\nFirst of all, my pedal is SIMSONN PRO model, and I bought a model that says\r\nSPRO 2P 2H from AliExpress. The software recognized my pedal as SIMSONN\r\n1.7.1.\r\n\r\nThe order number I ordered from SIMSONN's official AliExpress website is\r\n1105747314449841. Currently, the product page has disappeared, but I\r\npurchased it on June 17, 2024.\r\n\r\nMy control box is a control box with an open side to which the ground wire\r\nis attached, so you can see the substrate. The grounding is well done.\r\n\r\nThe issue is as follows.\r\nI first used SIMSONN Manager 2.1.2 version on the SIMSONN homepage, but\r\nwhen I connected, it showed an old version. I was told to install manually,\r\nso I did it with the correct procedure, but the installation did not\r\nproceed properly. The progress bar did not move and the software showed a\r\nmessage that the installation was complete, but I did not recognize it\r\nproperly. Sometimes I recognized it with the device name SIMSONN 1.7.1, but\r\nI couldn't recognize the axis and when the pedal was connected at any time,\r\nthe program's rack was severe, so the screen was cut off every two seconds.\r\nWhen I unplugged the pedal line, it got better. After that, I installed and\r\nran SimPedalsConfig_V4, but strangely, when the pedal was connected, the\r\nprogram failed. I recognized that the device was connected, but I couldn't\r\nfind the axis moving. I finally used Freejoy because I couldn't use both\r\nprograms. However, in the process, I accidentally pressed Write and the\r\nprogram was covered and burned. This machine failed.\r\n\r\nI want a solution to this problem. I'm a boarding student, so I can only\r\nplay games on weekends, and it's sad that this happens :(\r\n\r\nFirst of all, I'd like you to give me a way to install proper firmware in\r\nmy control box and a config file to rewrite as Freejoy that fits my pedal\r\nmodel. Manual installation in SIMSONN Manager did not work well.\r\n\r\nI really want to solve this problem and use Padal. Please reply. Have a\r\nnice day\r\n\r\n",
  "status": 5,
  "priority": 1,
  "created_at": "2025-12-02T03:39:38Z",
  "updated_at": "2025-12-04T01:28:46Z",
  "requester_id": 158007419070,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158013364066,
      "body_text": "此工单已关闭并合并到工单 7368 中",
      "user_id": 158000445778,
      "created_at": "2025-12-04T01:28:46Z",
      "updated_at": "2025-12-04T01:28:46Z",
      "incoming": false,
      "private": true,
      "source": 2
    }
  ]
}