{
  "id": 7265,
  "subject": "(Order #SSN3780)",
  "description_text": "Hi, I need some help regarding an order I placed directly on Simpsonn.com (Order #SSN3780) on November 23rd. The website states 1-2 days for order processing, but it has now been 6 business days and 9 total days without any shipping confirmation or update. I've emailed support through the website but haven't received a response. What's confusing is that your official eBay store responded to me immediately and confirmed that these same pedals can ship out the same day. Because I'm unable to get any assistance through the main website, could you please help me by either: Cancelling my original order (#SSN3780) if it hasn't shipped, and Shipping this eBay order instead since you can send it out right away. I would really appreciate any support you can provide. I've had no communication through the website order, and I'm just trying to get the pedals I already paid for. Thank you for your help.\r\n\r\n\r\nBrandon Seaton\r\n\r\n\r\n[signature-logo-w-outline-for-email.png]\r\nInterstate Treating, Inc. | www.InterTreat.com<http://www.intertreat.com/>\r\n7141 Club Drive | Mailing - PO Box 1386 | Odessa, Texas 79760-1386\r\nO: 432-367-1028<tel:432-367-1028> | bseaton@rmfssi.com<mailto:bseaton@rmfssi.com>\r\n\r\n\r\n\r\n",
  "status": 2,
  "priority": 4,
  "created_at": "2025-12-02T17:24:59Z",
  "updated_at": "2026-01-05T18:12:16Z",
  "requester_id": 158007499314,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158013363672,
      "body_text": "Hi Brandon Seaton,    We sincerely apologize for the delay with your order. Our eBay support colleague also reported your case in the service group earlier. Due to a delay in restocking at our overseas warehouse, the items were temporarily out of stock. The new inventory only arrived and was listed in the past two days, which led to a backlog of orders and messages. This caused a delay in my response, and I’m truly sorry for the inconvenience.  I have just checked your order details:    The pedal was shipped from China on November 25.    The vibration motor was handed over to the US warehouse shipping process on December 3.    I will confirm the latest status of your shipment with our operations team as soon as I start work today and get back to you as quickly as possible. Thank you for your patience and understanding.",
      "user_id": 158000445778,
      "created_at": "2025-12-04T01:11:45Z",
      "updated_at": "2025-12-04T01:11:45Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158013393515,
      "body_text": "Thank you for the update and for checking on the order details. I appreciate the explanation, but it still doesn’t resolve the main issue: the order is far outside the 1–2 day processing timeline advertised on your website, which heavily influenced my decision to order through Simpsonn.com.\r\n\r\nYou’ve also provided a FedEx tracking number, but at this point it only shows a shipping label was created, no pickup scan, no movement, and no estimated delivery date. A label without carrier acceptance is not a shipment.\r\nI understand the holiday rush and the potential for delays this time of year, and I’m sympathetic to that. However, the problem is not the delay itself, it’s the lack of proactive communication and the repeated failure to respond through your official website. I contacted support multiple times with no reply and only received information by reaching out through your eBay store. That is not a confidence-building experience for a customer.\r\n\r\nI also want to be transparent: I have dealt with situations before where placeholder tracking numbers are generated to satisfy PayPal’s “shipment details” requirement even though the package hasn’t entered the shipping network. I am not accusing your company of this, but the lack of movement so far follows the same pattern, and I will be monitoring the shipment closely.\r\n\r\nAt this point, any delays beyond today are unacceptable. I ordered the similar items from another vendor during this waiting period, and they have already been delivered. If needed, I can reorder from a different vendor and receive guaranteed delivery within 2 days.\r\n\r\nBased on the handling of this purchase so far, I do not believe this order will arrive anywhere near the original timeline, and I am concerned it may extend another 1–2 weeks, nearly a month since the order was placed.\r\nFor that reason, I need one of the following today:\r\n\r\n\r\n  1.  Confirmed shipment with real carrier movement (pickup scan and updated delivery estimate), or\r\n  2.  A full refund so I can obtain the item from a vendor who can deliver as advertised.\r\n\r\nPlease confirm which option you can process. Thank you.\r\n\r\nThank you,\r\nBrandon Seaton\r\n\r\n\r\n[signature-logo-w-outline-for-email.png]\r\nInterstate Treating, Inc. | www.InterTreat.com<http://www.intertreat.com/>\r\n7141 Club Drive | Mailing - PO Box 1386 | Odessa, Texas 79760-1386\r\nO: 432-367-1028<tel:432-367-1028> | bseaton@rmfssi.com<mailto:bseaton@rmfssi.com>\r\n\r\n\r\n",
      "user_id": 158007499314,
      "created_at": "2025-12-04T14:38:14Z",
      "updated_at": "2025-12-04T14:38:14Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158013477536,
      "body_text": "Hi Brandon Seaton,     Thank you for your detailed message — and I completely understand your frustration. You’re absolutely right to expect timely processing, clear communication, and a tracking number that reflects real movement. I want to address your concerns directly and transparently.  First, regarding the lack of replies: Our support inbox has been completely overloaded over the past few days, and we’ve only recently been able to start clearing and responding to messages in order. This is not an excuse — just an explanation for why your earlier messages through the website didn’t receive the timely response you deserved. We sincerely apologize for that.  Second, about the tracking number: You’re correct that a label without carrier acceptance is not a shipment. The label was created during our processing, but due to the surge in holiday volume, it didn’t move into FedEx’s possession as quickly as normal. We are confirming the physical pickup status now.  Thank you for your patience, and again, we apologize for the poor communication experience — this is not the standard we want for our customers. We’ll update you shortly today with the confirmed status.     Best regards, Simsonn Team",
      "user_id": 158001343601,
      "created_at": "2025-12-05T10:00:13Z",
      "updated_at": "2025-12-05T10:00:13Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158013527820,
      "body_text": "Great news! The tracking number is now showing that the package has been picked up and is officially in transit with delivery scheduled for Monday. Thank you for following through and getting this clarified.\r\nI appreciate the improved communication today. I understand the holiday rush can create bottlenecks. I’m glad the order is finally moving, and I look forward to receiving the pedals.\r\n\r\nThanks again for your help in resolving this.\r\nBrandon Seaton\r\n\r\n\r\n[signature-logo-w-outline-for-email.png]\r\nInterstate Treating, Inc. | www.InterTreat.com<http://www.intertreat.com/>\r\n7141 Club Drive | Mailing - PO Box 1386 | Odessa, Texas 79760-1386\r\nO: 432-367-1028<tel:432-367-1028> | bseaton@rmfssi.com<mailto:bseaton@rmfssi.com>\r\n\r\n\r\n",
      "user_id": 158007499314,
      "created_at": "2025-12-05T14:17:12Z",
      "updated_at": "2025-12-05T14:17:12Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014159603,
      "body_text": "Hello,\r\n\r\nI am contacting you urgently because the package delivered today is not the item I ordered. I received only the PRO X Ultra Plate Board (base plate) instead of the full pedal set.\r\n\r\nAttached is a photo of the SKU label on the box that was delivered.\r\nAs you can clearly see, it is labeled:\r\n\r\n“PRO X Ultra Plate Board”\r\n—not the pedal set that accounts for the majority of my over $500 order.\r\n\r\nAdditionally:\r\n\r\nFedEx shipping weight shows 4.8 lbs, which is far too light for a complete pedal assembly.\r\n\r\nThis confirms that only the base plate was shipped and the pedal set was never included in the package.\r\n\r\n\r\nThis is extremely frustrating given the long delays, the lack of communication, and the difficulty in obtaining tracking updates. To wait this long and then receive only a $30 accessory instead of the full product is completely unacceptable.\r\n\r\nI need this resolved immediately. Please provide one of the following today:\r\n\r\n1. Confirmation that the full pedal set will be shipped immediately overnight with a legitimate tracking number showing FedEx acceptance, OR\r\n\r\n\r\n2. A full refund for the pedal set, including shipping charges, if the correct product cannot be sent right away.\r\n\r\n\r\nPlease respond as soon as possible. This order has already been mishandled multiple times, and I need a fast and accurate resolution.\r\n\r\nThank you,\r\nBrandon Seaton\r\n\r\n\r\n\r\nSent from my T-Mobile 5G Device\r\n\r\n\r\n\r\n-------- Original message --------\r\n",
      "user_id": 158007499314,
      "created_at": "2025-12-08T23:54:05Z",
      "updated_at": "2025-12-08T23:54:05Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014238549,
      "body_text": "Hi Brandon Seaton,     We apologize, but the Pro X Ultra is currently out of stock at our US warehouse. We've urgently airfreighted a new shipment to replenish inventory and have already dispatched your order today. Here is your tracking link:    https://www.fedex.com/fedextrack/?trknbr=886915343407&trkqual=12029~886915343407~FDEG",
      "user_id": 158001343601,
      "created_at": "2025-12-10T07:19:11Z",
      "updated_at": "2025-12-10T07:19:11Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158014265930,
      "body_text": "Hello,\r\n\r\nI need to address the ongoing issues directly. Your latest message states that the Pro X Ultra pedal set is out of stock in the US warehouse and that a new shipment was airfreighted today. However, this completely contradicts your earlier statements, where you told me:\r\n\r\n\r\n  *   The pedal set was shipped on November 25 from China\r\n  *   The vibration motor was handed over to the US warehouse on December 3\r\n  *   And that the previous tracking number was for the pedal set\r\n\r\nThis new explanation confirms that the original information I received was incorrect. Furthermore, the fact that I previously received only the baseplate accessory—not the pedal set—already demonstrated that the original shipment was mishandled.\r\n\r\nNow, I am once again being provided with a tracking number that shows no movement, no scans, and no proof of shipment, exactly like before. The repeated delays, conflicting explanations, and lack of accountability have made it impossible for me to trust the fulfillment process for this order.\r\n\r\nBecause of this, I have already purchased a replacement pedal set from another vendor, which has shipped and will be delivered tomorrow. For that reason, I will not be accepting the Simsonn pedal set under any circumstances, even if it eventually arrives. I will be returning it immediately.\r\n\r\nPlease begin the return and refund process now.\r\n\r\nI also require a prepaid return shipping label for the accessory items that were incorrectly sent to me previously. Once I receive the label, I will ship everything back promptly.\r\nTo summarize:\r\n\r\n  1.  I will not be keeping the Simsonn pedal set even if delivered.\r\n  2.  I will return all items shipped to me.\r\n  3.  I require a prepaid return shipping label.\r\n  4.  I am requesting a full refund once the items are returned.\r\n  5.  The sale was lost due to repeated delays, contradictory information, and lack of proper customer service.\r\nPlease confirm when the return label has been issued and when the refund process has started.\r\n\r\nThank you,\r\nBrandon Seaton\r\n\r\n\r\n[signature-logo-w-outline-for-email.png]\r\nInterstate Treating, Inc. | www.InterTreat.com<http://www.intertreat.com/>\r\n7141 Club Drive | Mailing - PO Box 1386 | Odessa, Texas 79760-1386\r\nO: 432-367-1028<tel:432-367-1028> | bseaton@rmfssi.com<mailto:bseaton@rmfssi.com>\r\n\r\n\r\n",
      "user_id": 158007499314,
      "created_at": "2025-12-10T15:38:24Z",
      "updated_at": "2025-12-10T15:38:24Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014624840,
      "body_text": "Hi Brandon Seaton,    I apologize for not responding to you promptly. Your order has been shipped in full.",
      "user_id": 158001343601,
      "created_at": "2025-12-17T12:09:50Z",
      "updated_at": "2025-12-17T12:09:50Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158014639142,
      "body_text": "This is an update to close the loop on this order.\r\n\r\nI did receive the remaining items on Monday afternoon. However, this delivery came far too late after repeated delays, contradictory explanations, and a complete breakdown in communication over several weeks.\r\nBy the time the pedals arrived, I had already purchased, received, and fully installed an alternative pedal set from another vendor due to the uncertainty and missed timelines with this order.\r\n\r\nBecause of this:\r\n\r\n\r\n  *   I will not be keeping the Simsonn pedal set\r\n  *   I am returning all items associated with this order\r\n  *   This decision is final and is based on the overall handling of the purchase, not the product itself\r\n\r\nPlease proceed immediately with:\r\n\r\n\r\n  1.  Issuing a prepaid return shipping label for all items\r\n  2.  Confirming the return authorization\r\n  3.  Processing a full refund once the return is received\r\n\r\nTo be clear, this return is due to repeated delays, conflicting information about shipment status, and lack of accountability during fulfillment. The order was no longer viable by the time it was completed.\r\nPlease confirm when the return label has been issued.\r\n\r\nBrandon Seaton\r\n\r\n\r\n[signature-logo-w-outline-for-email.png]\r\nInterstate Treating, Inc. | www.InterTreat.com<http://www.intertreat.com/>\r\n7141 Club Drive | Mailing - PO Box 1386 | Odessa, Texas 79760-1386\r\nO: 432-367-1028<tel:432-367-1028> | bseaton@rmfssi.com<mailto:bseaton@rmfssi.com>\r\n\r\n\r\n",
      "user_id": 158007499314,
      "created_at": "2025-12-17T16:18:49Z",
      "updated_at": "2025-12-17T16:18:49Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014751966,
      "body_text": "Hi Brandon Seaton,    We apologize for the inconvenience. We can initiate the return process for you. May I ask if you need to return the entire set of pedals?",
      "user_id": 158001343601,
      "created_at": "2025-12-19T09:43:27Z",
      "updated_at": "2025-12-19T09:43:27Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158014767626,
      "body_text": "Hello,\r\n\r\nI need to clarify this, because my previous message was explicit and leaves no room for interpretation.\r\n\r\nYes, I am returning the entire order.\r\nThat includes all pedals and all accessories associated with Order #SSN3780.\r\n\r\nTo restate clearly:\r\n\r\nI will not be keeping any part of this order\r\n\r\nI am returning the full pedal set and all accessories\r\n\r\nI require a prepaid return shipping label for all items\r\n\r\nI am requesting a full refund once the return is received\r\n\r\n\r\nThis decision is final and is based on the overall handling of this purchase, including repeated delays, contradictory information, missed timelines, and lack of accountability. The fact that the remaining items arrived only after I had already purchased, received, and installed another pedal set confirms that the order was fulfilled far too late to be acceptable.\r\n\r\nPlease do not ask again whether I intend to return the full set — that has already been clearly stated multiple times.\r\n\r\nNext steps required:\r\n\r\n1. Issue a prepaid return shipping label for the entire order\r\n\r\n\r\n2. Confirm the return authorization\r\n\r\n\r\n3. Confirm the refund process and timeline\r\n\r\n\r\n\r\nI am documenting all correspondence as part of my PayPal dispute. I would prefer to resolve this directly, but I need prompt and accurate action at this point.\r\n\r\nPlease confirm when the return label has been issued.\r\n\r\nThank you,\r\nBrandon\r\n\r\n\r\n\r\nSent from my T-Mobile 5G Device\r\n\r\n\r\n\r\n-------- Original message --------\r\n",
      "user_id": 158007499314,
      "created_at": "2025-12-19T15:12:55Z",
      "updated_at": "2025-12-19T15:12:55Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014853854,
      "body_text": "Hi Brandon Seaton,    We apologize for the confusion caused. We have sent you a return label. Please notify us once you've shipped the item.",
      "user_id": 158001343601,
      "created_at": "2025-12-22T02:14:48Z",
      "updated_at": "2025-12-22T02:14:48Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158014994878,
      "body_text": "Item was dropped off at Post Office today at 12:18pm CST. All items are packed in one box and well packed.\r\n\r\nB\r\n\r\n\r\n\r\nSent from my T-Mobile 5G Device\r\n\r\n\r\n\r\n-------- Original message --------\r\n",
      "user_id": 158007499314,
      "created_at": "2025-12-23T18:20:41Z",
      "updated_at": "2025-12-23T18:20:41Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158015029703,
      "body_text": "Hi Brandon Seaton,    Alright, we'll process your refund once we receive it. Please cancel your chargeback first. Thank you.  Merry Christmas!",
      "user_id": 158001343601,
      "created_at": "2025-12-24T09:57:06Z",
      "updated_at": "2025-12-24T09:57:06Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158015758069,
      "body_text": "Hello,\r\nI need to be very clear here, because the way this is being handled is both unnecessary and prolonging an issue that should already be resolved.\r\n\r\nI have confirmed receipt of the returned items on December 29, and the return was completed in good faith and exactly as requested. At this point, the only remaining step is for you to process the refund. There is no requirement  from PayPal or otherwise, for me to cancel or close the dispute before that happens.\r\n\r\nIn fact, PayPal explicitly advises buyers not to close a dispute until the refund is completed and visible in their account. Once a case is closed, it cannot be reopened, which would leave me without protection if the refund were delayed, partial, or not issued at all. Given the repeated delays, contradictory information, and communication issues throughout this order, it would not be reasonable for me to remove that protection prematurely.\r\n\r\nTo be clear, the PayPal dispute exists because of how this transaction was handled:\r\n\r\n  *   Incorrect and partial shipment\r\n  *   Missed advertised timelines\r\n  *   Conflicting explanations regarding stock and shipment status\r\n  *   Repeated communication failures\r\n  *   A return that became necessary only after the order was fulfilled far too late\r\n\r\nAt this stage, asking me to cancel the dispute before issuing a refund only adds another unnecessary step and further delays resolution. You are fully able to process the refund while the dispute remains open. Once the refund is completed, the case can be closed without issue.\r\n\r\nI would prefer to resolve this cleanly and without further escalation. Please proceed with issuing the full refund now that the return has been received.\r\n\r\nOnce the refund is completed and visible in my PayPal account, I will have no issue with the case being closed.\r\n\r\nThank you.\r\nBrandon Seaton\r\n\r\n\r\n[signature-logo-w-outline-for-email.png]\r\nInterstate Treating, Inc. | www.InterTreat.com<http://www.intertreat.com/>\r\n7141 Club Drive | Mailing - PO Box 1386 | Odessa, Texas 79760-1386\r\nO: 432-367-1028<tel:432-367-1028> | bseaton@rmfssi.com<mailto:bseaton@rmfssi.com>\r\n\r\n\r\n",
      "user_id": 158007499314,
      "created_at": "2026-01-05T17:29:26Z",
      "updated_at": "2026-01-05T17:29:26Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}