{
  "id": 7289,
  "subject": "Pre-Order Questions",
  "description_text": "Hello,\r\n\r\nI would like to purchase *SIMSONN Sim Racing Gear Shifter Magnetic\r\nInduction* and *2x SIMSONN VAM pro linear motors* through AliExpress, but\r\nbefore I place the order, I have a few important questions.\r\n\r\nFirst, the total price of the items I need is above 150€, which means I\r\nwill have to pay an additional import tax. Because of this, I would like to\r\nask if it would be possible for you to declare a lower value (below 150€)\r\non the package, so that I don’t have to pay the extra tax. If this is\r\npossible, I will definitely make the purchase on AliExpress.\r\n\r\nAlso, could you please tell me what kind of mounting brackets are included\r\nwith these motors? Are they intended to be mounted vertically or\r\nhorizontally?\r\nI need the motors to be installed horizontally - that is their correct\r\nworking position - so I want to know if the package includes the necessary\r\nbrackets to mount them horizontally. If they come only with vertical\r\nmounts, would it be possible to change them to the horizontal mounting\r\nbrackets? This would save me from needing to buy extra 3D-printed adapters\r\nor mounts.\r\n\r\nIf this is possible, I will certainly purchase the products.\r\n\r\nThank you very much, and I look forward to your reply!\r\n—\r\nKind regards,\r\nTomas\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-12-02T22:33:51Z",
  "updated_at": "2025-12-03T09:55:56Z",
  "requester_id": 158007504894,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158013317508,
      "body_text": "Hi Tomas Tautkus,    The horizontal mounting bracket version of Haptics is available for purchase on the official website.  https://www.simsonn.com/products/simsonn-vam-pedals-haptic-reactor",
      "user_id": 158001343601,
      "created_at": "2025-12-03T09:55:56Z",
      "updated_at": "2025-12-03T09:55:56Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}