{
  "id": 72,
  "subject": "RE: 回复：RE: 回复：RE: 回复：Purchase pedals",
  "description_text": "Hello, I'd like to resume this conversation.\r\nCan the 30% discount you're offering be applied to me and my two teammates? That is, can you apply three 30% discounts to three different shipments?\r\n\r\nJuan E. Pelizzari\r\n\r\n________________________________\r\nDe: General and sales enquiries <service@simsonn.com>\r\nEnviado: miércoles, 19 de marzo de 2025 22:56\r\nPara: Juan Pelizzari <juane1@outlook.com>\r\nAsunto: 回复：RE: 回复：RE: 回复：Purchase pedals\r\n\r\nHi, you can check out and consider joining our Brand Ambassador Program. Sorry we can't send you a free set of pedals, but we can set you up with an exclusive 30% discount. If your exclusive link provides us with 10 orders, we can give you a full refund for your order, can you accept this offer?\r\nhttps://www.simsonn.com/pages/affiliate-program\r\n\r\n\r\nJuan Pelizzari<juane1@outlook.com> 在 2025年3月19日 周三 20:52 写道：\r\nThank you very much!!\r\n\r\nOur agreement with Cammus was as follows: They sent us three complete direct-drive rigs, we participated in different competitions using Cammus skins, we created videos on social media showcasing the products, and we promoted the brand in the Argentine simracing community. They gave us a special discount code, with which we collected commissions on sales. The agreement worked very well, but Cammus had certain financial problems; they couldn't continue the sponsorship.\r\n\r\nThonet & Vander is different; it's not a brand 100% dedicated to simracing, so they only provide money and headsets, and we generate content with their advertising. They targeted just one championship because it's broadcast on TV (it's the most important league in South America and is broadcast on Fox Sports ARG).\r\n\r\nIf you're willing, you can send some pedals, and we can generate content on social media. You can be sure that the South American sim racing world will see it, and your brand (which isn't well-known in these parts) will start to be mentioned. I like their commission system; it's very clear.\r\n\r\nOur IG: https://www.instagram.com/jmf.motorsport/\r\n\r\n\r\nJuan E. Pelizzari\r\n\r\n________________________________\r\nDe: General and sales enquiries <service@simsonn.com>\r\nEnviado: miércoles, 19 de marzo de 2025 09:41\r\nPara: Juan Pelizzari <juane1@outlook.com>\r\nAsunto: 回复：RE: 回复：Purchase pedals\r\n\r\nHi, we explain the difference between Plus and Pro X in more detail in this Q&A, you can refer to it.\r\nAlso, we would love to work with you . Can you provide us with your social media accounts, and how you would like to work together.\r\nhttps://www.simsonn.com/pages/affiliate-program\r\n[cid:F51A1EDB@E621E335.C775DB6700000000.png]\r\n\r\n\r\nJuan Pelizzari<juane1@outlook.com> 在 2025年3月19日 周三 18:52 写道：\r\nThank you very much for the gift card and your prompt response.\r\n\r\nQuestion 1: Is there much of a performance difference between the PRO PLUS and PRO X pedalboards?\r\n\r\nQuestion 2: I would like to know if you are interested in a collaboration agreement with our simracing team. We are a well-known team in Argentina; we compete in various leagues and try to have a strong presence on social media.\r\nWe are currently finalizing a collaboration agreement with CAMMUS and THONET & VANDER, so we are analyzing new partnerships.\r\n\r\nI look forward to your response. Thank you very much.\r\n\r\nJuan E. Pelizzari\r\n\r\n________________________________\r\nDe: General and sales enquiries <service@simsonn.com>\r\nEnviado: martes, 18 de marzo de 2025 23:13\r\nPara: Juan Pelizzari <juane1@outlook.com>\r\nAsunto: 回复：Purchase pedals\r\n\r\nHello, we did set the wrong shipping fee, thank you for your feedback! This $20 gift card is our thank you, you can now use it to complete your order!\r\nGift card code: p79x96td6bjq3876\r\n\r\n\r\nJuan Pelizzari<juane1@outlook.com> 在 2025年3月19日 周三 0:50 写道：\r\nHi, I'm trying to buy a pedalboard from Argentina, and the system shows me a shipping cost of 9.90. I suppose there's a mistake? Or is that the actual shipping cost to Argentina?\r\n\r\n[cid:7A1A5EDA@AF7F9542.C775DB6700000000.png]\r\n\r\nJuan E. Pelizzari\r\n\r\n\r\n",
  "status": 3,
  "priority": 3,
  "created_at": "2025-06-03T23:45:10Z",
  "updated_at": "2025-06-04T07:25:47Z",
  "requester_id": 158000955412,
  "responder_id": null,
  "cc_emails": [],
  "conversations": []
}