{
  "id": 7346,
  "subject": "Angry",
  "description_text": "So now I have to miss 4 hours of work because you guys specifically requested that I not be able to authorize a release meaning you guys requested that I'm not allowed to have UPS leave the package at my door, so now I have to miss work to sit at home and wait for UPS to deliver it and I can't just have them deliver again the next day because it'll be the same time frame the next day so no matter what I'm going to have to take time off of work to receive a package that could have been left at my door but you guys specifically requested not to and it's no sweat off your balls, you know why, it's not affecting you any you just don't want to have that possibility of a chargeback or a stolen item complaint and then have to deal with it which would cost your company money.. you don't give a rat's ass at all that I'm going to miss 4 hours of work waiting for a package to show up that could have been left at my door!!!!!!!!! So I'm leaving a one-star review and I'm going to create another account and I'm going to believe another one-star review and I'm going to bomb your entire freaking thing of one-star reviews because of your selfish request. This has been nothing but a horrendous experience absolutely horrendous no communication no transparency and then a selfish attitude by a company that doesn't want to risk having an item lost regardless of how it affects the customer that bought the item. If I have it requested be left at my door and it gets stolen guess who's both that is that's mine because I requested it so there's no reason why you guys should be requesting that I'd be home to sign for the fucking package!!! You either need to refund me or reimburse me for the time that I'm missing work but you're not going to do that are you you're just going to give me some corporate response of \"we're sorry,  we like to offer you a 10% discount on any future item so you have to put up with this again,  but we're not going to make it right because that would mean our company taking a loss even though that's what we're morally supposed to do!\r\n\r\n\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-12-03T15:16:51Z",
  "updated_at": "2025-12-04T02:05:43Z",
  "requester_id": 158007359335,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158013365172,
      "body_text": "Hi Corey Mason,    Hello, first of all, please don’t be upset. We completely understand the inconvenience caused by waiting for your package. Regarding the delivery and signature requirement, we would like to clarify that this measure is not an error, but a way to protect our customers’ interests. Every customer has different needs, and we cover the extra shipping costs to ensure the product is delivered safely and securely.  We fully understand that this may require you to take time to receive the package, and we sincerely apologize for the inconvenience. However, this approach is meant to minimize the risk of lost packages or disputes, thereby safeguarding the interests of all our customers. Even if this has led to negative feedback, it does not indicate a fault in our service, but rather a decision made after weighing security against convenience.  We highly value your feedback and will continue to optimize our service to reduce such inconveniences in the future. Thank you for your understanding and patience.",
      "user_id": 158000445778,
      "created_at": "2025-12-04T02:05:43Z",
      "updated_at": "2025-12-04T02:05:43Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}