{
  "id": 7826,
  "subject": "Missing package",
  "description_text": "Ive recently bought a pedal set with the haptics and mounts.  The pedals did come in a week ago. The haptics have not. The tracking information also shows it hasnt moved in 4 days so what should i do here?  \r\n\r\nTracking # : SF6047095993345\r\n                     \r\nOrder number : #ssn3918\r\nName : Matthew LeBlanc\r\n\r\nSent from my iPhone\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-12-10T00:36:03Z",
  "updated_at": "2025-12-12T05:58:24Z",
  "requester_id": 158007726399,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158014294707,
      "body_text": "So the link sent to me, does not take me to the ticket. Takes me to a simsonn page relating to what topic i need help with. Secondly. No associate has NOT reached out to me. So this is day 2 of trying to get an answer and day 5 that the package hasnt moved in tracking. Its been in the same city for a week. So just checking in to see what the company i bought $300 pedals from says about my missing package. Of course i got no help yesterday. I probably will get no help this time. Great service. If i would have known the items were coming from bejing i would've never purchased from you guys. Awesome transparent company. Super helpful. Whenever you guys feel ready to let me know. Id like to know why i havent got my package yet. Sent from my iPhone ",
      "user_id": 158007726399,
      "created_at": "2025-12-10T23:34:19Z",
      "updated_at": "2025-12-10T23:34:19Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014335619,
      "body_text": "This would be attempt number 3. Still ive gotten absolutely zero help. I want the rest of my order. If they dont move soon. Im contacting my credit card about a dispute since i havent got my items and you wont correct the issue. This has been the worst service. Sent from my iPhone ",
      "user_id": 158007726399,
      "created_at": "2025-12-11T16:27:01Z",
      "updated_at": "2025-12-11T16:27:01Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014342964,
      "body_text": "Can anybody update me as to whats going on. With my package. Even after multiple attempts and emails. Still not even an email to try to correct the issue. Still nobody has reached out to me. Ive been waiting. Am i supposed to wait until after the holidays? This was purchased 2 weeks ago . Worst company i have ever received service from. In person and online, And ive bought lemonade from a childrens lemonade stand. They had better service then this. ",
      "user_id": 158007726399,
      "created_at": "2025-12-11T18:31:53Z",
      "updated_at": "2025-12-11T18:31:53Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014350870,
      "body_text": "Ive tried countless times calling the number on your website for support. The call never goes through as if the number doesnt even work. I cant get an answer via email. Im disputing my charge. Worst service ever Sent from my iPhone ",
      "user_id": 158007726399,
      "created_at": "2025-12-11T20:52:02Z",
      "updated_at": "2025-12-11T20:52:02Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}