{
  "id": 7969,
  "subject": "Find Active YouTube Creators - Verified Contacts Updated Daily",
  "description_text": "\r\n    Hi Simsonn,\r\n\r\n    We noticed you might be looking to connect with YouTube creators for partnerships, sponsorships, or collaborations.\r\n\r\n    CreatorContacts is a searchable database of YouTube creator contact information. Every creator has posted a video in the last 2 months, ensuring you're reaching active channels.\r\n\r\n    How creators list their services:\r\n\r\n    Many creators provide transparent pricing for sponsored integrations, product reviews, content licensing, affiliate partnerships, and audience analytics access. When creators fill out their service information, you can see their rates, turnaround times, placement preferences, and terms before reaching out.\r\n\r\n    This eliminates back-and-forth negotiations and helps you quickly identify creators within your budget.\r\n\r\n    Search and filter by:\r\n    \r\n    Topic and niche categories\r\n    Subscriber range (minimum and maximum)\r\n    Country and geographic region\r\n    Contact availability (email, Instagram, TikTok, Twitter, LinkedIn)\r\n    Creators who have listed their service rates\r\n    \r\n\r\n    What you get:\r\n    \r\n    Verified email addresses (both public bio emails and hidden contact emails)\r\n    Complete social media profiles across all platforms\r\n    Channel analytics (subscriber count, video count, posting frequency)\r\n    Detailed service rates when creators have completed their profiles\r\n    \r\n\r\n    The database updates daily with new creators and contact information. You can save searches, bookmark channels, and export contact lists using a credit system.\r\n\r\n    Visit https://creatorcontacts.com today and start discovering YouTube creators for partnerships, sponsorships, collaborations and more!\r\n\r\n    Best regards,\r\n\r\n    The CreatorContacts Team\r\n    \r\n    \r\n    \r\n    Unsubscribe\r\n    \r\n    \r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-12-11T10:55:20Z",
  "updated_at": "2025-12-11T12:13:55Z",
  "requester_id": 158007754960,
  "responder_id": null,
  "cc_emails": [],
  "conversations": []
}