{
  "id": 8028,
  "subject": "Re: Haptics not working",
  "description_text": "Hello again, I reached out to you guys a couple of days ago but never got a response to my response. Basically one of my haptics stop working. It felt weak from the beginning. I’ve tried the haptics with sim hub and your software, all different ports in the power hub and got nothing, completely dead. Tried it with the other haptic and it works perfectly fine on all ports. Tried the bad haptic again today and it did not work. I checked the cable like you suggested and there is nothing wrong with it that I can see. So must be the actual haptic not working\r\n\r\nIf it’s possible to get a new one that would be lovely.\r\n\r\nIs it possible to use the same information from my last purchase? #SSN3585. If it is not please send a email and I will message the requested information back",
  "status": 3,
  "priority": 4,
  "created_at": "2025-12-11T21:45:06Z",
  "updated_at": "2025-12-18T11:06:04Z",
  "requester_id": 158007301322,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158014435349,
      "body_text": "Hi Harald Wernholm,  I noticed that you have opened several support tickets. Please compile a list of the items you need us to resend and provide corresponding photos. I will handle everything at once and arrange the replacement shipment. ",
      "user_id": 158000445778,
      "created_at": "2025-12-13T06:40:30Z",
      "updated_at": "2025-12-13T06:40:30Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158014449406,
      "body_text": "Hello, really sorry for sending so many support tickets. I didn’t realize it created new ones every time I responded / sent a mail. Once again really sorry!\r\n\r\nThe things I need from you guys if it is possible is a new VAM pro, One of my haptics that I bought has completely died after maybe 1 hour of use. I can send photos of the haptic and the cable like I was asked for in previous mails.\r\n\r\nThe other thing is I was told that I would get a refund for my express shipping since it took longer than promised.\r\n\r\nI would like to say that the actual pedals are really nice and I am very happy with them. So sorry for all the support tickets.\r\n\r\nI will send some pictures of the haptic aswell. There are no visual signs of damage to it which makes me think it is something internal.\r\n\r\nIf it is possible to send it to the same address as my last shipment that would be perfect.\r\n\r\n#SSN3585\r\n\r\n[image0.jpeg][image1.jpeg][image2.jpeg][image3.jpeg]\r\n\r\n",
      "user_id": 158007301322,
      "created_at": "2025-12-13T10:16:34Z",
      "updated_at": "2025-12-13T10:16:34Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014472007,
      "body_text": "Hi Harald Wernholm,  No problem. We will send you a new VAM Pro motor tomorrow (Monday) and provide you with the tracking number. ",
      "user_id": 158000445778,
      "created_at": "2025-12-14T03:07:19Z",
      "updated_at": "2025-12-14T03:07:19Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158014477348,
      "body_text": "Thank you so much!!!\r\n\r\n",
      "user_id": 158007301322,
      "created_at": "2025-12-14T08:35:58Z",
      "updated_at": "2025-12-14T08:35:58Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014684913,
      "body_text": "Hi Harald Wernholm,    We apologize for not arranging a replacement promptly. Here is your tracking link. https://t.17track.net/en#nums=SF6047184874150",
      "user_id": 158001343601,
      "created_at": "2025-12-18T11:06:03Z",
      "updated_at": "2025-12-18T11:06:03Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}