{
  "id": 8152,
  "subject": "Axial bearing dimensions – pedal customization question",
  "description_text": "Hello SIMSONN team,\r\n\r\nI am currently customizing and fine-tuning one of your pedal assemblies and\r\nduring disassembly I realized that I am missing *one axial thrust washer*\r\nfrom the pedal mechanism.\r\n\r\nThe assembly uses an *axial (thrust) bearing with two thrust washers*, both\r\nwashers having a locating groove (no flat washer involved).\r\n\r\nI would like to ask if you could please confirm the *exact dimensions* of\r\nthe thrust washer used in this assembly (inner diameter, outer diameter,\r\nand thickness), or alternatively the *part number* if it can be ordered as\r\na spare part.\r\n\r\nI have attached photos for reference:\r\n• one photo of the original thrust washer\r\n• one photo of the complete thrust bearing assembly\r\n• one photo showing the side where the washer is missing\r\n\r\nThis will help me ensure I use the correct replacement part.\r\n\r\nThank you very much for your support.\r\n\r\nKind regards,\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-12-13T13:27:18Z",
  "updated_at": "2025-12-14T02:29:37Z",
  "requester_id": 158007589448,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158014471464,
      "body_text": "Hi Dobre Alexandru Ionut,  Please provide a shipping address so we can send you a replacement bearing. Also, kindly share your order number, contact name, phone number, and full shipping address. ",
      "user_id": 158000445778,
      "created_at": "2025-12-14T02:18:26Z",
      "updated_at": "2025-12-14T02:18:26Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158014471526,
      "body_text": "I would like to sincerely thank you for your incredibly fast, kind, and\r\nprofessional support.\r\n\r\nI truly appreciate your willingness to help and even offer to send a\r\nreplacement part — that level of customer care really means a lot to me and\r\nsays a lot about Simsonn as a company.I wanted to let you know that,\r\nfortunately, I managed to find the missing part under my rig. It appears\r\nthat it had jumped away during assembly. After finding it, I was able to\r\nreassemble the entire mechanism correctly, and everything is now installed\r\nand functioning perfectly.\r\n\r\nThank you once again for your patience, support, and dedication to your\r\ncustomers. It genuinely gave me a lot of confidence in both the product and\r\nthe brand.\r\n\r\nWishing you all the best, and thanks again for the outstanding service!\r\n\r\nOn Sun, Dec 14, 2025 at 3:18 AM service@simsonn.com ",
      "user_id": 158007589448,
      "created_at": "2025-12-14T02:25:44Z",
      "updated_at": "2025-12-14T02:25:44Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014471600,
      "body_text": "Hi Dobre Alexandru Ionut,  We’re glad to hear that your issue has been resolved. If you encounter any problems during future use, please feel free to contact us at any time — we’ll be happy to assist you. ",
      "user_id": 158000445778,
      "created_at": "2025-12-14T02:29:37Z",
      "updated_at": "2025-12-14T02:29:37Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}