{
  "id": 8182,
  "subject": "1ZJ201H40334697857 tracking order for Christopher Fultz.",
  "description_text": "Good afternoon,\r\n\r\nI've placed an order for the following through Amazon Prime from Simsonn,\r\n1ZJ201H40334697857, order was placed 2 December, 2025. I received what\r\nseems to be (also attached below.) carbon fiber heel plate, baseplate, and\r\nRGB strip, screw assembly kit, and some electrical component assuming plugs\r\ninto Simsonn processor chip. I've tracked the 1JZ...7857 through\r\n17track.net/en which states delivered December 9, 2025 which is correct,\r\nbut just missing several needed items. I can't find any other tracking\r\nnumbers, emails, even in junk folder, etc. Hoping the pedals and what not\r\nare coming in another box. I don't know if I'm being impatient which could\r\npossibly be the case, but I'm missing the rest of the items for (PRO X\r\nU-P3-H3-1-1). I only recieved one box with what is in the attached picture\r\nbelow. I can be contacted via email and my cell phone number is (765)\r\n681-6580. My apologies if I'm causing confusion. Just want to make sure\r\nmissing items will indeed be arriving. I've contacted Amazon shipping and\r\nthey kept trying to opt for a full refund and telling me to reorder. But I\r\ndon't that needs to be the case as I'm assuming they've are shipped from a\r\ndifferent carrier. Thank you so much for what you do and a powerful day.\r\n\r\nChristopher Fultz\r\n\r\n",
  "status": 5,
  "priority": 1,
  "created_at": "2025-12-14T05:02:05Z",
  "updated_at": "2025-12-16T10:04:13Z",
  "requester_id": 158007803351,
  "responder_id": 158007774607,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158014563634,
      "body_text": "Hi christopher fultz,     Hi, The tracking number for the PRO X Ultra Pedals is 886910310322 (ships from US warehouse, the shipping carrier is FedEx, you can track it via https://www.fedex.com/fedextrack )",
      "user_id": 158007774607,
      "created_at": "2025-12-16T10:04:07Z",
      "updated_at": "2025-12-16T10:04:07Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}