{
  "id": 8488,
  "subject": "Pedals order SSN4201",
  "description_text": "Dear Sir or Madam,\r\n\r\nCould I please receive any kind of response to my previous inquiry?\r\n\r\nI truly understand that this is the holiday season and Black Friday period, and that you certainly have a lot of work and orders, but it is also very important for me to have some information about my order. It has been 13 business days since I placed the order, and I have received absolutely no update regarding the delivery. I have no idea when it is supposed to arrive, and since I contacted you about changing the delivery address, I currently do not even know where or when it should arrive.\r\n\r\nOn the same day I ordered your pedals, I also ordered a considerable amount of sim racing equipment from other websites, and everything arrived about 10 days ago at the address, so I truly do not understand how I cannot receive at least some kind of update to know what is happening.\r\n\r\nPlease provide a response and an update on the situation, otherwise I will be forced to cancel the order and request a refund.\r\n\r\nKind regards,\r\nDamir.\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-12-17T08:09:57Z",
  "updated_at": "2025-12-22T08:09:59Z",
  "requester_id": 158007694169,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158014618955,
      "body_text": "Hi Damir Tahirović,    We sincerely apologize for any inconvenience caused. Our German warehouse is currently out of stock, with restocking expected tomorrow. Once the product is back in stock, we will ship it to you via DHL and refund the additional shipping fees you paid.",
      "user_id": 158001343601,
      "created_at": "2025-12-17T08:51:41Z",
      "updated_at": "2025-12-17T08:51:41Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158014619692,
      "body_text": "Hello, \r\n\r\nIs there any chance to change the delivery address? I know it’s probably an issue because I would be changing the country and the city for delivery, but I just wanted to check.\r\n\r\nThere’s no need to refund me shipping fees, that’s not the point. I would simply like it to be delivered to Bosnia and Herzegovina, to my address. In that case, it wouldn’t matter so much to me when exactly the delivery arrives.\r\n\r\nThank you in advance for your reply.\r\n\r\nBest regards,\r\n\r\nDamir.\r\n\r\n\r\n> ",
      "user_id": 158007694169,
      "created_at": "2025-12-17T09:17:39Z",
      "updated_at": "2025-12-17T09:17:39Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}