{
  "id": 8598,
  "subject": "Re: Ticket Received - Order SSN4846 - Shipment",
  "description_text": "Friends, It is frustrating to deal with you. Do you have the pedals and accessories available in EU? If you have the prox ultra version available, I am willing to pay the difference if you can ship them earlier. Thanks. Sent from mobile On 18 Dec 2025, at 09:56, junk@stefanolaguardia.eu wrote: ﻿ Team, I am reading on Reddit that you have people waiting for you to ship pedals since beginning of December in EU. This is not only not fair, but also very disappointing as you promise on your website to deliver within 12 days. If you are not able to ship by today, I want you to immediately refund my order. Please confirm. I will buy from some other of your competitors. Thanks. Stefano Sent from mobile On 17 Dec 2025, at 15:13, support@simsonn.com wrote: ﻿ \r\n \r\n Hi Stefano Laguardia We would like to acknowledge that we have received your request and a ticket has been created. A support representative will be reviewing your request and will send you a personal response.(usually within 24 hours). To view the status of the ticket or add comments, please visit https://simsonn.freshdesk.com/helpdesk/tickets/8516?follow=email Thank you for your patience. View ticket If the button doesn't work, copy-paste this URL in your browser's address bar: https://simsonn.freshdesk.com/helpdesk/tickets/8516?follow=email Regards, simsonn Support Team \r\n\r\n\r\n\r\n\r\n\r\n \r\n \r\n\r\n\r\n\r\n\r\n8516:4206036\r\n\r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-12-18T12:45:26Z",
  "updated_at": "2025-12-23T05:52:40Z",
  "requester_id": 158007860322,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158014877011,
      "body_text": "Hi Stefano@catch,     Your order was originally scheduled for shipment from our German warehouse, but due to transportation delays, the goods arrived later than expected. They have now arrived at the warehouse, and we are processing them for storage and arranging DHL express shipping.",
      "user_id": 158007774607,
      "created_at": "2025-12-22T12:05:15Z",
      "updated_at": "2025-12-22T12:05:15Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}