{
  "id": 8613,
  "subject": "Fwd: Teil Fehlt von TC-1 Kit",
  "description_text": "Gibt es irgendwelche Neuigkeiten? Begin forwarded message: From: Calvin Williams <calvin@wi.llia.ms> Subject: Re: Teil Fehlt von TC-1 Kit Date: Dec 3, 2025 at 4:55 PM To: Calumet Kundenservice <kundenservice@calumet.de> Passt, vielen Dank. On 03.12.2025, at 14:31, Calumet Kundenservice <kundenservice@calumet.de> wrote: Hallo Calvin, vielen Dank für Ihre Nachricht. Ich habe Ihr Anliegen geprüft und werde Rücksprache mit unserem Einkauf halten. Sobald ich eine Rückmeldung habe, melde ich mich. Viele Grüße, Louiza Draoui Head of Customer Service ____________________________________ Calumet Photo Video Friesenweg 12 22763 Hamburg E-Mail: Kundenservice@calumet.de WWW.CALUMET.DE Calumet Photo Video GmbH, Friesenweg 12, 22763 Hamburg Geschäftsführer: Timo Voswinckel, Samuel Piers Nicols | Handelsregister AG Hamburg HRB 45430 Finanzamt Hamburg, Steuernr. 41/710/02805 | Umsatzsteueridentifikationsnr. DE118602497 Diese E-Mail enthält vertrauliche und/oder rechtlich geschützte Informationen. Wenn Sie nicht der richtige Adressat sind oder diese E-Mail irrtümlich erhalten haben, informieren Sie bitte sofort den Absender und vernichten Sie diese Mail. Das unerlaubte Kopieren sowie die unbefugte Weitergabe dieser Mail ist nicht gestattet. This e-mail may contain confidential and/or privileged information. If you are not the intended recipient (or have received this e-mail in error) please notify the sender immediately and destroy this e-mail. Any unauthorised copying, disclosure, or distribution of the material in this e-mail is strictly forbidden. Am Mo, 1 Dez um 6:31 NACHMITTAGS , Calvin Williams <calvin@wi.llia.ms> schrieb: Hallo, es fehlt ein Kabel von meinem Deity tc-1 kit. Es sind nur ein 3,5mm-TRS-zu-BNC-Kabel und ein 3,5mm-TRS-zu-3,5mm-TRS-Kabel dabei. Der 3,5mm-TRS-zu-5-pin-Timecode-Kabel fehlt aber. Laut Beschreibung sollt der dabei sein. Danke im Vorhinein, Calvin Bestellnummer: W-10435910-DE 1429661:1082183\r\n",
  "status": 5,
  "priority": 1,
  "created_at": "2025-12-18T15:29:44Z",
  "updated_at": "2025-12-23T00:26:57Z",
  "requester_id": 158007717463,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158014948543,
      "body_text": "此工单已关闭并合并至工单 7787。",
      "user_id": 158000445778,
      "created_at": "2025-12-23T00:26:57Z",
      "updated_at": "2025-12-23T00:26:57Z",
      "incoming": false,
      "private": true,
      "source": 2
    }
  ]
}