{
  "id": 8678,
  "subject": "Pedals order SSN4201",
  "description_text": "Dear Sir or Madam,\r\n\r\nCould you please answer my question as to whether it is possible to change the country and delivery address for your pedals?\r\n\r\nIf not, is it possible to cancel the order, since this whole process is taking a very long time and I cannot get an answer to the simplest possible question, not to mention the delivery, which by all accounts will take more than a month.\r\n\r\nI kindly ask for your response so that we can find some kind of compromise in this situation, as I am truly losing my patience.\r\n\r\nKind regards.\r\n",
  "status": 3,
  "priority": 4,
  "created_at": "2025-12-19T11:46:11Z",
  "updated_at": "2026-01-14T10:35:15Z",
  "requester_id": 158007694169,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158014814908,
      "body_text": "Dear Sir or Madam, Could you please answer my question as to whether it is possible to change the country and delivery address for your pedals? If not, is it possible to cancel the order, since this whole process is taking a very long time and I cannot get an answer to the simplest possible question, not to mention the delivery, which by all accounts will take more than a month. I kindly ask for your response so that we can find some kind of compromise in this situation, as I am truly losing my patience. Kind regards. ",
      "user_id": 158007694169,
      "created_at": "2025-12-20T15:54:17Z",
      "updated_at": "2025-12-20T15:54:17Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014863259,
      "body_text": "Hi Damir Tahirović,    Your order was originally scheduled for shipment from our German warehouse, but due to transportation delays, the goods arrived later than expected. They have now arrived at the warehouse, and we are arranging for them to be stocked and shipped via DHL Express. Please provide the updated address information as soon as possible.",
      "user_id": 158001343601,
      "created_at": "2025-12-22T08:09:14Z",
      "updated_at": "2025-12-22T08:09:14Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158014869516,
      "body_text": "Dear Sir, My adress is Generala Mehmeda Alagića br. 18, Municipality Novi grad, 71000 Sarajevo, Bosnia and Herzegovina. Please inform me if it is possible to delivery to that adress. Thank you in advance. Kind regards, Damir. ",
      "user_id": 158007694169,
      "created_at": "2025-12-22T09:41:30Z",
      "updated_at": "2025-12-22T09:41:30Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014954072,
      "body_text": "Hi Damir Tahirović,    We apologize, but our German warehouse cannot ship to Bosnia and Herzegovina. Shipping from China costs $146 USD and takes approximately 10 days. The goods have arrived at our German warehouse. Please confirm if you need to change the shipping address.",
      "user_id": 158001343601,
      "created_at": "2025-12-23T04:41:51Z",
      "updated_at": "2025-12-23T04:41:51Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158014964744,
      "body_text": "﻿ Hi Simsonn, In that case, I would kindly ask that the delivery be made to a different address in Austria. Izet Nanić Vinzenz-Muchitsch-Straße 6 8020 Graz Tn 47 +43 677 64724241 If there are any additional questions or information regarding the specific delivery to this address, the email you can write to is the following: izetnanic97@gmail.com If at all possible, I would kindly ask that the delivery be made during this week, and if it is not a problem, please let me know when I can expect the delivery. Thank you in advance. Kind regards, Damir. ",
      "user_id": 158007694169,
      "created_at": "2025-12-23T09:27:30Z",
      "updated_at": "2025-12-23T09:27:30Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014965564,
      "body_text": "Hi Damir Tahirović,    We apologize, but our German warehouse has ceased processing orders for the day. We will arrange for your shipment, but it will not be dispatched until after the holiday on the 29th.",
      "user_id": 158001343601,
      "created_at": "2025-12-23T10:01:25Z",
      "updated_at": "2025-12-23T10:01:25Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158014965657,
      "body_text": "Please confirm your address:  Izet Nanić  Vinzenz-Muchitsch-Straße 6  Tn 47  8020 Graz  Austria  +43 677 64724241",
      "user_id": 158001343601,
      "created_at": "2025-12-23T10:04:00Z",
      "updated_at": "2025-12-23T10:04:00Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158014968116,
      "body_text": "Hello, \r\n\r\nYes that is right address, you can deliver on that address. \r\n\r\nBest regards, \r\nDamir.\r\n\r\n> ",
      "user_id": 158007694169,
      "created_at": "2025-12-23T10:30:26Z",
      "updated_at": "2025-12-23T10:30:26Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158014968348,
      "body_text": "Alright, thank you for your confirmation.",
      "user_id": 158001343601,
      "created_at": "2025-12-23T10:38:22Z",
      "updated_at": "2025-12-23T10:38:22Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158015256779,
      "body_text": "Hello, \r\n\r\nIs there any update on my pedals ?\r\n\r\nBest regards.\r\n\r\n> ",
      "user_id": 158007694169,
      "created_at": "2025-12-30T14:41:44Z",
      "updated_at": "2025-12-30T14:41:44Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158015310728,
      "body_text": "Hi Damir Tahirović,    We apologize for the inconvenience. The pedals from our German warehouse are currently out of stock again. We will ship your order next week.",
      "user_id": 158001343601,
      "created_at": "2025-12-31T11:58:31Z",
      "updated_at": "2025-12-31T11:58:31Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158015745621,
      "body_text": "Hello, \r\n\r\nCan you please inform me when will you shipp my pedals ? \r\n\r\nIt has been more than a month since I ordered the pedals, and I don’t understand how it’s possible that I have been waiting this long. On top of that, I still don’t have clear information on when they are supposed to arrive.\r\nI am very dissatisfied with this approach.\r\nIf they will not be shipped during the course of this week, I kindly ask you to inform me so that I can cancel the order and start the refund process.\r\n\r\nThank you for your response.\r\n\r\n\r\n> ",
      "user_id": 158007694169,
      "created_at": "2026-01-05T15:01:17Z",
      "updated_at": "2026-01-05T15:01:17Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158016507837,
      "body_text": "Hello,\r\n\r\nCould you please refund my money? I am cancelling the order.\r\n\r\nPlease let me know what steps I need to take to start the refund process.\r\n\r\nI have never experienced worse service and support in my life; the review will be very negative regarding the overall experience over the past more than a month.\r\n\r\nKind regards.\r\n\r\n\r\n> ",
      "user_id": 158007694169,
      "created_at": "2026-01-09T08:54:46Z",
      "updated_at": "2026-01-09T08:54:46Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ]
}