{
  "id": 8911,
  "subject": "Re: Reminder: Order #SSN3772, how did it go?",
  "description_text": "I love the pedals The delivery service was amazing I just wish there was a more detailed guide as to which spacers and elastomers to use to achieve a certain feel, relying on YouTubers can be a minefield as they all say different things. I'm currently using the yellow elastomers (brake pedal) I just wish someone could literally tell me which set up would feel the most realistic, i.e elastomers, spacers, and where on the arm to put them. Kindest Regards, Nick. On 22 Dec 2025 16:55, SIMSONN <no-reply@loox.io> wrote: Hello Nick, We would be grateful if you shared how things look and feel. Your review helps us and the community that supports us, and it only takes a few seconds. ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ Hello Nick, We would be grateful if you shared how things look and feel. Your review helps us and the community that supports us, and it only takes a few seconds. Simsonn Pro X Ultra Sim Racing Pedal with Haptic Reactor Optional Pro X Ultra-P3-H3 / Baseplate Dislike it Love it! Simsonn VAM Pro Linear Motor - the Pedals Haptic Reactor for Vibration Feedback VAM Pro Set (3 pac/includes power supply) Dislike it Love it! Unsubscribe \r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2025-12-22T17:21:44Z",
  "updated_at": "2025-12-22T23:58:34Z",
  "requester_id": 158007501836,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158014947698,
      "body_text": "Hi Nick_reid,    Are you currently using F1 track mode or rally mode? Pedal travel is the most important factor in different modes.      F1 Mode: Suitable for short-travel braking. Using one damper provides the shortest travel. The 10mm spacer inside the brake spring can also be used to shorten travel, simulating brake disc clearance. One damper combined with the 10mm spring spacer is ideal for F1, giving the shortest braking travel.  Rally Mode: Suitable for long-travel braking, with up to three dampers. You can remove the 10mm spacer in the brake spring to increase travel.         Different damper colors suit different braking force requirements, depending on the maximum force you need. You can refer to the manual or product details for guidance on adjustments.",
      "user_id": 158000445778,
      "created_at": "2025-12-22T23:58:34Z",
      "updated_at": "2025-12-22T23:58:34Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}