{
  "id": 928,
  "subject": "Refund/Return/Repair request",
  "description_text": "Hello, I purchased the VAM Pro haptic reactors on June 4th and received them today . It was an extremely long wait, but I knew it would be plug and play and I'd get the power supply for free as compensation to the delay. However, I was very displeased to find out that there seems to be a major issue with the controller for the pedals. Whenever the motors are working, the brake pedals receives whatever is being output to the motor. I tried grounding the case with a wire to GND, switching to different inputs/outputs, whatever I'm doing, the brake is always getting the motor signal, which means when the throttle motor starts, the car starts braking aggressively. This does not happen with the throttle, I've never had problems with my pedals prior to this. I tried also using the old controller for pedal input and new controller just for motors, but it's still happening.\r\n\r\nI would like to get another, working, controller or get the one I received repaired. I paid a lot for this and I'm displeased with my experience so far. Great customer service would however help a lot and keep me as a Simsonn customer for years to come.\r\n\r\nThanks for your help in advance\r\n\r\n\r\n",
  "status": 3,
  "priority": 4,
  "created_at": "2025-06-27T17:28:39Z",
  "updated_at": "2025-06-30T05:49:30Z",
  "requester_id": 158001832474,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158004218629,
      "body_text": "Hi Charles Étienne,    Which pedal model are you currently using—PlusX, ProX, or ProX Ultra? Have you installed the latest version of SIMSONN Manager 2.0.8?  In the software, go to Settings → Update → Manual Firmware Update, then select the correct firmware file based on your pedal model from the Pedals-Firmware/pedals directory (e.g., prox.sfu, proxultra.sfu, or plusx.sfu).  After updating the firmware, please make sure you’ve set the minimum and maximum dead zones for each pedal—we typically recommend setting them to 5%.  We’ve conducted extensive internal testing, and many customers are currently using the VAM Pro motor. In all our tests and user feedback, the vibration does not interfere with the pedal signals and remains very stable. That’s why I’d like to confirm your pedal model and configuration so we can better assist you.  At present, we support telemetry for over 10 racing games directly. Additionally, you can use the test version of SIMHUB, which supports telemetry for over 100 racing titles. Here is the link to the test version—an official release from SIMHUB is coming soon.  Rest assured, our engineers are fully committed to helping you resolve any product issues. Please feel free to reach out if you have any questions or need assistance.     https://drive.google.com/file/d/1QrSbAvCC5iyx9XgdRgSQV-hWpmDGkujc/view?usp=sharing",
      "user_id": 158000445778,
      "created_at": "2025-06-28T00:26:19Z",
      "updated_at": "2025-06-28T00:26:19Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004218636,
      "body_text": "Hi Charles Étienne,    You’re most likely using Pro Plus pedals along with a newly purchased PlusX controller, correct? I understand your setup now.  Please make sure the pedals are properly connected to the PlusX controller. Then, in the SIMSONN Manager 2.0.8 software, click the Offset button in the top-right corner to reset the initial pedal signal. After that, unplug and replug the USB connection.  Since you purchased a new controller separately, we weren’t able to pre-configure the offset at the factory. That’s why it’s necessary to perform this manual zeroing during the initial setup.  Once done, you should see the output start from around 0%. Then, click the Calibrate button and follow the instructions to complete the calibration process for all three pedals.",
      "user_id": 158000445778,
      "created_at": "2025-06-28T00:32:14Z",
      "updated_at": "2025-06-28T00:32:14Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}