{
  "id": 9362,
  "subject": "Request for Purchase Order Number – Simsonn Pedal Plus X (AliExpress)",
  "description_text": "Dear Simsonn Support Team,\r\n\r\nI hope this message finds you well. I am reaching out regarding my purchase\r\nof the *Simsonn Pedal Plus X (2 Pedals, White Color without plate)* on\r\n*AliExpress* dated *9th December 2025*.\r\n\r\nUnfortunately, due to a factory reset caused by a software glitch on my\r\nsmartphone, I lost access to the passkey and my AliExpress account. As a\r\nresult, I am unable to retrieve the purchase order number, which I urgently\r\nneed in order to locate my account and reset my password.\r\n\r\nHere are the details I can provide to help verify my purchase:\r\n\r\n   - *Product:* Simsonn Pedal Plus X\r\n   - *Purchase Date:* 9th December 2025\r\n   - *Payment Method:* GPay linked with TrueMoney Wallet (Thailand)\r\n   - *Proof of Payment:* I have the payment slip and receipt from TrueMoney\r\n   - *Shipping Detail:* Lumpini Place Narathiwatratchanakarin\r\n      - 200(473 55 Naradhiwas Rajanagarindra Rd, Chong Nonsi, Yan Nawa,\r\n      Bangkok 10120, Unit 200/82, Building A\r\n      - Oudom\r\n      - +66 95 265 60 30\r\n      - *Order Status:* I have not yet received the product. I suspect the\r\n   delay may be related to customs or tax clearance as I remembered the\r\n   arrival should be 25 Dec 2025.\r\n\r\nGiven these circumstances, retrieving the *Purchase Order number* from\r\nAliExpress would be extremely helpful. It will allow me to recover my\r\naccount, resolve any customs or tax issues, and ensure successful delivery\r\nof the product.\r\n\r\nI kindly request your assistance in providing me with the Purchase Order\r\nnumber associated with this transaction. Please let me know if you require\r\nany further documentation or verification from my side. I am happy to\r\nprovide the payment slip, receipt, or shipping details as needed.\r\n\r\nThank you very much for your support and understanding. I look forward to\r\nyour reply.\r\n\r\nBest Regards\r\n\r\nOudom\r\n\r\n",
  "status": 5,
  "priority": 4,
  "created_at": "2025-12-28T12:32:18Z",
  "updated_at": "2025-12-28T15:16:13Z",
  "requester_id": 158008800299,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158015165843,
      "body_text": "此工单已关闭并合并到工单 9363 中",
      "user_id": 158000445778,
      "created_at": "2025-12-28T15:16:13Z",
      "updated_at": "2025-12-28T15:16:13Z",
      "incoming": false,
      "private": true,
      "source": 2
    }
  ]
}