{
  "id": 9363,
  "subject": "Request for Purchase Order Number – Simsonn Pedal Plus X (AliExpress)",
  "description_text": "Dear Simsonn Support Team,\r\n\r\nI hope this message finds you well. I am reaching out regarding my purchase\r\nof the *Simsonn Pedal Plus X (2 Pedals, White Color without plate)* on\r\n*AliExpress* dated *9th December 2025*.\r\n\r\nUnfortunately, due to a factory reset caused by a software glitch on my\r\nsmartphone, I lost access to the passkey and my AliExpress account. As a\r\nresult, I am unable to retrieve the purchase order number, which I urgently\r\nneed in order to locate my account and reset my password.\r\n\r\nHere are the details I can provide to help verify my purchase:\r\n\r\n   - *Product:* Simsonn Pedal Plus X\r\n   - *Purchase Date:* 9th December 2025\r\n   - *Payment Method:* GPay linked with TrueMoney Wallet (Thailand)\r\n   - *Proof of Payment:* I have the payment slip and receipt from TrueMoney\r\n   - *Shipping Detail:* Lumpini Place Narathiwatratchanakarin\r\n      - 200(473 55 Naradhiwas Rajanagarindra Rd, Chong Nonsi, Yan Nawa,\r\n      Bangkok 10120, Unit 200/82, Building A\r\n      - Oudom\r\n      - +66 95 265 60 30\r\n      - *Order Status:* I have not yet received the product. I suspect the\r\n   delay may be related to customs or tax clearance as I remembered the\r\n   arrival should be 25 Dec 2025.\r\n\r\nGiven these circumstances, retrieving the *Purchase Order number* from\r\nAliExpress would be extremely helpful. It will allow me to recover my\r\naccount, resolve any customs or tax issues, and ensure successful delivery\r\nof the product.\r\n\r\nI kindly request your assistance in providing me with the Purchase Order\r\nnumber associated with this transaction. Please let me know if you require\r\nany further documentation or verification from my side. I am happy to\r\nprovide the payment slip, receipt, or shipping details as needed.\r\n\r\nThank you very much for your support and understanding. I look forward to\r\nyour reply.\r\n\r\nBest Regards\r\n\r\nOudom\r\n\r\n",
  "status": 4,
  "priority": 1,
  "created_at": "2025-12-28T12:32:26Z",
  "updated_at": "2025-12-29T09:56:38Z",
  "requester_id": 158008800299,
  "responder_id": 158007774664,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158015165841,
      "body_text": "ID 为 9362 的工单已合并到此工单。",
      "user_id": 158000445778,
      "created_at": "2025-12-28T15:16:12Z",
      "updated_at": "2025-12-28T15:16:12Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158015165842,
      "body_text": "合并来自工单9362  \n      主题: Request for Purchase Order Number – Simsonn Pedal Plus X (AliExpress)  \n      描述:  \n Dear Simsonn Support Team, \n I hope this message finds you well. I am reaching out regarding my purchase of the Simsonn Pedal Plus X (2 Pedals, White Color without plate) on AliExpress dated 9th December 2025. \n Unfortunately, due to a factory reset caused by a software glitch on my smartphone, I lost access to the passkey and my AliExpress account. As a result, I am unable to retrieve the purchase order number, which I urgently need in order to locate my account and reset my password. \n Here are the details I can provide to help verify my purchase: \n \n \nProduct: Simsonn Pedal Plus X \n \nPurchase Date: 9th December 2025 \n \nPayment Method: GPay linked with TrueMoney Wallet (Thailand) \n \nProof of Payment: I have the payment slip and receipt from TrueMoney \n \nShipping Detail: Lumpini Place Narathiwatratchanakarin \n \n 200(473 55 Naradhiwas Rajanagarindra Rd, Chong Nonsi, Yan Nawa, Bangkok 10120, Unit 200/82, Building A \n Oudom \n +66 95 265 60 30 \n \n \n \nOrder Status: I have not yet received the product. I suspect the delay may be related to customs or tax clearance as I remembered the arrival should be 25 Dec 2025. \n \n Given these circumstances, retrieving the Purchase Order number from AliExpress would be extremely helpful. It will allow me to recover my account, resolve any customs or tax issues, and ensure successful delivery of the product. \n I kindly request your assistance in providing me with the Purchase Order number associated with this transaction. Please let me know if you require any further documentation or verification from my side. I am happy to provide the payment slip, receipt, or shipping details as needed. \n \n\n\n\n\n\n\n \n Thank you very much for your support and understanding. I look forward to your reply. \n Best Regards \n Oudom",
      "user_id": 158000445778,
      "created_at": "2025-12-28T15:16:12Z",
      "updated_at": "2025-12-28T15:16:12Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158015188816,
      "body_text": "Hi oudom chanthy,  We have already replied to you online on AliExpress.",
      "user_id": 158007774664,
      "created_at": "2025-12-29T09:56:34Z",
      "updated_at": "2025-12-29T09:56:34Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}