{
  "id": 9442,
  "subject": "Issue with breakpedal LED/ Controlbox",
  "description_text": "Dear Simsonn Support Team, I am using the Simsonn Pro X Ultra pedals (brake + throttle only) and overall I am very satisfied with the product. The pedal feel and build quality are excellent. However, recently the LED on the brake pedal started malfunctioning. The LED behaves erratically and does not light up correctly, although it should. To rule out the pedal itself, I connected the brake pedal to the clutch port on the control box. In that configuration, the LED works perfectly. This clearly indicates that the brake pedal hardware and LED are fine, and the issue is very likely caused by the control box / brake channel. So far: Brake pedal LED faulty on brake port Brake pedal LED works correctly on clutch port Throttle pedal works as expected → Control box seems to be the source of the problem Please let me know how to proceed. I assume a replacement or solution for the control box is required. If you need photos, videos, serial numbers, or order details, let me know exactly what you need. Best regards Noah",
  "status": 2,
  "priority": 1,
  "created_at": "2025-12-29T09:31:25Z",
  "updated_at": "2026-01-20T20:28:15Z",
  "requester_id": 158008806525,
  "responder_id": 158007774607,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158015248512,
      "body_text": "Hi Noah. ludwig,  Please provide some photos so I can check the issue and assist you in resolving it. Also, make sure to use the USB 3.0 blue port on the back of your computer. ",
      "user_id": 158000445778,
      "created_at": "2025-12-30T11:13:50Z",
      "updated_at": "2025-12-30T11:13:50Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158015432012,
      "body_text": "Hi, the USB device is connected directly to the PC (rear USB port). The requested photos are attached. Best regards Noah ",
      "user_id": 158008806525,
      "created_at": "2026-01-02T20:47:06Z",
      "updated_at": "2026-01-02T20:47:06Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158016155174,
      "body_text": "Hi Noah. ludwig,  Just to confirm: is the LED on the right side of the brake pedal flashing, while the left-side LED is working normally? Please provide your order number, contact name, phone number, and shipping address, and we will send you a replacement left-side brake LED assembly for replacement. ",
      "user_id": 158000445778,
      "created_at": "2026-01-07T15:14:35Z",
      "updated_at": "2026-01-07T15:14:35Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158016160710,
      "body_text": "Hi, thank you for your message. To clarify the situation again in detail: The same brake pedal and LED work perfectly when connected to the clutch port of the control box. The LED only behaves erratically when the brake pedal is connected to the brake port. This clearly indicates that the brake pedal and LED assembly are functioning correctly. Therefore, the issue is very likely related to the brake channel of the control box, not the LED itself. Because of this, replacing only the LED assembly will most likely not resolve the issue. Regarding the order number: The pedals were purchased in China via a local Chinese app while I was on a business trip. Now that I am back in Germany, I no longer have access to this app or the order details, so unfortunately I cannot provide an order number. However, I can provide my full contact name, phone number, and shipping address without any issue. I kindly ask you to advise on a solution regarding the control box (for example, a replacement or another appropriate fix), as this appears to be the root cause of the problem. Best regards Noah ",
      "user_id": 158008806525,
      "created_at": "2026-01-07T15:48:58Z",
      "updated_at": "2026-01-07T15:48:58Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158016253328,
      "body_text": "Hi Noah. ludwig,  Please first follow the steps below to update the software and check whether the issue can be resolved. If the problem still persists, please provide your contact name, phone number, and shipping address, and we will send you a ProX Ultra control box as a replacement. ",
      "user_id": 158000445778,
      "created_at": "2026-01-08T02:22:12Z",
      "updated_at": "2026-01-08T02:22:12Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158016281687,
      "body_text": "Hi, I have followed the software update steps as instructed and tested the pedals again. Unfortunately, the issue is still present — the brake pedal LED continues to flicker. As requested, here are my contact and shipping details: Name: Noah Ludwig Address: Montessoristr. 35a Postal Code / City: 68753 Waghäusel Country: Germany Phone number: +49 163 5144610 Best regards Noah",
      "user_id": 158008806525,
      "created_at": "2026-01-08T06:02:46Z",
      "updated_at": "2026-01-08T06:02:46Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158016321440,
      "body_text": "Hi Noah. ludwig,  Could you provide the address and name you used when you made the purchase on the Chinese app? This will need to be assigned to the appropriate platform to process your order.",
      "user_id": 158007774607,
      "created_at": "2026-01-08T10:13:34Z",
      "updated_at": "2026-01-08T10:13:34Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158016327793,
      "body_text": "Hi, unfortunately, I no longer have access to the Chinese app through which the purchase was made. Therefore, I am unable to determine which name or address was used at the time of purchase. Please use the contact name and shipping address I have already provided for further processing. Thank you for your understanding. Best regards Noah ",
      "user_id": 158008806525,
      "created_at": "2026-01-08T10:52:45Z",
      "updated_at": "2026-01-08T10:52:45Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158016418005,
      "body_text": "Hi, here is the hotel where the pedals were delivered during my business trip in China: Crowne Plaza Hefei Rongqiao Luyang District Hefei, Anhui China 230001 The delivery timeframe should have been approximately between August 24th and August 27th. Please let me know if this information is sufficient. Best regards Noah ",
      "user_id": 158008806525,
      "created_at": "2026-01-08T20:03:44Z",
      "updated_at": "2026-01-08T20:03:44Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158016846799,
      "body_text": "Hi Noah. ludwig,  We have sent a new replacement to your address in Germany. Here is its tracking number: SF6047237031331, the shipping carrier is SF Express, you can track it via https://www.sf-international.com/cn/en/support/querySupport/waybill. ",
      "user_id": 158007774607,
      "created_at": "2026-01-12T08:52:04Z",
      "updated_at": "2026-01-12T08:52:04Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158016847782,
      "body_text": "Hi, thank you very much for the great support and for sending the replacement. I really appreciate your help and hope that everything will work properly once it arrives. Best regards Noah Am 12.01.2026 09:52 schrieb service@simsonn.com: \r\n \r\n Hi Noah. ludwig, We have sent a new replacement to your address in Germany. Here is its tracking number: SF6047237031331, the shipping carrier is SF Express, you can track it via https://www.sf-international.com/cn/en/support/querySupport/waybill. \r\n \r\n \r\n \r\n On \r\n Fri, 9 Jan at 4:03 AM \r\n , Noah. ludwig <noah.ludwig@online.de> wrote: \r\n Hi, \r\n \r\n here is the hotel where the pedals were delivered during my business trip in China: \r\n \r\n Crowne Plaza Hefei Rongqiao \r\n Luyang District \r\n Hefei, Anhui \r\n China 230001 \r\n \r\n The delivery timeframe should have been approximately between August 24th and August 27th. \r\n \r\n Please let me know if this information is sufficient. \r\n \r\n Best regards \r\n Noah \r\n \r\n \r\n \r\n \r\n \r\n ",
      "user_id": 158008806525,
      "created_at": "2026-01-12T09:21:24Z",
      "updated_at": "2026-01-12T09:21:24Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158017488128,
      "body_text": "Hi, thank you very much for the smooth and fast support and for sending the replacement control box. I really appreciate the effort and your help so far. I am sorry to come back to you again, but after testing the new control box, the issue is unfortunately still the same: When the brake pedal is connected to the clutch port, the LED works perfectly. When the brake pedal is connected to the brake port, the LED continues to flicker. Since this behavior is identical with both the original and the replacement control box, it seems quite unusual, which is why I wanted to ask if you might have any further ideas or recommendations on how this could be resolved. Any help or guidance would be greatly appreciated. Thank you again for your support. Best regards Noah ",
      "user_id": 158008806525,
      "created_at": "2026-01-20T13:02:16Z",
      "updated_at": "2026-01-20T13:02:16Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ],
  "available_langs": []
}