{
  "id": 957,
  "subject": "No reaction",
  "description_text": "There was no one online at the time of the appointment to look in my PC with Todesk.  Now it don't get an answer on my question when the appointment will be made.     I can also send video of the not working pedal and configuration. Could you please send a replacement brake pedal and off the problem is on my behalf I will fully pay for the costs. When a factory default, then I have a working pedal.",
  "status": 4,
  "priority": 1,
  "created_at": "2025-06-28T10:39:33Z",
  "updated_at": "2025-06-28T14:03:10Z",
  "requester_id": 158001710346,
  "responder_id": null,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158003680192,
      "body_text": "Hi Raymond van de Ven,     If the throttle’s one-way hydraulic damper was sent incorrectly, we can send you the correct one. Regarding the loose control box, could you please send us a video? That would help us better assess and resolve the issue.",
      "user_id": 158000445778,
      "created_at": "2025-06-22T12:44:34Z",
      "updated_at": "2025-06-22T12:44:34Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158003680859,
      "body_text": "I'm sorry, sent last message without video\r\nPLEASE READ EMAIL SENT EARLIER\r\n\r\nOp zo 22 jun 2025, 19:51 schreef Raymond@Bootcampleek.nl <\r\nraymond@bootcampleek.nl>:\r\n\r\n> Goodday,\r\n> Thank you for the quick response!\r\n> Attached is a video of the box and another issue.\r\n> (Do I have to make another ticket for this?)\r\n>\r\n> My old Simsonn pedals are great but i thought i would upgrade to a\r\n> nicer/newer set. However I noticed some negative differences...\r\n> But let's start with the positive!\r\n>\r\n> Positive:\r\n> - great software so far!\r\n> - nice pedal plate surface\r\n> - slick breakout box\r\n>\r\n> Negatives:\r\n> - pedal mounting plate has some bending when braking, maybe make extra\r\n> (centre) holes at the front for alu profile bar?\r\n> - the black on the metal is VERY easily removed/scratched.\r\n> - there is lateral play in the brake and the clutch pedals! My old pedals\r\n> did absolutely not have any movement whatsoever.\r\n> - I had to tinker with the preload springs and set a tension on the\r\n> throttle, but I later found out that the hole on the hydraulic rod was too\r\n> big for the metal insert. So there is little play back and forth. Very\r\n> annoying and I used tape to fill the gap, but that is not something you\r\n> wish from your new pedals ..\r\n>\r\n> All in all not the upgrade I was hoping for ? I love your product and I\r\n> will keep my old pedals set for another rig, but I hope you can help me\r\n> with my problems/findings.\r\n>\r\n> Kind regards,\r\n> Raymond\r\n>\r\n> Op zo 22 jun 2025, 14:44 schreef service@simsonn.com <service@simsonn.com\r\n> >:\r\n>\r\n>> Hi Raymond van de Ven,\r\n>>\r\n>>\r\n>> If the throttle’s one-way hydraulic damper was sent incorrectly, we can\r\n>> send you the correct one. Regarding the loose control box, could you please\r\n>> send us a video? That would help us better assess and resolve the issue.\r\n>>\r\n>>\r\n>> Aan Zo, 22 Jun om 7:53 AM , Raymond van de Ven <vitanorm80@gmail.com>\r\n>> schreef:\r\n>> Goodday,\r\n>>\r\n>> I have received the pro plus pedals and I've installed them. The\r\n>> hydraulic rod on the gaspedal says \"one way\" but it is actually\r\n>> bi-directional... I can send a video if you like.\r\n>>\r\n>> What I also noticed is that the electronics/print plate inside the\r\n>> control box are loose. I have not opened the box yet but I could also make\r\n>> a video of that if needed.\r\n>>\r\n>> Can you please help.\r\n>>\r\n>> Kind regards,\r\n>> Raymond van de Ven\r\n>>\r\n>> 704:4206036\r\n>>\r\n>\r\n\r\n",
      "user_id": 158001688800,
      "created_at": "2025-06-22T17:56:08Z",
      "updated_at": "2025-06-22T17:56:08Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158003681013,
      "body_text": "Goodday, Thank you for the quick response! Attached is a video of the box and another issue. (Do I have to make another ticket for this?)  My old Simsonn pedals are great but i thought i would upgrade to a nicer/newer set. However I noticed some negative differences... But let's start with the positive!  Positive: - great software so far! - nice pedal plate surface - slick breakout box  Negatives: - pedal mounting plate has some bending when braking, maybe make extra (centre) holes at the front for alu profile bar? - the black on the metal is VERY easily removed/scratched. - there is lateral play in the brake and the clutch pedals! My old pedals did absolutely not have any movement whatsoever. - I had to tinker with the preload springs and set a tension on the throttle, but I later found out that the hole on the hydraulic rod was too big for the metal insert. So there is little play back and forth. Very annoying and I used tape to fill the gap, but that is not something you wish from your new pedals ..  All in all not the upgrade I was hoping for  I love your product and I will keep my old pedals set for another rig, but I hope you can help me with my problems/findings.  NEW PROBLEM!!! MY BRAKE PEDAL HAS NO INPUT! usb disconnect sound keeps repeating also...     Kind regards, Raymond",
      "user_id": 158001710346,
      "created_at": "2025-06-22T19:08:17Z",
      "updated_at": "2025-06-22T19:08:17Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158003683359,
      "body_text": "ID 号为 704 和 712 的工单已合并到此工单。",
      "user_id": 158000445778,
      "created_at": "2025-06-23T03:57:01Z",
      "updated_at": "2025-06-23T03:57:01Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158003683360,
      "body_text": "合并来自工单704  \n      主题: Problem with pedals  \n      描述:  Goodday,   \n I have received the pro plus pedals and I've installed them. The hydraulic rod on the gaspedal says \"one way\" but it is actually bi-directional... I can send a video if you like. \n   \n What I also noticed is that the electronics/print plate inside the control box are loose. I have not opened the box yet but I could also make a video of that if needed. \n   \n Can you please help. \n   \n Kind regards, \n Raymond van de Ven ",
      "user_id": 158000445778,
      "created_at": "2025-06-23T03:57:02Z",
      "updated_at": "2025-06-23T03:57:02Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158003683362,
      "body_text": "合并来自工单712  \n      主题: Brake pedal defect  \n      描述:  When I enter the manager I can see the load cell has a reading but I press nothing (also unscrewed elastomers etc to check). See image. Calibration does not work because of the set value (registers 149kg). Nothing happens when I press the brake. Even if I press real hard. \n See other ticket for other issues regarding breakout box and USB problem \n   \n Kind regards \n Raymond",
      "user_id": 158000445778,
      "created_at": "2025-06-23T03:57:02Z",
      "updated_at": "2025-06-23T03:57:02Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158003683379,
      "body_text": "Hi Raymond van de Ven,  I’ve reviewed your three support tickets and summarized the main issues. Regarding the USB disconnection issue—could it be caused by a loose screw inside the control box, leading to a short circuit or poor contact? If possible, please open it up and check. For the lateral movement of the brake and clutch pedals, kindly send us a video so we can better assess the issue. As for the paint peeling, our products are batch-processed using electrophoretic coating. Please provide some photos so we can investigate further. We will consolidate all issues related to the one-way hydraulic rod and arrange a replacement shipment for you. ",
      "user_id": 158000445778,
      "created_at": "2025-06-23T04:00:46Z",
      "updated_at": "2025-06-23T04:00:46Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158003683409,
      "body_text": "Hi Raymond van de Ven,  If the brake is showing no signal as you mentioned, please make sure all pedals are properly installed and connected to the controller. Then, use the \"Offset\" function at the top of the software to reset to zero. After that, the data should start from around 0%. ",
      "user_id": 158000445778,
      "created_at": "2025-06-23T04:05:21Z",
      "updated_at": "2025-06-23T04:05:21Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158003683442,
      "body_text": "ID 为 711 的工单已合并到此工单。",
      "user_id": 158000445778,
      "created_at": "2025-06-23T04:12:26Z",
      "updated_at": "2025-06-23T04:12:26Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158003683443,
      "body_text": "合并来自工单711  \n      主题: Re: Problem with pedals  \n      描述:  Goodday, \nThank you for the quick response! \nAttached is a video of the box and another issue. \n(Do I have to make another ticket for this?) \n My old Simsonn pedals are great but i thought i would upgrade to a nicer/newer set. However I noticed some negative differences... \nBut let's start with the positive! \n Positive: \n- great software so far! \n- nice pedal plate surface \n- slick breakout box \n Negatives: \n- pedal mounting plate has some bending when braking, maybe make extra (centre) holes at the front for alu profile bar? \n- the black on the metal is VERY easily removed/scratched. \n- there is lateral play in the brake and the clutch pedals! My old pedals did absolutely not have any movement whatsoever. \n- I had to tinker with the preload springs and set a tension on the throttle, but I later found out that the hole on the hydraulic rod was too big for the metal insert. So there is little play back and forth. Very annoying and I used tape to fill the gap, but that is not something you wish from your new pedals .. \n All in all not the upgrade I was hoping for ? I love your product and I will keep my old pedals set for another rig, but I hope you can help me with my problems/findings. \n Kind regards, \nRaymond \n  \n Op zo 22 jun 2025, 14:44 schreef service@simsonn.com <service@simsonn.com>: \n \n  \n\t Hi Raymond van de Ven,   \n \n If the throttle’s one-way hydraulic damper was sent incorrectly, we can send you the correct one. Regarding the loose control box, could you please send us a video? That would help us better assess and resolve the issue. \n   \n     \n  Aan Zo, 22 Jun om 7:53 AM , Raymond van de Ven <vitanorm80@gmail.com> schreef:  Goodday,   \n I have received the pro plus pedals and I've installed them. The hydraulic rod on the gaspedal says \"one way\" but it is actually bi-directional... I can send a video if you like. \n   \n What I also noticed is that the electronics/print plate inside the control box are loose. I have not opened the box yet but I could also make a video of that if needed. \n   \n Can you please help. \n   \n Kind regards, \n Raymond van de Ven ",
      "user_id": 158000445778,
      "created_at": "2025-06-23T04:12:26Z",
      "updated_at": "2025-06-23T04:12:26Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158003684319,
      "body_text": "Goodday,  Thank you for handeling as one ticket.     1. The lateral play:  I attached a video     2. The hydraulic rod:  I attached a video     3. The brake:  I used the offset button as recommended, disconnected the usb and the first time noting happened. The second time the value indeed went to 0 but there is no input. Calibration also does not respond.     4. The black paint:  It is not what I expected, but if we can get to a good outcome for my problems, that would be far more important to me.     I hope we can resolve it quickly because otherwise I cannot make more videos or join races this way     Kind regards.",
      "user_id": 158001710346,
      "created_at": "2025-06-23T09:35:06Z",
      "updated_at": "2025-06-23T09:35:06Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158003741899,
      "body_text": "Hi Raymond van de Ven,     I reviewed the video you sent. The previous version used a wave spring, which may get compressed over time and create a gap. In the new upgraded brake, the lateral movement could be due to a missing thin spacer. However, once added, this spacer makes the structure more durable than other solutions and helps prevent the pedal from shifting toward the center.  As for the hydraulic damper, based on the video, it appears to be unidirectional, since the return stroke is very light and easy to pull back.",
      "user_id": 158000445778,
      "created_at": "2025-06-24T03:09:10Z",
      "updated_at": "2025-06-24T03:09:10Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158003741909,
      "body_text": "Hi Raymond van de Ven,       Regarding the brake calibration issue, you can install a remote tool called Todesk. It's safe and doesn't require registration. Just provide an ID and a temporary verification code, and I’ll assist you remotely to resolve the issue.",
      "user_id": 158000445778,
      "created_at": "2025-06-24T03:10:52Z",
      "updated_at": "2025-06-24T03:10:52Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158003742758,
      "body_text": "Goodday,  Thank you for the quick response.     Unfortunate that the tiny washers are missing in both the clutch and brake pedal.. my old pedal have no play, even after many years, so you were wrong with assumptions about old pedal set ?     If I install the program, when will you/we be able to have a look?  And what are the solutions for the 3 problems if the load cell of the brake is faulty, for the rod and the lateral play?",
      "user_id": 158001710346,
      "created_at": "2025-06-24T06:06:36Z",
      "updated_at": "2025-06-24T06:06:36Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158003835418,
      "body_text": "Hi Raymond van de Ven,  It’s currently 16:53 China time. I will assist you remotely in about 5 hours, around 22:00 China time. ",
      "user_id": 158000445778,
      "created_at": "2025-06-25T08:54:38Z",
      "updated_at": "2025-06-25T08:54:38Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158003835867,
      "body_text": "Thank you for the quick response,  Our internet provider has had issues and is still not resolved (T-Mobile) and I am on their phone network also l, so whe have no internet at the moment. I am messaging you from a café around the corner ?     Could we plan for tomorrow?",
      "user_id": 158001710346,
      "created_at": "2025-06-25T10:56:05Z",
      "updated_at": "2025-06-25T10:56:05Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158003837264,
      "body_text": "Hi Raymond van de Ven, Let's schedule the remote session for tomorrow at around the same time—it's 9:53 PM here now. If we're still unable to resolve the issue remotely, I will arrange to send you a replacement device. ",
      "user_id": 158000445778,
      "created_at": "2025-06-25T13:54:28Z",
      "updated_at": "2025-06-25T13:54:28Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158003921822,
      "body_text": "I have downoaded todesk but it is in chinese? i dont know what to do",
      "user_id": 158001710346,
      "created_at": "2025-06-26T14:05:13Z",
      "updated_at": "2025-06-26T14:05:13Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158003921893,
      "body_text": "I canot conect or login te todesk. I have an appointment ain 15 minutes with a client unfortunatly.     When i plug the pedals in my older model simsonn box, the clutch and throttle work (not the right range, but i can see them at a higher value.) the brake does not register or calibrate at all. so i think it is a problem with a faulty loadcell",
      "user_id": 158001710346,
      "created_at": "2025-06-26T14:13:18Z",
      "updated_at": "2025-06-26T14:13:18Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158003921924,
      "body_text": "ToDesk:  设备代码:653 355 463  临时密码:pa6h73d0",
      "user_id": 158001710346,
      "created_at": "2025-06-26T14:17:42Z",
      "updated_at": "2025-06-26T14:17:42Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158004075286,
      "body_text": "Hi Raymond van de Ven,  I'm at work now. Are you online? We can proceed with the remote session now. ",
      "user_id": 158000445778,
      "created_at": "2025-06-27T01:20:19Z",
      "updated_at": "2025-06-27T01:20:19Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004101385,
      "body_text": "Sadly the time was missed yesterday...  The time you sent messaged was around midnight I just got up. I have an hour right now or in two hours (10:00 Netherlands/Amsterdam time)",
      "user_id": 158001710346,
      "created_at": "2025-06-27T06:01:09Z",
      "updated_at": "2025-06-27T06:01:09Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158004220072,
      "body_text": "Hi Raymond van de Ven,  Are you still online? If you're available for a remote session, I can help you check the issue right now to confirm whether we should send you a replacement controller box or a new brake pedal. Otherwise, it might cause some delay. Today is Saturday, and we can arrange the shipment for any necessary replacement parts—either the pedal or the controller—on Monday. ",
      "user_id": 158000445778,
      "created_at": "2025-06-28T12:16:58Z",
      "updated_at": "2025-06-28T12:16:58Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158004220093,
      "body_text": "i am online now  will send todesk link",
      "user_id": 158001710346,
      "created_at": "2025-06-28T12:23:25Z",
      "updated_at": "2025-06-28T12:23:25Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158004220094,
      "body_text": "ToDesk:  设备代码:653 355 463  临时密码:vam03ybi",
      "user_id": 158001710346,
      "created_at": "2025-06-28T12:24:18Z",
      "updated_at": "2025-06-28T12:24:18Z",
      "incoming": true,
      "private": false,
      "source": 2
    },
    {
      "id": 158004220211,
      "body_text": "ID 为 713 的工单已合并到此工单。",
      "user_id": 158000445778,
      "created_at": "2025-06-28T12:54:40Z",
      "updated_at": "2025-06-28T12:54:40Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158004220212,
      "body_text": "合并来自工单713  \n      主题: Lateral play  \n      描述:  There is lateral play on both the brake pedal and the clutch. The old model I have does noet have play. Then this is not an upgrade or is it? \n   \n Kind regards \n Raymond",
      "user_id": 158000445778,
      "created_at": "2025-06-28T12:54:40Z",
      "updated_at": "2025-06-28T12:54:40Z",
      "incoming": false,
      "private": true,
      "source": 2
    },
    {
      "id": 158004220543,
      "body_text": "Hi Raymond van de Ven,     You can add a washer to that pedal to prevent any loosening or shifting of the components. We will send you the original washer on Monday — it may have been accidentally omitted during assembly. We sincerely apologize for the oversight and truly appreciate your understanding and support.",
      "user_id": 158000445778,
      "created_at": "2025-06-28T14:03:10Z",
      "updated_at": "2025-06-28T14:03:10Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}