{
  "id": 9660,
  "subject": "Re: A shipment from order #SSN4926 is on the way",
  "description_text": "Dear SIMSONN, We are pleased to inform you that today, December 31, 2025, at 11:15 AM Spanish time, we received order #SSN4926 with tracking number JSELG1756294322YQ. The package contains two boxes: 1. The \"PRO X ULTRA\" pedals 2. The \"Baseplate and Carbon Fiber Heel Plate\" The following items were not included: a) Haptic Reactor SetVAM Pro Linear Motor (3 pack/includes power supply) b) U-Shaped Mounting Bracket for Brake, U-Shaped Mounting Bracket for Throttle We await your shipment. Sincerely, Rosa. El dia 17 de des. 2025 9:12, SIMSONN <service@simsonn.com> va escriure: SIMSONN Order #SSN4926 Your order is on the way Your order is on the way. Track your shipment to see the delivery status. View your order or Visit our store Other tracking number: JSELG1756294322YQ Items in this shipment Newest Simsonn Pedal Pro X Ultra with Haptics and RGB Feedback × 1 Pro X Ultra-P3-H3 / Baseplate Part of: Newest Simsonn Pedal Pro X Ultra with Haptics and RGB Feedback If you have any questions, reply to this email or contact us at service@simsonn.com",
  "status": 3,
  "priority": 4,
  "created_at": "2025-12-31T11:01:40Z",
  "updated_at": "2026-01-15T09:14:23Z",
  "requester_id": 158008830770,
  "responder_id": 158001343601,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158015310033,
      "body_text": "We have attached a photo of the two boxes received in the package. Sincerely, Rosa El dia 31 de des. 2025 12:06, service@simsonn.com va escriure: Hi Òscar Vilanova We would like to acknowledge that we have received your request and a ticket has been created. A support representative will be reviewing your request and will send you a personal response.(usually within 24 hours). To view the status of the ticket or add comments, please visit https://simsonn.freshdesk.com/helpdesk/tickets/9660?follow=email Thank you for your patience. View ticket If the button doesn't work, copy-paste this URL in your browser's address bar: https://simsonn.freshdesk.com/helpdesk/tickets/9660?follow=email Regards, Support Center Support Team 9660:4206036",
      "user_id": 158008830770,
      "created_at": "2025-12-31T11:22:16Z",
      "updated_at": "2025-12-31T11:22:16Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158015317268,
      "body_text": "Dear SIMSONN, It is with regret that we inform you that at 4:50 PM Spanish time, we received the remaining part of order #SSN4926, tracking number JSELG1756294322YQ. One package contains the missing items: a) Haptic Reactor SetVAM Pro Linear Motor (3 packs/includes power supply) b) U-Shaped Mounting Bracket for Brake, U-Shaped Mounting Bracket for Throttle It was a little strange receiving the order in two parts, but the important thing is that everything arrived in perfect visual condition. Photos are attached. Sincerely, Rosa. El dia 17 de des. 2025 9:12, SIMSONN ",
      "user_id": 158008830770,
      "created_at": "2025-12-31T16:03:03Z",
      "updated_at": "2025-12-31T16:03:03Z",
      "incoming": true,
      "private": false,
      "source": 0
    },
    {
      "id": 158017172711,
      "body_text": "Hi Òscar Vilanova,    Great to hear the good news—have fun!  Feel free to reach out anytime if you have any problem.",
      "user_id": 158001343601,
      "created_at": "2026-01-15T09:14:23Z",
      "updated_at": "2026-01-15T09:14:23Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}