{
  "id": 9761,
  "subject": "Vam Pro connection issues",
  "description_text": "     \r\n \r\n\r\n \r\n \r\n  I have the Pro x Ultra with the Vam Pro hepatics. There seems to be a myriad of connection issues. After about 5-10 min if they stay connected there is a humming or buzzing with no inputs. This is only resolved by unplugging the USB from the computer. The hepatics will also randomly disconnect and will not be recognized by my Simsonn manager. If   unplugged from the computer, it will resolve for approx. 5-10 min and it will either make the buzzing sound or disconnect. This is nonstop. I have researched this online and have tried fixes that were noted there. Changed cables, plugged the hub directly to the PC, not through a hub. I have manually updated the pedals with firmware in the simsonn folder with no results. Are there any additional fixes that can resolve this issue?  \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n\r\n \r\n     \r\n",
  "status": 3,
  "priority": 1,
  "created_at": "2026-01-02T01:32:33Z",
  "updated_at": "2026-01-02T03:32:04Z",
  "requester_id": 158007690841,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158015377812,
      "body_text": "Hi Michael McElroy,  If this occurs, it indicates that your PC’s grounding may be unreliable, possibly because a three-prong plug was not used in a grounded wall outlet. You can refer to the post below and connect the three metal screws on the PC case, control box, and pedals, which should resolve the disconnection issue.  https://github.com/SHWotever/SimHub/wiki/USB-Issues-Troubleshooting https://support.gomezsimindustries.com/portal/en/kb/articles/understanding-emi-and-grounding  ​   ​     Additionally, please confirm that the software version is 2.1.2 and the firmware versions are CPU1: 2.0.5 and CPU2: 2.0.4. ",
      "user_id": 158000445778,
      "created_at": "2026-01-02T03:32:04Z",
      "updated_at": "2026-01-02T03:32:04Z",
      "incoming": false,
      "private": false,
      "source": 0
    }
  ]
}