{
  "id": 9942,
  "subject": "Calibration issues.",
  "description_text": "Hello, my name is zaher and i purchased a simsonn pro x plus pedal set from\r\nyou 2 momths ago. Im having issues with calibration. After your latest\r\nmanager and pedal update, i have found that the calibration is flickering\r\nand is not working as soon as i plug in the simsonn pedals in any racing\r\ngame. Please advise as im losing hope.\r\n\r\n",
  "status": 2,
  "priority": 1,
  "created_at": "2026-01-04T21:59:53Z",
  "updated_at": "2026-01-18T08:57:52Z",
  "requester_id": 158008901042,
  "responder_id": 158000445778,
  "cc_emails": [],
  "conversations": [
    {
      "id": 158016101114,
      "body_text": "Hi Zaher Bizri,     Please first uninstall SIMSONN Manager 2.1.2 from your PC, then download and install the latest version from our official website. After installation, go to Settings → Update → Manual Firmware Update → pedals → firmware → pedals-plusx.sfu and complete the firmware update.  After updating:    If the white signal is not at 0%, click the Offset button to reset the white raw signal to 0%;    Then recalibrate the pedals;    Once calibration is complete, the blue signal should move smoothly from 0% to 100%;    Next, calibrate the pedals in-game and set the minimum and maximum dead zones if needed;    Finally, bind the pedals in the game.    If the issue still persists, please record a video and share it with us via Google Drive, making sure the link access is set to viewable. I will review it and provide you with a solution.     https://www.simsonn.com/pages/download",
      "user_id": 158000445778,
      "created_at": "2026-01-07T09:13:26Z",
      "updated_at": "2026-01-07T09:13:26Z",
      "incoming": false,
      "private": false,
      "source": 0
    },
    {
      "id": 158017340327,
      "body_text": "Hello!\r\nJust wanted to let you know that your guidance did lead to success!\r\n\r\nI truly appreciate your help!\r\n\r\nSincerely,\r\n\r\nZaher\r\n\r\nOn Wed, Jan 7, 2026, 2:13 AM service@simsonn.com ",
      "user_id": 158008901042,
      "created_at": "2026-01-17T19:46:40Z",
      "updated_at": "2026-01-17T19:46:40Z",
      "incoming": true,
      "private": false,
      "source": 0
    }
  ],
  "available_langs": []
}